{"url": "https://es.wikipedia.org/wiki/Informetría", "title": "Informetría", "summary": "El término informetría aparece en 1979 y se consensuó por parte de los autores para designar estudios cuantitativos de la documentación.\nOtto Nack, en Alemania Occidental la define como la aplicación de métodos matemáticos a las situaciones y a los hechos en el campo de la información, con la finalidad de describir y analizar sus fenómenos, descubrir sus leyes y servir de soporte a sus decisiones.\nEl ODLIS (Online Dictionary for Library and Information Science) la define como el uso de métodos matemáticos y estadísticos en investigaciones relacionadas con bibliotecas, documentación e información. La reconoce como sinónimo de infometría.[1]​", "sections": [{"name": "Discusiones sobre el término", "text": "Ciertos autores como Brookes consideran que la informetría cubre la bibliometría y a la cienciometría y liga a la bibliometría con la actividad bibliotecaria. La informetría une a la bibliotecología con las nuevas tecnologías y otros autores como Leo Egges y Ronald Rosseau están de acuerdo en que la bibliometría está ligada a la actividad bibliotecaria y bibliográfica y la cienciometría a la política científica\nTanto, Brookes, Egges como Rosseau, están de acuerdo en que el término informetría sea el que se imponga a los otros y la bibliometría y la cienciometría serían campos dentro de la informetría, por lo tanto consideran a la informetría como un campo global.", "subsections": []}, {"name": "Referencias", "text": "↑ Reitz, Joan M. (2014). «Online Dictionary for Library and Information Science ABC-CLIO > ODLIS > odlis_I».  En ABC-CLIO Corporate, ed. www.abc-clio.com. Consultado el 25 de junio de 2019. \nVanti, Nadia (2000). «Métodos cuantitativos de evaluación de la ciencia:bibliometría, cienciometría e informetría». Investigación Bibliotecológica 24 (n. 29 julio/diciembre). p. 9-23.. [1]​\nReitz, Joam M. (2014). «Online Dictionary for Library and Information Science ABC-CLIO > ODLIS > odlis_I». En ABC-CLIO Corporate. www.abc-clio.com. Consultado el 2019-06-25.", "subsections": [{"name": "Véase también", "text": "Bibliometría\nCienciometría\nCibermetría\n↑ Error en la cita: Etiqueta <ref> no válida; no se ha definido el contenido de las referencias llamadas :0"}]}]}
