{"url": "https://es.wikipedia.org/wiki/oric_1", "title": "Oric 1", "summary": "El Oric 1 fue un ordenador doméstico fabricado por Tangerine Computer Systems mediante la creación de la compañía Oric Products International Ltd para competir con el Sinclair ZX Spectrum con un procesador 6502.\n"}
{"url": "https://es.wikipedia.org/wiki/%C2%A3", "title": "£", "summary": "El símbolo de la libra (\" £ \", más común en el Reino Unido) es el símbolo de la libra británica (pound), la moneda del Reino Unido . El mismo símbolo se utiliza (o se ha utilizado) en otros países y territorios para monedas del mismo nombre. Sin embargo, también hay países cuya moneda se llama pound, pero que no utilizan oficialmente el símbolo £.\n"}
{"url": "https://es.wikipedia.org/wiki/Amperio", "title": "Amperio", "summary": "[\n]\nEl amperio,[3]​ ampere[4]​ o ampère (símbolo A) es la unidad de intensidad de corriente eléctrica. Forma parte de las unidades básicas en el sistema internacional de unidades y recibió ese nombre en honor al matemático y físico francés André-Marie Ampère (1775-1836).\nSe define al fijar el valor numérico de la carga elemental, e, en 1.602 176 634 × 10-19, cuando se expresa en la unidad C, igual a A·s, donde el segundo se define en función de ΔνCs. El efecto de esta definición es que el amperio es la corriente eléctrica correspondiente al flujo de 1/(1.602 176 634 × 10−19) = 6.241 509 074 × 1018 cargas elementales por segundo.\nEsta definición se adoptó el 16 de noviembre de 2018 en la 26ª Conferencia General de Pesas y Medidas acordándose su entrada en vigor el 20 de mayo de 2019.\nEl amperio y el culombio se relacionan mediante: \n1\nA\n=\n1\nC\ns\n{\\displaystyle \\mathrm {1\\,A=1{\\frac {\\,C}{s}}} \\,}\n Si bien el amperio es unidad básica y el culombio no lo es, en la práctica, la actual definición de amperio depende de la de culombio.\n"}
{"url": "https://es.wikipedia.org/wiki/Arco_iris", "title": "Arcoíris", "summary": "Un arcoíris[1]​[2]​ o arco iris es un fenómeno óptico y meteorológico que causa la aparición en la atmósfera terrestre de un arco multicolor, a veces, doble, por la descomposición de la luz solar en el espectro visible. Se produce por refracción, cuando la luz atraviesa gotas de agua. Está formado por arcos concéntricos de colores, sin solución de continuidad entre ellos, con el rojo hacia la parte exterior y el violeta hacia el interior. A altitud suficiente, por ejemplo cuando se viaja en avión, el arcoíris se puede observar en forma de círculo completo. \nCuando se observa un arcoíris doble, el arco secundario rodea al primario. Su intensidad es más tenue y el orden de los colores está invertido.\nPara los colores vistos por el ojo humano, la secuencia más comúnmente citada y recordada es la de Isaac Newton, definida por siete colores fundamentales: rojo, naranja, amarillo, verde, azul, índigo y violeta. Una lectura cuidadosa del trabajo de Newton indica que el color que llamó azul es lo que actualmente llamaríamos cian.[3]​\n"}
{"url": "https://es.wikipedia.org/wiki/BASIC", "title": "BASIC", "summary": "Busca fuentes: «BASIC» – noticias · libros · académico · imágenes\nBASIC, siglas de Beginners' All-purpose Symbolic Instruction Code[1]​ (en castellano: ‘Código simbólico de instrucciones de propósito general para principiantes’), es una familia de lenguajes de programación de alto nivel. \nEl BASIC original, el Dartmouth BASIC, fue diseñado en 1964 por John George Kemeny, Thomas Eugene Kurtz y Mary Kenneth Keller en el Dartmouth College en New Hampshire, Estados Unidos, como un medio para facilitar la programación en ordenadores a estudiantes (y profesores) que no fueran de ciencias. \nEn aquella época, casi todo el uso de los computadores requería codificar software hecho a medida, con lo cual quedaba restringido a personas con formación como científicos y matemáticos. \nBASIC originalmente fue desarrollado como una herramienta de enseñanza. El lenguaje y sus variantes llegaron a estar ampliamente disponibles en las microcomputadoras a finales de los años 1970 y en los años 1980. \nBASIC sigue siendo popular a día de hoy en un puñado de dialectos altamente modificados, y en nuevos lenguajes, influenciados por BASIC tales como Microsoft Visual Basic o Gambas en GNU/Linux. \nEn el año 2006, el 59 % de los desarrolladores para la plataforma .NET usaban Visual Basic .NET como su único lenguaje.[2]​\n"}
{"url": "https://es.wikipedia.org/wiki/Baudio", "title": "Baudio", "summary": "El baudio es una unidad de medida utilizada en telecomunicaciones que representa el número de símbolos por segundo en un medio de transmisión.[1]​ Debe su nombre al apellido de Émile Baudot, que fue un ingeniero de telegrafía francés inventor de un aparato telegráfico y del código Baudot (1874) utilizado por los teletipos.\nEn general, cada símbolo se compone de una o varias señales físicas en función del esquema de modulación y se corresponde con una u otra cantidad de información en bits. Así, es posible encontrar una relación directa entre la velocidad en baudios y la velocidad en bits por segundo en una línea; solo cuando cada símbolo representa un único bit de información ambas velocidades coinciden. Así\nn\n=\nr\nb\nr\ns\n{\\displaystyle n={\\frac {rb}{rs}}}\ndonde:\nr\nb\n{\\displaystyle rb}\n: régimen binario o tasa de bits\nr\ns\n{\\displaystyle rs}\n: tasa de modulación o tasa de símbolos y\nn\n{\\displaystyle n}\n: número de bits por nivel para la codificación de línea.\nEl baudio puede escalarse en términos métricos:\n1 kBd (kilobaudio) = 1000 Bd\n1 MBd (megabaudio) = 1000 kBd\n1 GBd (gigabaudio) = 1000 MBd.\n"}
{"url": "https://es.wikipedia.org/wiki/CPU", "title": "Unidad central de procesamiento", "summary": "La unidad central de procesamiento (conocida por las siglas CPU, del inglés Central Processing Unit) o procesador es un componente del hardware dentro de un ordenador, teléfonos inteligentes, y otros dispositivos programables.\nSu función es interpretar las instrucciones de un programa informático mediante la realización de las operaciones básicas aritméticas, lógicas, y externas (procedentes de la unidad de entrada/salida). Su diseño y su avance ha variado notablemente desde su creación, aumentando su eficiencia y potencia y reduciendo el consumo de energía y el coste.\nUn ordenador puede contener más de una CPU (multiprocesamiento). En la actualidad, los microprocesadores están constituidos por un único circuito integrado (chip) aunque existen los procesadores multinúcleo (varias CPU en un solo circuito integrado). Un circuito integrado que contiene una CPU también puede contener los dispositivos periféricos y otros componentes de un sistema informático; similar a un microcontrolador (menos potente en RAM) se le denomina sistema en un chip (SoC).\nLos componentes de la CPU son:\nUnidad aritmético lógica o unidad de cálculo (del inglés: Arithmetic Logic Unit o ALU): realiza operaciones aritméticas y lógicas.[1]​\nUnidad de control (CU): dirige el tráfico de información entre los registros de la CPU y conecta con la ALU las instrucciones extraídas de la memoria.\nRegistros internos: no accesibles (de instrucción, de bus de datos y bus de dirección) y accesibles de uso específico (contador programa, puntero pila, acumulador, flags, etc.) o de uso general.\n"}
{"url": "https://es.wikipedia.org/wiki/Casete", "title": "Casete", "summary": "El casete[1]​ o caset,[2]​ también conocido como casete compacto o cassette («cajita» en francés), es un formato de grabación de sonido o vídeo en cinta magnética que fue ampliamente utilizado entre principios de la década de 1970 y fines de la década de 1990. Es también mencionado a menudo como casete de audio o cinta casete. Aunque estuvieron previstos originalmente como medio para el dictado, las mejoras en la fidelidad del sonido condujeron a que el casete suplantara la grabación en magnetófono de bobina abierta en la mayoría de sus usos domésticos.[3]​ Sus aplicaciones se extendieron desde el audio portátil de grabación casera al almacenamiento de datos para computadoras. En la etapa de su vigencia, era uno de los dos formatos más comunes para la música pregrabada, junto a los discos de vinilo. Fueron reemplazados más adelante por el disco compacto.\n[4]​\nConstan de dos carretes en miniatura, entre los cuales se pasa una cinta magnética. Estos carretes y sus otras piezas se encuentran dentro de una carcasa protectora de plástico. En la cinta están disponibles dos pares de pistas estereofónicas, uno por cada cara (una cara se reproduce cuando el casete se inserta con sus revestimientos laterales de cara A o lado A para arriba y la otra cuando se le da la vuelta, cara B o lado B).[5]​\nEl casete es un soporte analógico, aunque también se desarrollaron formatos de cinta digitales, como la cinta de audio digital (DAT) y el casete compacto digital (DCC).\n"}
{"url": "https://es.wikipedia.org/wiki/Commodore_64", "title": "Commodore 64", "summary": "Commodore 64 (C64, CBM 64/CBM64, C=64,C-64, VIC-64[1]​) es una computadora doméstica de 8 bits desarrollada por Commodore International en agosto de 1982 a un precio inicial de 595 dólares. Sucede a la Commodore VIC-20 y a la Commodore MAX Machine, con 64 kilobytes (65 536 bytes) de RAM, con gráficos y sonido muy por encima de otros equipos contemporáneos.\nUtilizaba una unidad de casete (Datasette) además de una disquetera de 5 1/4 pulgadas (Commodore 1541). Disponía de un teclado profesional muy robusto, distintas tomas de conexión y poseía infinidad de videojuegos, aplicaciones y gráficos. Contaba con una paleta de 16 colores y un intérprete BASIC (el Commodore BASIC v2.0). Aceptaba la conexión directa de periféricos sin necesidad de una interfaz de conexión, (como alguno de sus más directos competidores) incorporando dos puertos de conexión de mandos de juego (joysticks), puertos serie IEC, RS232 y C2N, salida a televisión, salidas de vídeo compuesto y audio mediante conector DIN de alta fidelidad y un puerto de expansión para cartuchos. Algunos cartuchos incorporaban lenguajes de programación como COBOL, o un BASIC más avanzado, o expansión de RAM, más algunas utilidades para congelar los juegos y poder copiarlos. Su reloj funcionaba a menos de 1 Megahercio, pero sus excelentes capacidades gráficas y sonoras, hicieron de ella la computadora personal favorita de millones de usuarios caseros. Hoy en día existen programas que emulan su funcionamiento al completo, para GNU/Linux, Windows y otros sistemas operativos.\nEl Commodore 64 sigue siendo el modelo de computadora doméstica más vendida en el mundo. Se estiman sus ventas entre 22,5 y 17 millones de unidades[2]​\n"}
{"url": "https://es.wikipedia.org/wiki/Conector_DIN", "title": "Conector DIN", "summary": "Véase también:\nEl conector DIN es un tipo de conector, originariamente estandarizado por el Deutsches Institut für Normung,'DIN', organización encargada de la estandarización en Alemania.\nExisten estándares del DIN para una gran cantidad de diferentes conectores, por lo tanto el término “conector DIN” por sí mismo no identifica un conector particular a menos que se le añada el número que ilustre el tipo de conector en particular (por ejemplo, \"conector DIN 41524\").\nEn el contexto de electrónica de consumo, por regla general, conector DIN se refiere a los conectores con extremo circular que fueron los primeros normalizados por el DIN, para ser empleados en las señales analógicas de audio. Algunos de estos conectores fueron usados posteriormente en la transmisión analógica de vídeo y en interfaces digitales, por ejemplo: MIDI y PS/2 de IBM para teclados y mouses de computadoras personales. Los sezrches DIN para estos conectores no estuvieron mucho tiempo en prensa y fueron pronto reemplazados por los equivalentes internacionales IEC 60130-9\nTodos los conectores macho (plugs) de la familia de conectores tienen extremo de metal con 13,2 mm de diámetro con bordes especiales para limitar la orientación al ser insertados en las ranuras. Existe un rango de conectores de la misma forma que difieren solo en la configuración de los pines y que fue estandarizado originariamente en la DIN 41524 (de 3 o 5 pines), la DIN 45322 (de 5 pines a 60°), la DIN 45326 (8 pines), la DIN 45329 (7 pines), y otros estándares para un rango de diferentes aplicaciones.\nLos conectores consisten en una lámina metálica circular para proteger los pines que sobresalen. La lámina metálica está dentada para que sea insertada con la orientación correcta en su enchufe y prevenir de esta forma el daño en los aparatos eléctricos.\nExisten siete patrones comunes y cualquier número de pines desde tres hasta ocho. Existen dos conectores de cinco pines diferentes, conocidos en la industria como 180° y 240° (a veces denominado de 270°) intentando mencionar la disposición de los pines. Existe alguna ligera compatibilidad, por ejemplo un conector de tres pines puede ajustarse en cualquier enchufe de cinco pines de 180°, permitiendo que tres de los pines del conector queden sin conexión, pero uno de cinco pines no se enchufará en uno de tres pines. Al igual que uno de cinco pines encaja en un enchufe de siete o de ocho.\n"}
{"url": "https://es.wikipedia.org/wiki/Corriente_continua", "title": "Corriente continua", "summary": "La corriente continua (abreviada CC en español, así como DC en inglés) se refiere al flujo continuo de carga eléctrica a través de un conductor entre dos puntos de distinto potencial y carga eléctrica, que no cambia de sentido con el tiempo.[1]​ A diferencia de la corriente alterna, en la corriente continua las cargas eléctricas circulan siempre en el mismo sentido.[2]​ Aunque comúnmente se identifica la corriente continua con una corriente constante, es continua toda corriente que mantenga siempre la misma polaridad, así disminuya su intensidad conforme se va consumiendo la carga (por ejemplo cuando se descarga una batería eléctrica).\nTambién se dice corriente continua cuando los electrones se mueven siempre en el mismo sentido, el flujo se denomina corriente continua y va (por convenio) del polo positivo al negativo.[3]​\n"}
{"url": "https://es.wikipedia.org/wiki/Cumana", "title": "Cumana", "summary": "Cumana Ltd fue una empresa con sede en Guildford, Inglaterra, dedicada a fabricar y comercializar productos para el mercado educativo por ordenador. Pese a ello, su producto más conocido son las series de unidades de disquete e interfaces que fabricó para varios ordenadores domésticos de 8 bits (Oric Atmos, Dragon 32...) pero sobre todo para el BBC Micro y otros ordenadores de Acorn Computers.\nEn 1995, tras haber expandido su gama de periféricos a tarjetas de interfaz SCSI y unidades de CD ROM, Cumana cesa sus actividades. El 5 de diciembre de 1995 la marca y sus diseños son adquiridos por Economatics Education Ltd., otra empresa británica con sede en Sheffield (hoy parte de HPC Compressed Air Systems), por entonces también dedicada al mercado educativo, que planea crear con ellos su propia línea de informática educativa. Las plantas ensambladoras de electrónica son adquiridas por Kenure Developments Ltd (KDL).\nEl proyecto de Economatics no acaba de cuajar y la marca y diseños son vendidos a Cannon Computing, que en 2009 continúa fabricando y distribuyendo hardware para el mercado educativo con la marca Cumana.\n"}
{"url": "https://es.wikipedia.org/wiki/Disquete", "title": "Disquete", "summary": "[\n]\nEl disquete o disco flexible (en inglés: diskette o floppy disk) fue un soporte de almacenamiento de datos de tipo magnético, formado por una fina lámina circular (disco) de material magnetizable y flexible (de ahí su denominación), encerrada en una cubierta de plástico, cuadrada o rectangular, que se utilizaba en la computadora, por ejemplo: para disco de arranque, para trasladar datos e información de un ordenador a otro, o simplemente para almacenar y resguardar archivos.\nLa disquetera, unidad de disquete o unidad de disco flexible (FDD, del inglés Floppy Disk Drive) es el dispositivo o unidad de almacenamiento que lee y escribe los disquetes, es decir, es la unidad lectora/grabadora de disquetes[5]​.\nEste tipo de soporte de almacenamiento es vulnerable a la suciedad y los campos magnéticos externos, por lo que deja de funcionar con el tiempo o por el desgaste.\n"}
{"url": "https://es.wikipedia.org/wiki/Error_de_software", "title": "Error de software", "summary": "Un error de software, error o simplemente fallo (también conocido por el inglés, bug) es un problema en un programa de computadora o sistema de software que desencadena un resultado indeseado. Los programas que ayudan a la detección y eliminación de errores de software son denominados depuradores (en inglés: debuggers).\nEntre las numerosas incidencias notables causadas por este tipo de error están la máquina de radioterapia Therac-25 en la década de 1980, la destrucción de la sonda espacial Mariner 1 en 1962,[1]​ del Ariane 5 501 en 1996,[2]​ y el Airbus A400M en 2015.[3]​ También fueron famosos los incidentes de la red de AT&T en 1990, o los accidentes del Boeing 737 MAX en 2018 y 2019 que llevaron a la suspensión de sus vuelos durante meses por fallos en el software MCAS.[4]​\nEn 2002 un estudio encargado por el Instituto Nacional de Estándares y Tecnología del Departamento de Comercio de Estados Unidos concluyó que los errores informáticos costaban a la economía estadounidense 59 500 millones de USD al año, un 0.6% del PIB.[5]​\n"}
{"url": "https://es.wikipedia.org/wiki/Espa%C3%B1a", "title": "España", "summary": " \n[\n]\n    \n    \n    \n40°25′01″N 3°42′12″O﻿ / ﻿40.416944444444, -3.7033333333333\n \nMonarquía parlamentaria\n \nFormación\n• Reconquista• Unión dinástica• Monarquía compuesta• Monarquía centralizada• Monarquía constitucional• Estado liberal• Primera República• Restauración• Segunda República• Dictadura franquista• Democracia actual\n711-149220 de enero de 146914 de marzo de 151629 de junio de 170719 de marzo de 18121833-18681873-187430 de junio de 18761931-19391939-197529 de diciembre de 1978\n \n&&&&&&&&&&050470.&&&&&0\n&&&&&&&&&&033090.&&&&&0\n0,911\nMuy Alto\nmedio\n \n↑ El Real Decreto 1560/1997 lo nombra indistintamente Marcha Granadera y Marcha Real Española.[1]​\n↑ Aunque la Real Academia Española da por superada la polémica acerca del glotónimo y da por válidos tanto «español» como «castellano»,[2]​ la Constitución usa de manera explícita «castellano» para diferenciarlo del resto de lenguas españolas.[3]​ Asimismo, son cooficiales el catalán en Cataluña[4]​ y las Islas Baleares;[5]​ el valenciano en la Comunidad Valenciana; el gallego en Galicia; el euskera en el País Vasco y la zona vascófona de Navarra; y el aranés, variedad de la lengua occitana hablada en el Valle de Arán, en Cataluña.[4]​ Además están reconocidos legalmente la lengua de signos española,[6]​ la lengua propia de las áreas pirenaica y prepirenaica (aragonés) y la lengua propia del área oriental (catalán) en Aragón[7]​ y el asturleonés en Asturias, donde se denomina bable,[8]​ y en Castilla y León, donde recibe el nombre de leonés.[9]​[10]​\n↑ Dato referido a la superficie española.[11]​\n↑ Dato referido a las aguas continentales. Las aguas jurisdiccionales o marinas son un millón de kilómetros cuadrados aproximadamente.[12]​\n↑ De los cuales: 63 km con Andorra, 646 km con Francia, 1,2 km con Gibraltar, 1224 km con Portugal, 18,5 con Marruecos (8 en Ceuta y 10,5 en Melilla). Asimismo, existe una frontera adicional de 75 metros entre Marruecos y el Peñón de Vélez de la Gomera.\n↑ Desde 1868 y hasta 2002, la peseta (₧, ESP).\n↑ WET (UTC±0) en Canarias.\n↑ WEST (UTC+1) en Canarias.\n↑ Para las ciudades autónomas de Ceuta y Melilla: EA. Para Canarias: IC. Estos códigos no son oficiales pero sí reservados.[17]​\n↑ Utilizada en aeronaves civiles.\n↑ Utilizada en aeronaves militares.\n↑ España es miembro del G20 como invitado permanente.\nEspaña, formalmente Reino de España,[nota 1]​ es un país soberano transcontinental, constituido en Estado social y democrático de derecho y cuya forma de gobierno es la monarquía parlamentaria. Es uno de los veintisiete Estados soberanos que forman la Unión Europea. Su territorio, con capital en Madrid,[30]​ está organizado en diecisiete comunidades autónomas, formadas a su vez por cincuenta provincias, y dos ciudades autónomas.\nEspaña se sitúa principalmente en el suroeste de Europa, si bien también tiene presencia en el norte de África. En Europa, ocupa la mayor parte de la península ibérica, conocida como España peninsular, y las islas Baleares (en el mar Mediterráneo). En África se hallan las ciudades de Ceuta y Melilla, las islas Canarias (en el océano Atlántico) y varias posesiones mediterráneas denominadas «plazas de soberanía». El municipio de Llivia, en los Pirineos, constituye un exclave rodeado totalmente por territorio francés. Completa el conjunto de territorios una serie de islas e islotes frente a las propias costas peninsulares. Tiene una extensión de 505 370 km2,[11]​ por lo que es el cuarto país más extenso del continente,[nota 2]​ y con una altitud media de 650 m sobre el nivel del mar, uno de los países más montañosos de Europa. Su población casi llega a los 48 millones y medio de habitantes, aunque la densidad de población es reducida si se compara con el contexto europeo.[13]​[31]​ Concretamente, a 1 de enero de 2024 llegó hasta los 48 592 909.[13]​ El territorio peninsular comparte fronteras terrestres con Francia y con Andorra al norte, con Portugal al oeste y con Gibraltar al sur. En sus territorios africanos, comparte fronteras terrestres y marítimas con Marruecos. Comparte con Francia la soberanía sobre la isla de los Faisanes en la desembocadura del río Bidasoa y cinco facerías pirenaicas.[32]​\nEl artículo 3.1 de su Constitución establece que «el castellano es la lengua española oficial del Estado. Todos los españoles tienen el deber de conocerla y el derecho a usarla».[3]​ En 2012, era la lengua materna del 82 % de los españoles.[33]​ Según el artículo 3.2, «las demás lenguas españolas serán también oficiales en las respectivas Comunidades Autónomas de acuerdo con sus Estatutos».[3]​ El idioma español o castellano, segunda lengua materna más hablada del mundo con 500 millones de hispanohablantes nativos, y hasta casi los 600 millones incluyendo hablantes con competencia limitada,[34]​ es uno de los más importantes legados del acervo cultural e histórico de España en el mundo. Perteneciente culturalmente a la Europa Latina y heredero de una vasta influencia grecorromana, España alberga también la cuarta colección más numerosa del mundo de sitios declarados Patrimonio de la Humanidad por la Unesco.[35]​\nEs un país desarrollado —goza de la cuarta esperanza de vida más elevada del mundo— y de altos ingresos, cuyo producto interior bruto coloca a la economía española en la decimocuarta posición mundial (2021).[36]​ Gracias a sus características únicas, España es una gran potencia turística y se erige como el segundo país más visitado del mundo —más de 83 millones de turistas en 2019— y el segundo país del mundo en ingresos económicos provenientes del turismo internacional.[37]​[38]​ Tiene un índice de desarrollo humano muy alto (0,904), según el informe de 2020 del Programa de la ONU para el Desarrollo.[39]​ España también tiene una notable proyección internacional a través de su pertenencia a múltiples organizaciones internacionales como Naciones Unidas, el Consejo de Europa, la Organización Mundial del Comercio, la Organización de Estados Iberoamericanos, la OCDE, la OTAN y la Unión Europea —incluidos dentro de esta al espacio Schengen y la eurozona—, además de ser miembro de facto del G20.\nLa primera presencia constatada de homínidos del género Homo se remonta a 1,2 millones de años antes del presente, como atestigua el descubrimiento de una mandíbula de un Homo aún sin clasificar en el yacimiento de Atapuerca.[40]​ En el siglo III a. C., se produjo la intervención romana en la Península, lo que conllevó a una posterior conquista de lo que, más tarde, se convertiría en Hispania. En el Medievo, la zona fue conquistada por distintos pueblos germánicos y por los musulmanes, llegando estos a tener presencia durante algo más de siete centurias. Es en el siglo XV, con la unión dinástica de las Coronas de Castilla y Aragón y la culminación de la Reconquista, junto con la posterior anexión navarra, cuando se puede hablar de la cimentación de «España», como era denominada en el exterior.[41]​[42]​[43]​ Ya en la Edad Moderna, los monarcas españoles gobernaron el primer imperio de ultramar global, que abarcaba territorios en los cinco continentes,[nota 3]​ dejando un vasto acervo cultural y lingüístico por el globo. A principios del xix, tras sucesivas guerras en Hispanoamérica, pierde la mayoría de sus territorios en América, acrecentándose esta situación con el desastre del 98. Durante este siglo, se produciría también una guerra contra el invasor francés, una serie de guerras civiles, una efímera república reemplazada nuevamente por una monarquía constitucional y el proceso de modernización del país. En el primer tercio del siglo XX, se proclamó una república constitucional. Un golpe de Estado militar fallido provocó el estallido de una guerra civil, cuyo fin dio paso a la dictadura de Francisco Franco, finalizada con la muerte de este en 1975, momento en que se inició una transición hacia la democracia. Su clímax fue la redacción, ratificación en referéndum y promulgación de la Constitución de 1978.[nota 4]​ Acrecentado significativamente durante el llamado «milagro económico español», el desarrollo económico y social del país ha continuado a lo largo del vigente periodo democrático.\n"}
{"url": "https://es.wikipedia.org/wiki/Europa", "title": "Europa", "summary": "[\n]\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nPaíses transcontinentales:\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nEuropa es un continente ubicado enteramente en el hemisferio norte y mayoritariamente en el hemisferio oriental. Las fronteras de Europa están situadas en la mitad occidental del hemisferio norte, limitada por el océano Ártico en el norte, hasta el mar Mediterráneo por el sur. Por el oeste, llega hasta el océano Atlántico. Por el este, limita con Asia, de la que la separan los montes Urales, el río Ural, el mar Caspio, la cordillera del Cáucaso, el mar Negro y los estrechos del Bósforo y de los Dardanelos.[2]​ Europa es uno de los continentes que conforman el supercontinente euroasiático, situado entre los paralelos 35°30′ y 70°30′ de latitud norte.[3]​\nEuropa es el segundo continente más pequeño en términos de superficie. Abarca 10 530 751 km² o el 2 % de la superficie del mundo y alrededor de 6,8 % del total de las tierras emergidas. Alberga un gran número de estados soberanos, algo más de 50, cuyo número exacto depende de la definición de la frontera de Europa, así como de la exclusión o inclusión de estados parcialmente reconocidos. De todos los países europeos, Rusia es el mayor en superficie (al mismo tiempo que es el estado soberano reconocido internacionalmente más extenso del mundo), mientras que la Ciudad del Vaticano es el más pequeño (al mismo tiempo que es el estado soberano e internacionalmente reconocido más pequeño del mundo). Europa es el cuarto continente más poblado después de Asia, África y América, con el 10,03 % de la población mundial.[4]​\nEuropa, en particular la Antigua Grecia, es la cuna de la cultura occidental. La caída del Imperio romano de Occidente, durante el período de la migración, marcó el fin de la Edad Antigua y el comienzo de una era conocida como la Edad Media.\nEl Renacimiento con sus consiguientes humanismo, arte y ciencia, además de la exploración llevaron al \"viejo continente\", y finalmente al resto del mundo, a la Edad Moderna. A partir de este período las naciones europeas desempeñan un papel preponderante en los asuntos mundiales, desde el siglo XVI en adelante especialmente, después del comienzo de la colonización. En los siglos XVII y XVIII, las naciones europeas controlaron la mayor parte de África, América, y gran parte de Asia, y posteriormente también Oceanía.\nLa Revolución Industrial, que comenzó en el Reino Unido en el siglo XVIII, dio lugar a un cambio radical en los ámbitos económico, tecnológico, cultural y social en Europa Occidental, que impactó en el resto del mundo.\nLa Primera Guerra Mundial y la Segunda Guerra Mundial condujeron a una disminución en el dominio de Europa en los asuntos mundiales cuando los Estados Unidos y la Unión Soviética tomaron la preeminencia.\nLa Guerra Fría entre las dos superpotencias dividió Europa a lo largo del Telón de Acero. La integración europea dio lugar a la formación del Consejo de Europa y la Unión Europea en Europa occidental, las cuales se han expandido hacia el este desde la disolución de la Unión Soviética en 1991.\nActualmente, naciones que ejercen poder hegemónico mundial como Estados Unidos son el resultado de la colonización europea.\n"}
{"url": "https://es.wikipedia.org/wiki/Francia", "title": "Francia", "summary": "République française  (francés)\n \n    \n    \n    \n48°51′24″N 2°21′08″E﻿ / ﻿48.856666666667, 2.3522222222222\n \n[\n]\n \nFormación\n• Unificación• Imp. Carolingio• Tratado Verdún• Guerra Cien Años• Villers-Cotterêts• Revolución• Primer Imperio• III República• IV República• V República\n481 - 51125 de diciembre de 800c. 10 de agosto de 8431337 - 145315391789 - 17991804 - 18154 de sept. de 187027 de octubre de 19464 de octubre de 1958\n \n0,910\nMuy Alto\nFAAAA\n \nFrancia (en francés: Franceⓘ), oficialmente la República Francesa (République françaiseⓘ),[6]​ es un país soberano transcontinental que se extiende por Europa Occidental y por regiones y territorios de ultramar en América y los océanos Atlántico, Pacífico e Índico. Es uno de los veintisiete Estados soberanos que integran la Unión Europea. Se constituye en república semipresidencialista unitaria con capital en París, la mayor ciudad del país y principal centro cultural y comercial; otras zonas urbanas importantes son Marsella, Lyon, Toulouse, Lille, Burdeos, Montpellier y Niza. La Francia metropolitana se extiende desde el río Rin hasta el océano Atlántico y desde el mar Mediterráneo hasta el canal de la Mancha y el mar del Norte; los territorios de ultramar incluyen la Guayana Francesa en América del Sur, San Pedro y Miquelón en el Atlántico Norte, las Antillas francesas y muchas islas en Oceanía y el océano Índico. Debido a sus diversos territorios costeros, Francia posee la mayor zona económica exclusiva del mundo. Sus dieciocho regiones integrales (cinco de las cuales son de ultramar) abarcan una superficie combinada de 643 801 km2 y más de 68 millones de personas.[7]​ Culturalmente pertenece a la Europa latina.  \nFrancia limita con Bélgica, Luxemburgo, Alemania, Suiza, Mónaco, Italia, Andorra y España en Europa, así como con los Países Bajos, Surinam y Brasil en América. \nHabitado desde el Paleolítico, el territorio de la Francia metropolitana fue colonizado por tribus celtas conocidas como galos durante la Edad de Hierro. Roma se anexionó la zona en el año 51 a. C., lo que dio lugar a una cultura galorromana diferenciada que sentó las bases de la lengua francesa. Los francos germánicos formaron el Reino de Francia, que se convirtió en el corazón del Imperio carolingio. El Tratado de Verdún de 843 dividió el imperio, y Francia Occidental se convirtió en el Reino de Francia en 987. En la Alta Edad Media, Francia era un reino feudal poderoso pero muy descentralizado. Felipe II reforzó con éxito el poder real y derrotó a sus rivales para duplicar el tamaño de las tierras de la corona; al final de su reinado, Francia se había convertido en el Estado más poderoso de Europa. Desde mediados del siglo XIV hasta mediados del siglo XV, Francia se vio inmersa en una serie de conflictos dinásticos con Inglaterra, conocidos colectivamente como la guerra de los Cien Años, y como resultado surgió una identidad francesa distinta. El Renacimiento francés fue testigo del florecimiento del arte y la cultura, del conflicto con la Casa de Habsburgo y del establecimiento de un imperio colonial global, que en el siglo XX se convertiría en el segundo más grande del mundo.[8]​ La segunda mitad del siglo XVI estuvo dominada por guerras civiles religiosas entre católicos y hugonotes que debilitaron gravemente al país. Francia volvió a ser la potencia dominante de Europa en el siglo XVII, bajo el mando de Luis XIV, tras la guerra de los Treinta Años.[9]​ Las políticas económicas inadecuadas, los impuestos no equitativos y las frecuentes guerras (especialmente la derrota en la guerra de los Siete Años y la costosa participación en la guerra de la Independencia de Estados Unidos), dejaron al reino en una situación económica precaria a finales del siglo XVIII. Esto precipitó la Revolución francesa de 1789, que derrocó el Antiguo Régimen y produjo la Declaración de los Derechos del Hombre y del Ciudadano, que expresa los ideales de la nación hasta el día de hoy.\nFrancia alcanzó su apogeo político y militar a principios del siglo XIX con Napoleón Bonaparte, subyugando gran parte de la Europa continental y estableciendo el Primer Imperio francés. La Revolución francesa y las guerras napoleónicas marcaron el curso de la historia europea y mundial. El colapso del imperio inició un periodo de relativa decadencia, en el que Francia soportó una tumultuosa sucesión de gobiernos hasta la fundación de la Tercera República francesa durante la guerra franco-prusiana de 1870. En las décadas siguientes se produjo un periodo de optimismo, florecimiento cultural y científico, así como de prosperidad económica, conocido como la Belle Époque. Francia fue uno de los principales participantes en la Primera Guerra Mundial, de la que salió victoriosa con un gran coste humano y económico. Estuvo entre las potencias aliadas de la Segunda Guerra Mundial, pero pronto fue ocupada por el Eje en 1940. Tras la liberación en 1944, se instauró la efímera Cuarta República, que posteriormente se disolvió en el transcurso de la guerra de Argelia. La actual Quinta República fue creada en 1958 por Charles de Gaulle. Argelia y la mayoría de las colonias francesas se independizaron en la década de 1960, y la mayoría de ellas mantienen estrechos vínculos económicos y militares con Francia.\nFrancia conserva su condición secular de centro mundial de arte, ciencia y filosofía. Alberga el quinto mayor número de sitios del Patrimonio Mundial de la UNESCO así como su sede y es el principal destino turístico del mundo, recibiendo más de 89 millones de visitantes extranjeros en 2018.[10]​ Francia es un país desarrollado con la séptima economía del mundo por PIB nominal y la novena por PPA; en términos de riqueza agregada de los hogares, ocupa el cuarto lugar en el mundo.[11]​ Francia obtiene buenos resultados en las clasificaciones internacionales de educación, sanidad, esperanza de vida y desarrollo humano.[12]​[13]​ Sigue siendo una gran potencia en los asuntos mundiales,[14]​ ya que es uno de los cinco miembros permanentes del Consejo de Seguridad de las Naciones Unidas y es un Estado oficial poseedor de armas nucleares. Francia es uno de los miembros fundadores y principales de la Unión Europea y la eurozona,[15]​ así como un miembro clave del G7, la Organización del Tratado del Atlántico Norte (OTAN), la Organización para la Cooperación y el Desarrollo Económico (OCDE) y la Francofonía.\n"}
{"url": "https://es.wikipedia.org/wiki/Gate_array", "title": "Gate array", "summary": "En electrónica, un gate array (matriz de puertas) o Uncommitted Logic Array (ULA, o \"matriz lógica no encargada\" o \"no comprometida\")[1]​ es una técnica para diseñar e implementar un circuito integrado de aplicación específica (Application-Specific Integrated Circuit o ASIC), utilizando un chip prefabricado con dispositivos activos tales como puertas AND, etc, que son posteriormente interconectados mediante una capa de máscara en orden de encargo.[2]​\n"}
{"url": "https://es.wikipedia.org/wiki/Gran_Breta%C3%B1a", "title": "Gran Bretaña", "summary": "53°50′00″N 2°25′00″O﻿ / ﻿53.833333333333, -2.4166666666667\nReino Unido\n \nGran Bretaña es una isla situada en el océano Atlántico Norte frente a la costa noroeste de la Europa continental. Es la mayor isla del archipiélago de las islas británicas.[2]​ Su superficie es de 209 331 km², siendo la mayor isla de Europa, la novena mayor del mundo y es —después de Java (Indonesia) y Honshu (Japón)— la tercera más poblada del planeta. El territorio de Gran Bretaña está formado por tres naciones: Inglaterra, Gales y Escocia, que forman parte del Reino Unido de Gran Bretaña e Irlanda del Norte.\nLa isla debe su nombre a la provincia del Imperio Romano llamada Britannia, habitada por el pueblo celta de los britanos. La crisis que supuso la invasión anglosajona de Gran Bretaña hizo que muchos britano-romanos huyeran y se establecieran en regiones cercanas, como la actual Bretaña francesa.\n"}
{"url": "https://es.wikipedia.org/wiki/Impresora", "title": "Impresora", "summary": "Una impresora es un dispositivo periférico de salida del ordenador que permite producir una gama permanente de textos o gráficos de documentos almacenados en un formato electrónico, imprimiéndolos en medios físicos, normalmente en papel, utilizando cartuchos de tinta o tecnología láser (con tóner).\nMuchas de las impresoras son usadas como periféricos de salida, y están permanentemente unidas al ordenador por un cable. Otras impresoras, llamadas impresoras de red, tienen una interfaz de red interno (típicamente inalámbricas o por cable ethernet), y que puede servir como un dispositivo para imprimir en papel algún documento para cualquier usuario de la red.\nAdemás, muchas impresoras modernas permiten la conexión directa de aparatos de multimedia electrónicos como las tarjetas CompactFlash, Secure Digital o Memory Stick, memorias USB, o aparatos de captura de imagen como cámaras digitales y escáneres. También existen aparatos multifunción que constan de impresora, escáner o máquinas de fax en un solo aparato. Una impresora combinada con un escáner puede funcionar básicamente como una fotocopiadora.\nSon diseñadas para realizar trabajos repetitivos de poco volumen, que no requieran virtualmente un tiempo de configuración para conseguir una copia de un determinado documento. Sin embargo, las impresoras son generalmente dispositivos lentos (10 páginas por minuto es considerado rápido), y el gasto por página es relativamente alto.\nPara trabajos de mayor volumen existen las imprentas, que son máquinas que realizan la misma función que las impresoras pero están diseñadas y optimizadas para realizar trabajos de impresión de gran volumen, como sería la impresión de periódicos. Las imprentas son capaces de imprimir cientos de páginas por minuto o más.\n"}
{"url": "https://es.wikipedia.org/wiki/Joystick", "title": "Palanca de mando", "summary": "Una palanca de mando o joystick (del inglés joy, alegría, y stick, palo)[1]​ es un periférico de entrada que consiste en una palanca que gira sobre una base e informa su ángulo o dirección al dispositivo que está controlando. Es el dispositivo de control principal en la cabina de vuelo de muchos aviones civiles y militares, ya sea como una palanca de control central o una palanca de control lateral. Algunas palancas poseen interruptores suplementarios para controlar diversos aspectos del vuelo de la aeronave.\nLas palancas de mando también se usan para controlar videojuegos y generalmente tienen uno o más botones cuyo estado también puede leer el computador. Una variación popular de la palanca de mando que se usa en las consolas de videojuegos modernas es la palanca analógica. Las palancas de mando también se utilizan para controlar máquinas como grúas, camiones, vehículos subacuáticos no tripulados, sillas de ruedas, cámaras de vigilancia y cortacéspedes de giro cero. Las palancas de mando miniatura accionados por el dedo se han adoptado como dispositivos de entrada para equipos electrónicos más pequeños, como teléfonos móviles.\n"}
{"url": "https://es.wikipedia.org/wiki/Kilobyte", "title": "Kilobyte", "summary": "Un kilobyte es una unidad de almacenamiento de información cuyo símbolo es el kB (con la 'k' en minúsculas) y equivale a 103 (mil) bytes. Aunque el prefijo griego kilo- (χίλιοι) significa «mil», el término kilobyte y el símbolo «kB» se han utilizado históricamente para hacer referencia tanto a 1024 (210) bytes como a 1000 (103) bytes, dependiendo del contexto, en los campos de la informática y de la tecnología de la información.[1]​[2]​[3]​\nPara solucionar esta confusión, la Comisión Electrotécnica Internacional publicó en 1998 un apéndice al estándar IEC 60027-2 donde se instauraban los prefijos binarios, naciendo la unidad kibibyte para designar 210 bytes y considerándose el uso de la palabra kilobyte no válido a dichos efectos.\n"}
{"url": "https://es.wikipedia.org/wiki/Lenguaje_ensamblador", "title": "Lenguaje ensamblador", "summary": "Motorola MC6800 Assembler listing\nEl lenguaje ensamblador o assembler (en inglés: assembler language y la abreviación asm) es un lenguaje de programación que se usa en los microprocesadores. Implementa una representación simbólica de los códigos de máquina binarios y otras constantes necesarias para programar una arquitectura de procesador y constituye la representación más directa del código máquina específico para cada arquitectura legible por un programador. Cada arquitectura de procesador tiene su propio lenguaje ensamblador que usualmente es definida por el fabricante de hardware, y está basada en los mnemónicos que simbolizan los pasos de procesamiento (las instrucciones), los registros del procesador, las posiciones de memoria y otras características del lenguaje. Un lenguaje ensamblador es por lo tanto específico de cierta arquitectura de computador física (o virtual). Esto está en contraste con la mayoría de los lenguajes de programación de alto nivel, que idealmente son portables.\nUn programa utilitario llamado ensamblador es usado para traducir sentencias del lenguaje ensamblador al código de máquina del computador objetivo. El ensamblador realiza una traducción más o menos isomorfa (un mapeo de uno a uno) desde las sentencias mnemónicas a las instrucciones y datos de máquina. Esto está en contraste con los lenguajes de alto nivel, en los cuales una sola declaración generalmente da lugar a muchas instrucciones de máquina.\nMuchos sofisticados ensambladores ofrecen mecanismos adicionales para facilitar el desarrollo del programa, controlar el proceso de ensamblaje, y la ayuda de depuración. Particularmente, la mayoría de los ensambladores modernos incluyen una facilidad de macro (descrita más abajo), y se llaman macro ensambladores.\nFue usado principalmente en los inicios del desarrollo de software, cuando aún no se contaba con potentes lenguajes de alto nivel y los recursos eran limitados. Actualmente se utiliza con frecuencia en ambientes académicos y de investigación, especialmente cuando se requiere la manipulación directa de hardware, alto rendimiento, o un uso de recursos controlado y reducido. También es utilizado en el desarrollo de controladores de dispositivo (en inglés, device drivers) y en el desarrollo de sistemas operativos, debido a la necesidad del acceso directo a las instrucciones de la máquina. Muchos dispositivos programables (como los microcontroladores) aún cuentan con el ensamblador como la única manera de ser manipulados.\n"}
{"url": "https://es.wikipedia.org/wiki/Libra_esterlina", "title": "Libra esterlina", "summary": "en inglés\nReino Unido\n \nIslas Malvinas\n \n \n \nTerritorio Británico del Océano Índico\n \nIsla de Man\n \n \nJersey\n \n[\n]\n16 de mayo de 2024\nLa libra esterlina (pound sterling en inglés, símbolo monetario: £) es la moneda oficial del Reino Unido así como de las Dependencias de la Corona y de algunos territorios británicos de ultramar. En sus demás territorios coloniales se usan diferentes divisas pero fijadas a la esterlina: La libra gibraltareña, libra malvinense y libra de Santa Elena. En Egipto por ejemplo se usa la Libra egipcia a pesar de no formar parte del Reino Unido. Su símbolo monetario es £ y proviene del latín libra, que se refería a la unidad de masa. Una libra se divide en cien peniques.\nEl nombre oficial completo, libra esterlina (en plural, libras esterlinas), es usado sobre todo en contextos formales y también cuando es necesario distinguir la moneda que se usa en el Reino Unido de las que se utilizan en otros países y que tienen el mismo nombre. El nombre de la divisa —pero no los nombres de sus unidades— a veces es abreviado solamente a \"esterlina\", particularmente en los mercados financieros de venta al por mayor; por ejemplo \"pago aceptado en esterlinas\", pero no \"eso cuesta cinco esterlinas\". Las abreviaturas \"ster.\" o \"stg.\" son usadas ocasionalmente. El término libra británica es usado comúnmente en situaciones menos formales, aunque no es un nombre oficial de la divisa. La esterlina es una antigua moneda inglesa de plata esterlina, una aleación de un 92,5 % de plata y un 7,5 % de cobre y/u otros metales, y con una masa de 1,555 gramos o 1/240 de una libra troy.\nLa libra fue originalmente el valor del peso de una Libra Torre de plata esterlina (de ahí que se llame \"libra esterlina\"). El símbolo de la divisa es el símbolo de la libra, originalmente ₤ con dos barras cruzadas, más tarde fue más común £ con una sola barra. El símbolo se deriva de la letra \"L\", de la abreviación LSD —librae, solidi, denarii— usada para las libras, chelines y peniques del sistema monetario duodecimal original. Libra era la unidad romana básica de peso, que se derivaba del latín de \"balanza\". El código ISO 4217 es GBP (en inglés Great Britain pound, Libra de Gran Bretaña). Ocasionalmente es vista la abreviación UKP, pero esta es incorrecta. Las Dependencias de la Corona usan sus propios códigos (no ISO) cuando desean reflejar su distinción. Los recursos generalmente son intercambiados por peniques, así que los comerciantes pueden referirse al penique esterlino, GBX (a veces BGp), cuando enlistan sus precios.\nDespués de la adopción del euro por varios países, la libra se convirtió en la divisa más antigua del mundo aún en uso, y actualmente tiene la tercera porción más grande de monedas de reserva a nivel mundial, después del dólar estadounidense y el euro. La libra esterlina es la cuarta divisa más intercambiada en el mercado internacional de intercambio detrás del dólar, el euro y el yen japonés.\n"}
{"url": "https://es.wikipedia.org/wiki/Logotipo", "title": "Logotipo", "summary": "Busca fuentes: «Logotipo» – noticias · libros · académico · imágenes\nUn logotipo —especialmente también llamado logo— es un signo gráfico que identifica a una empresa, un producto comercial, un proyecto, o en general, a cualquier entidad pública o privada.[1]​\nAntes \nHistóricamente, los artesanos del barro, del cristal, de la piedra, los fabricantes de espadas y artilugios de hierro fino, así como los impresores, utilizaban marcas para señalar su autoría.\n"}
{"url": "https://es.wikipedia.org/wiki/M%C3%B3dem", "title": "Módem", "summary": "Este aviso fue puesto el 5 de junio de 2023.\nAM\nFM\nPM\nQAM\nDSB\nSSB\nASK\nAPSK\nCPM\nFSK\nGMFK\nGMSK\nMFSK\nMSK\nOOK\nPPM\nPSK\nSC-FDMA\nTCM\nCSS\nDSSS\nFHSS\nTHSS\nDetección y corrección de errores\nDemodulación\nCódigos en línea\nMódem\nPAM\nPCM\nPWM\nΔΣM\nOFDM\nvte\nUn módem (del inglés modem, acrónimo de modulator demodulator; pl. módems)[1]​ es un dispositivo que convierte las señales digitales en analógicas (modulación) y viceversa (desmodulación),[2]​ y permite así la comunicación entre computadoras a través de la línea telefónica o del cablemódem. Sirve para enviar la señal moduladora mediante otra señal llamada portadora.\nSe han usado módems desde la década de 1960, debido a que la transmisión directa de las señales electrónicas inteligibles, a largas distancias, no es eficiente; por ejemplo, para transmitir señales de audio por el aire se requerirían antenas de gran tamaño (del orden de cientos de metros) para su correcta recepción. Es habitual encontrar en muchos módems de red conmutada la facilidad de respuesta y marcación automática, que les permiten conectarse cuando reciben una llamada de la RTPC (Red Telefónica Pública Conmutada) y proceder a la marcación de cualquier número previamente grabado por el usuario. Gracias a estas funciones se pueden realizar automáticamente todas las operaciones de establecimiento de la comunicación.\n"}
{"url": "https://es.wikipedia.org/wiki/MHz", "title": "Megahercio", "summary": "Un megahercio (MHz) es una unidad de medida de la frecuencia, equivale a 106 hercios (1 millón). Se utiliza muy frecuentemente como unidad de medida de la frecuencia de trabajo de un dispositivo de algo, o bien como medida de ondas.\n"}
{"url": "https://es.wikipedia.org/wiki/MOS_Technology_6502", "title": "MOS 6502", "summary": "El MOS 6502 o MOS Technology 6502 es un microprocesador de 8 bits diseñado por MOS Technology en 1975. Cuando fue introducido fue, con bastante diferencia, la CPU más barata con características completas de mercado, con alrededor de un sexto del precio o menos que las CPU con las que competía de compañías más grandes como Motorola e Intel. Era sin embargo más rápido que la mayoría de ellos, y, junto con el Zilog Z80, fueron la chispa de una serie de proyectos de computadores que finalmente darían lugar a la revolución del ordenador personal de finales de los 1970 y principios de los años 1980. Además de MOS Technology, el diseño del 6502 tuvo originalmente como segunda fuente a Rockwell y Synertek y fue licenciado más adelante a varias compañías más. Todavía se hace para sistemas integrados (embedded systems).\nEl 6502 consiste en realidad en una familia de CPU que comparten el chip, pero están encapsuladas con diferentes números de patillas, abaratando costes y sacrificando algunas prestaciones. Éstos a su vez se dividen en dos grupos: los 650x, con reloj interno, y los 651x, que necesitan reloj de dos fases (como el MC6800).\n"}
{"url": "https://es.wikipedia.org/wiki/Memoria_de_acceso_aleatorio", "title": "Memoria de acceso aleatorio", "summary": "Busca fuentes: «Memoria de acceso aleatorio» – noticias · libros · académico · imágenes\nLa memoria de acceso aleatorio (Random Access Memory, RAM) es una memoria de almacenaje a corto plazo. El sistema operativo de ordenadores u otros dispositivos utiliza la memoria RAM para guardar de forma temporal todos los programas y sus procesos de ejecución.[1]​ En la RAM se cargan todas las instrucciones que ejecuta la unidad central de procesamiento (CPU) y otras unidades del ordenador, además de contener los datos que manipulan los distintos programas.\nSe llama «de acceso aleatorio» porque se puede leer o escribir en una posición de memoria con igual tiempo de espera para cualquier posición, no requiriendo un orden para acceder (acceso secuencial) a la información de la manera más rápida posible.\nDurante el encendido de la computadora, la rutina POST verifica que los módulos de RAM estén bien conectados. En el caso de que no existan o no se los detecte, la mayoría de las placas base emiten sonidos que indican la ausencia de la memoria principal. Terminado ese proceso, la memoria BIOS puede realizar un test básico de la RAM indicando fallos mayores en ella.\n"}
{"url": "https://es.wikipedia.org/wiki/Microsoft", "title": "Microsoft", "summary": "(Chairman y director ejecutivo)\n(Vice chairman y presidente)\n(Asesor técnico)\n(2023)\n(7,8%)\n(6,6%)\n(3,6%)\nGitHub\nLinkedIn\nMetaswitch\nNuance Communications\nRiskIQ\nSkype Technologies\nXamarin\nXandr\n47°38′24″N 122°07′41″O﻿ / ﻿47.64, -122.12805555556\nTraf-O-Data\nMicrosoft\n[\n]\nMicrosoft Corporation es una  corporación tecnológica multinacional estadounidense con sede en Redmond, Washington. Los productos de software más conocidos de Microsoft son la línea de sistemas operativos Microsoft Windows, el conjunto de aplicaciones de productividad Microsoft 365, el motor de búsqueda Microsoft Bing y el navegador web Microsoft Edge. Sus productos de hardware emblemáticos son las consolas de videojuegos Xbox y la línea de computadoras personales con pantalla táctil Microsoft Surface. Microsoft ocupó el puesto 14 en la clasificación Fortune 500 de 2022 de las corporaciones más grandes de Estados Unidos por ingresos totales; era el mayor fabricante de software del mundo por ingresos en 2022. \nSe considera una de las cinco grandes empresas estadounidenses de tecnología de la información junto con Alphabet (empresa matriz de Google), Amazon, Apple y Meta Platforms (empresa matriz de Facebook).\nPaul Allen y Bill Gates la fundaron el 4 de abril de 1975 para desarrollar y comercializar intérpretes de BASIC para el Altair 8800, un microordenador diseñado en 1974 y basado en el procesador Intel 8080. A mediados de la década de 1980, dominó el mercado de los sistemas operativos para computadoras personales con MS-DOS, que continuó con Microsoft Windows. La salida a bolsa de 1986 y la posterior subida del precio de las acciones crearon tres multimillonarios y unos 12.000 millonarios entre los empleados de Microsoft. Desde la década de 1990, se ha diversificado cada vez más fuera del mercado de los sistemas operativos. Ha realizado una serie de adquisiciones corporativas, siendo la mayor la compra de LinkedIn por 26.200 millones de dólares en diciembre de 2016,[2]​ seguida de la compra de Skype Technologies por 8500 millones de dólares en mayo de 2011.[3]​\nMicrosoft es un actor dominante en el mercado de los sistemas operativos para ordenadores compatibles con IBM y en el de las suites ofimáticas. Sin embargo, ha perdido la mayor parte del mercado de sistemas operativos ante la llegada de Android en 2008.[4]​ La empresa también produce una amplia gama de otros productos de software para ordenadores de sobremesa y servidores, como la búsqueda en Internet (con Bing), el mercado de servicios digitales (a través de MSN), la realidad mixta (HoloLens), la computación en la nube (Azure) y el desarrollo de software (Visual Studio).[5]​\nSteve Ballmer sustituyó a Bill Gates como consejero delegado el 13 de enero del año 2000 y desarrolló una estrategia centrada en los dispositivos y los servicios. Comenzó su gestión con la adquisición de Peach Networks anunciada el 29 de febrero del 2000 para expandir los servicios de cable digital de Microsoft TV.[6]​[7]​ También entró por primera vez en el mercado de la producción de computadoras personales en junio de 2012 con el lanzamiento de la línea de tabletas Microsoft Surface; y la posterior configuración de Microsoft Mobile mediante la adquisición de la división de dispositivos y servicios de Nokia. Desde que Satya Nadella se convirtió en consejero delegado en 2014, la compañía ha reducido su énfasis en el hardware y se ha centrado en la computación en la nube y la inteligencia artificial, un movimiento que ha impulsado las acciones de la compañía a su valor más alto desde diciembre de 1999.[8]​[9]​\nEn 2018, Microsoft superó a Apple Inc. como la empresa que cotiza en bolsa más valiosa del mundo después de haber sido destronada por el gigante tecnológico en 2010.[10]​ En abril de 2019, Microsoft se convirtió en la tercera empresa pública estadounidense valorada en más de un billón de dólares después de que Apple y Amazon alcanzaran el billón de dólares de capitalización bursátil en 2018.[11]​\nEn la actualidad, Microsoft tiene presencia en los siguientes países: Irlanda, Alemania, Bélgica, Canadá, Dinamarca, Estados Unidos, Finlandia, Francia, Italia, México, Austria, Japón, Países Bajos, Reino Unido, Suecia, España, y Polonia; ofreciendo una gran variedad de productos y servicios. Microsoft también está presente en otros países, donde realiza funciones de soporte, como: Australia, Argentina, Brasil, Nueva Zelanda y República de la India.[12]​\n"}
{"url": "https://es.wikipedia.org/wiki/Modelo_de_color_RGB", "title": "RGB", "summary": "RGB (sigla del inglés red, green, blue; en español, ‘rojo, verde, azul’) o RVA (sigla preferida por la ASALE y la RAE[cita requerida]) es la composición del color en términos de la intensidad de los colores primarios de la luz.\n"}
{"url": "https://es.wikipedia.org/wiki/Ordenador_dom%C3%A9stico", "title": "Computadora doméstica", "summary": "Se denomina computadora doméstica, computador doméstico u ordenador doméstico a la segunda generación de computadoras, que entraron en el mercado con el nacimiento del Altair 8800 y se extiende hasta principios de la década de 1990. Esto engloba a todos los ordenadores de 8 bits (principalmente con unidad central de procesamiento —CPU por sus siglas en inglés— Zilog Z80, MOS Technology 6502 o Motorola 6800) y a la primera ola de equipos con CPU de 16 bits (principalmente Motorola 68000 e Intel 8086 y 8088). El término proviene de que llevaron la computadora de la industria al hogar. Aunque se suele excluir de ese grupo a los compatibles IBM PC, lo cierto es que hasta el triunfo definitivo y la adopción del término \"computadora personal\", tuvieron que competir con las líneas patrocinadas por Atari, Commodore y Apple Computer, por lo que algunos optan por incluir en la categoría de doméstico a los modelos más significativos de 16 bits, o al menos a los compatibles PC orientados al mismo mercado como la gama Tandy.\nEn cierta manera, guardando cierta similitud con las nuevas formas animales aparecidas en el periodo cámbrico, una gran cantidad de máquinas de todas las clases, incluyendo rarezas como el ordenador Jupiter Ace en lenguaje Forth aparecían en el mercado y desaparecían de nuevo. Algunos tipos de ordenadores permanecieron durante más tiempo, otros evolucionaron tratando de mantener la compatibilidad (existen, por ejemplo, tarjetas de emulación Apple II para los primeros Mac). Sin embargo, al final de la década la mayoría fueron eliminados por la computadora personal compatible con IBM y las generaciones más nuevas de videoconsolas porque ambas utilizaban sus propios formatos incompatibles. La revolución IBM fue provocada en 1981 por la salida del ordenador personal de IBM 5150, el IBM PC.[1]​\nPese a ello, siguen existiendo grupos de usuarios que no renuncian a usar y mejorar sus viejos equipos dotándoles de las posibilidades modernas como disco duro o conexión a Internet. Aunque todas son muy activas (teniendo en cuenta la cada vez menor base de usuarios), destacan por mérito propio la de usuarios de MSX en los 8 bits y la de Commodore Amiga en los 16 bits (calificados por un redactor de MacByte como las aldeas de irreductibles galos que resisten el asedio de las legiones Wintel). Asimismo han dado nacimiento a una serie de aficiones que se suelen englobar bajo el vocablo retroinformática.\nUna de las más conocidas es la emulación, normalmente por software, pero también por hardware, de estas viejas computadoras y consolas en todo tipo de dispositivos: modernas computadoras personales, consolas, PDA, teléfonos móviles, reproductores de DVD decodificadores de TDT, cámaras fotográficas digitales, etc.\nMuchos de estos ordenadores eran superficialmente similares y tenían frecuentemente un teclado de «fabricación barata» integrado en la carcasa que albergaba debajo la placa base con la CPU, una fuente de alimentación externa y como unidad de visualización más común un televisor. Muchas utilizaban casetes de audio compactos como mecanismo (notoriamente poco fiable) de almacenamiento de datos ya que las unidades de disco flexible eran muy caras en aquella época. Su bajo precio era común a la mayoría de las computadoras.\nAparte de casos como CP/M y OS-9, la mayoría tienen en ROM las rutinas básicas (que podrían considerarse su sistema operativo) junto con el lenguaje BASIC. Es lo que hoy suele conocerse como el firmware de los periféricos (una unidad de disco o lectora de DVD puede llevar integrada en su circuitería microcontroladores precisamente basados en las CPUs de estos equipos).\n"}
{"url": "https://es.wikipedia.org/wiki/Oric_Atmos", "title": "Oric Atmos", "summary": "El Oric Atmos fue un ordenador doméstico fabricado por Oric Products International Ltd para competir con el Sinclair ZX Spectrum con un procesador 6502. Es el sucesor del Oric 1.\n"}
{"url": "https://es.wikipedia.org/wiki/P%C3%ADxel", "title": "Píxel", "summary": "Un píxel o pixel,[1]​ plural píxeles o pixeles ( neologismo del inglés pixel, derivado del acrónimo del inglés picture element, 'elemento de la imagen') es, en informática, la unidad mínima que forma una imagen digital. Esta imagen puede ser mostrada e interpretada por el hardware de un ordenador, por ejemplo, mediante un monitor o una impresora. \nUn píxel usualmente se visualiza como un punto o un cuadrado, pero conceptualmente no tiene una forma determinada. Se puede decir que se trata de una muestra abstracta o una unidad de medida de resolución de pantalla. El píxel no tiene una medida concreta, en cada caso se establece por el fabricante del aparato que los usa, aunque acostumbra a ser del orden de micrómetros.\nLos píxeles son elementos independientes, pero el hecho que se perciban visualmente como un conjunto es debido a la limitación de nuestra visión, que hace que se obtenga una sensación de continuidad. A partir del concepto de píxel, se han derivado otros términos como por ejemplo vóxel (elemento de volumen), tèxel (elemento de textura) y surfel (elemento de superficie), utilizados por otros procesamientos de la imagen.[2]​[3]​[4]​[5]​ \nSe considera que Russell Kirsch fue su inventor cuando trabajaba en el Instituto Nacional de Estándares y Tecnología, y fue la base por el desarrollo de las imágenes digitales. La primera imagen escaneada es una foto de su hijo, del año 1957.[6]​ \n"}
{"url": "https://es.wikipedia.org/wiki/PAL", "title": "PAL", "summary": "     PAL o PAL/SECAM\n     NTSC\n     SECAM\n     Sin Información\nPAL es la sigla de Phase Alternating Line (en español ‘línea de fase alternada’). Es el nombre con el que se designa al sistema de codificación utilizado en la transmisión de señales de televisión analógica en color en la mayor parte del mundo. Se utiliza en la mayoría de los países africanos, asiáticos y europeos, además de Australia y algunos países América del Sur, como Argentina, Brasil, Paraguay y Uruguay.\nOtros sistemas en uso son el NTSC, utilizado en casi toda América, Japón y el Sureste Asiático, y el SECAM, utilizado en Francia, en algunos países del Este de Europa y África. El sistema PAL deriva del NTSC, incorporando algunas mejoras técnicas.\n"}
{"url": "https://es.wikipedia.org/wiki/Pantalla", "title": "Pantalla", "summary": "Pantalla puede referirse a:\n"}
{"url": "https://es.wikipedia.org/wiki/Pin_(electr%C3%B3nica)", "title": "Pin (electrónica)", "summary": "En electrónica, se denomina pin, palabra inglesa que significa «clavija»,[1]​ a la terminal o patilla de cada uno de los contactos metálicos de un conector o de un componente fabricado de un material conductor de la electricidad. Estos se utilizan para conectar componentes sin necesidad de soldar algo, de esta manera se logra transferir electricidad e información.\nPara determinar la misión de cada uno de los pines de un dispositivo, se deberán consultar sus respectivas hojas de datos o datasheet.\n"}
{"url": "https://es.wikipedia.org/wiki/Placa_madre", "title": "Placa base", "summary": "Busca fuentes: «Placa base» – noticias · libros · académico · imágenes\nAsRockASUSBiostarGigabyte TechnologyIntel CorporationLenovoMSI\nXTAT, Baby-AT, ATX, microATX, FlexATX, MiniATXITX, Mini-ITX, Nano-ITX, Pico-ITXBTX, Micro BTX, Pico BTX, Regular BTXDTX, Mini DTX, Full DTX\nLa placa base, también conocida como tarjeta madre, placa madre o placa principal (motherboard o mainboard en inglés), es una tarjeta de circuito impreso a la que se conectan los componentes que constituyen la computadora. En muchos lugares de habla hispana se usa la palabra inglesa con el artículo en femenino.[1]​[2]​\nEs una parte fundamental para montar cualquier computadora personal de  escritorio o portátil o algún dispositivo. Tiene instalados una serie de circuitos integrados, entre los que se encuentra el circuito integrado auxiliar (chipset), que sirve como centro de conexión entre el microprocesador (CPU), la memoria de acceso aleatorio (RAM), las ranuras de expansión y otros dispositivos.\nEstá instalada dentro de una carcasa o gabinete que por lo general está hecha de chapa y tiene un panel para conectar dispositivos externos y muchos conectores internos y zócalos para instalar componentes internos.\nLa placa base, además incluye un firmware llamado BIOS, que le permite realizar las funcionalidades básicas, como pruebas de los dispositivos, vídeo y manejo del teclado, reconocimiento de dispositivos y carga del sistema operativo.\n"}
{"url": "https://es.wikipedia.org/wiki/Puerto_paralelo", "title": "Puerto paralelo", "summary": "Un puerto paralelo es una interfaz entre un computador y un periférico, cuya principal característica es que los bits de datos viajan juntos, enviando un paquete de byte a la vez. Es decir, se implementa un cable o una vía física para cada bit de datos formando un bus. Mediante el puerto paralelo podemos controlar también periféricos como focos, motores entre otros dispositivos.\nEl cable paralelo es el conector físico entre el puerto paralelo y el dispositivo periférico. En un puerto paralelo habrá una serie de bits de control en vías aparte que irán en ambos sentidos por caminos distintos.\nEn contraposición al puerto paralelo está el puerto serie, que envía los datos bit a bit por el mismo hilo.\n"}
{"url": "https://es.wikipedia.org/wiki/QWERTY", "title": "Teclado QWERTY", "summary": "Busca fuentes: «Teclado QWERTY» – noticias · libros · académico · imágenes\nEl teclado QWERTY es la distribución de teclado más común. Fue diseñado y patentado por Christopher Sholes en 1868 y vendido a Remington en 1873. Su nombre proviene de las primeras seis letras de su fila superior de teclas.\nLa distribución QWERTY se diseñó con el propósito de lograr que las personas escribieran más rápido distribuyendo las letras de tal forma que se pudieran usar las dos manos para escribir la mayoría de las palabras. Otro de los objetivos principales era separar las letras más usadas de la zona central del teclado, para evitar que se atascaran las máquinas de escribir de primera generación, y aunque hoy en día no es necesario, se sigue utilizando mayoritariamente esta distribución. Además de máquinas de escribir y ordenadores, el QWERTY actualmente se utiliza en teléfonos móviles, televisores inteligentes, cajeros automáticos y, en general, cualquier interfaz de texto. \nEn este teclado, según la técnica de mecanografía más difundida, en posición de reposo, cuatro dedos de cada mano se colocan sobre la fila central de teclas. Para poder encontrar esta posición sin tener que mirar el teclado, las teclas correspondientes a los dedos índice de cada mano (F y J) suelen tener algún rasgo distintivo al tacto.\nEsta disposición de teclado se llevó a las computadoras para desplazar más fácilmente a las máquinas de escribir en las oficinas. De esta forma, las personas encargadas de 'mecanografiar' documentos seguían sabiendo manejar los nuevos teclados informáticos.\nEl teclado QWERTY tiene versiones para diferentes lenguas. Hay países, como Alemania, que intercambian la tecla «Y» por la tecla «Z», con lo que se convierte en teclado QWERTZ. En Francia y Bélgica hay más cambios y las primeras seis teclas alfabéticas tienen la secuencia AZERTY. En la disposición española e hispanoamericana se incluye la letra «Ñ» justo a la derecha de la «L», en la portuguesa y en la española (para la lengua catalana) se incluye la «Ç» a la izquierda del enter. En Japón, usa caracteres kana, impresos a un lado de los caracteres latinos y números, pero algunos caracteres especiales fueron movidos respecto al teclado inglés.\n"}
{"url": "https://es.wikipedia.org/wiki/ROM", "title": "Memoria de solo lectura", "summary": "Busca fuentes: «Memoria de solo lectura» – noticias · libros · académico · imágenes\nLa memoria de solo lectura, conocida también como ROM (acrónimo en inglés de Read Only Memory), es un medio de almacenamiento utilizado en ordenadores y dispositivos electrónicos, que permite solo la lectura de la información y no su escritura,[1]​ independientemente de la presencia o no de una fuente de energía. \nLos datos almacenados en la ROM no se pueden modificar, o al menos no de manera rápida o fácil. Se utiliza principalmente para contener el firmware[2]​ (programa que está estrechamente ligado a hardware específico, y es poco probable que requiera actualizaciones frecuentes) u otro contenido vital para el funcionamiento del dispositivo, como los programas que ponen en marcha el ordenador y realizan los diagnósticos.\nEn su sentido más estricto, se refiere solo a la ROM de máscara -en inglés, mask ROM o MROM- (el más antiguo tipo de ROM de estado sólido), que se fabrica con los datos almacenados de forma permanente, y por lo tanto, su contenido no puede ser modificado de ninguna forma. Sin embargo, las ROM más modernas, como EPROM y Flash EEPROM, efectivamente se pueden borrar y volver a programar varias veces, aun siendo descritos como \"memoria de solo lectura\" (ROM). La razón de que se las continúe llamando así es que el proceso de reprogramación en general es poco frecuente, relativamente lento y, a menudo, no se permite la escritura en lugares aleatorios de la memoria. A pesar de la simplicidad de la ROM, los dispositivos reprogramables son más flexibles y económicos, por lo cual las antiguas ROM con máscara no se suelen encontrar en hardware producido a partir de 2007.\n"}
{"url": "https://es.wikipedia.org/wiki/Rockwell_Semiconductor", "title": "Conexant", "summary": " \nConexant Systems Inc. (NASDAQ: CNXT) fue una empresa estadounidense de semiconductores, que anteriormente era conocida como Rockwell Semiconductor al ser la división de semiconductores de Rockwell International.\n"}
{"url": "https://es.wikipedia.org/wiki/Sinclair_ZX_Spectrum", "title": "Sinclair ZX Spectrum", "summary": "El Sinclair ZX Spectrum es un ordenador de 8 bits basado en el microprocesador Zilog Z80A, fabricado por la compañía británica Sinclair Research y lanzado al mercado el 23 de abril de 1982.\nEn Europa, el Sinclair ZX Spectrum fue uno de los microordenadores domésticos más populares de los años 1980. Aún hoy perduran miles de aficionados del Spectrum que siguen jugando a sus juegos (con emuladores que cargan sus ficheros volcados de cintas). Además hay un mercado de coleccionismo tanto de cintas de juegos originales como de los propios Spectrum.\n"}
{"url": "https://es.wikipedia.org/wiki/Synertek", "title": "Synertek", "summary": "[\n]\nSynertek, Inc. fue un fabricante estadounidense de semiconductores fundado en 1973. El grupo fundador consistía en Bob Schreiner (de Fairchild Semiconductor), Dan Floyd, Zvi Grinfas, Jack Baletto, y Gunnar Wetlesen. La tecnología de fabricación era MOS/LSI (Metal-Oxide-Semiconductor Large-Scale-Integration). Los productos iniciales incluían custom chips y una línea de productos estándar (RAM estática, ROMs, registros electrónicos dinámicos y estáticos) y desde 1979, versiones licenciadas de microprocesadores y microcontroladores: Synertek SY6502, Synertek 6504A y Synertek P6502B (MOS Technology 6502)[2]​[3]​ Synertek 2650 (2650)[4]​ y del Zilog Z8.\nSus mayores clientes fueron Atari (para su líneas de videoconsolas y videojuegos)[5]​ y Apple Computer (para sus ordenadores Apple II y Apple III).[6]​\nSynertek compra Microcomputer Associates, formado por los ingenieros Manny Lemas y Ray Holt, tras lo cual pasó a denominarse Synertek Systems, Inc. y la establece como una filial. En 1978, Synertek Systems lanza un Computador en una tarjeta basado en 6502 llamado el SYM-1, un derivado del MOS Technology/Commodore Semiconductor Group KIM-1. \nEn 1979, Synertek fue adquirida por Honeywell y se establece como una filial.\nSynertek tuvo tres plantas de fabricación de circuitos integrados; una en Singapur, la principal de Santa Clara (California) (opera de 1974 a 1985) y alrededor de 1983, se inició la construcción de una tercera en Santa Cruz (California).\nLa agencia Federal de Medio Ambiente de Estados Unidos presta atención a la contaminación generada por la planta de Santa Clara, lo que acaba en que Honeywell tenga que realizar costosas obras de descontaminación.[7]​[8]​\nCuando las condiciones del mercado se deterioraron, debido principalmente a los problemas de Atari, el trabajo se detuvo en la instalación de Santa Cruz y posteriormente se vendió. Esto trajo que Honeywell no viera rentabilidad en una empresa cuyo principal mercado, el de los chips ROM para consolas, estaba en caída libre y en 1984 comienza a planear su cierre. Finalmente en 1985 Honeywell cerró las operaciones de Synertek y se vendieron sus activos.[1]​\n"}
{"url": "https://es.wikipedia.org/wiki/TV", "title": "Televisión", "summary": "La televisión es un sistema para la transmisión y recepción de imágenes y sonidos a distancia que simulan movimientos, que emplea un mecanismo de difusión. La transmisión puede ser efectuada por medio de ondas de radio, por redes de televisión por cable, televisión por satélite o por IPTV, que son las que existen en modalidades de señal abierta y televisión restringida (televisión por suscripción) El receptor de las señales es el televisor aunque también recibe el nombre de \"televisión\", y se suele abreviar como \"tele\". La abreviatura común de televisión es \"TV\".\nLa palabra «televisión» es un híbrido de la voz griega τῆλε (tēle, «lejos») y la latina visiōnem (acusativo de visiō «visión»). El término televisión se refiere a todos los aspectos de transmisión y programación de televisión. A veces se abrevia como TV. Este término fue utilizado por primera vez en 1900 por el físico ruso Constantine Perskyi en el Congreso Internacional de Electricidad de París (CIEP).\nLa televisión es el medio de comunicación de masas por excelencia. Como se ve en los datos que demuestran que una persona promedio ve más de cuatro horas de televisión al día.[1]​ También se estima que los niños pasan más tiempo viendo televisión (1023 horas anuales) que estudiando en la escuela (900 horas anuales).[2]​ Esto causa un alto impacto a nivel social y pedagógico, por lo que es un objeto de estudio bastante común de la Filosofía y las Ciencias Sociales.\nEl Día mundial de la Televisión se celebra el 21 de noviembre en conmemoración de la fecha en la que tuvo lugar el primer Foro Mundial de Televisión en las Naciones Unidas en 1996.\nLos servicios de provisión de contenidos en la modalidad de vídeo bajo demanda y/o internet streaming pueden ser también ofrecidos como servicios de televisión.[3]​ La aparición de televisores que pueden conectarse a Internet en los últimos años de la primera década del siglo XXI abre la posibilidad de la denominada televisión inteligente en donde se mezclan y conjugan contenidos de la transmisión convencional (broadcast) con otros que llegan vía Internet.[4]​\n"}
{"url": "https://es.wikipedia.org/wiki/Teclado_(inform%C3%A1tica)", "title": "Teclado (informática)", "summary": "En informática, un teclado es un dispositivo de entrada, en parte inspirado en el teclado de las máquinas de escribir, que utiliza un sistema de puntadas o márgenes, para que actúen como palancas mecánicas o interruptores electrónicos que envían toda la información a la computadora o al teléfono móvil. Presenta teclas alfanuméricas (letras y números), de puntuación (punto, coma, dos puntos entre otras) y teclas especiales (las cuales cumplen ciertas funciones o se combinan en conjunto para lograr una función y evitar el uso del ratón).\nPor ejemplo:\nTeclas de edición\nTeclas de dirección\n"}
{"url": "https://es.wikipedia.org/wiki/Teclado_tipo_chiclet", "title": "Teclado tipo chiclet", "summary": "[1]​ Un teclado de chicle (también conocido como teclado de goma) es un argot para un teclado de computadora construido con una matriz de teclas pequeñas, rectangulares y planas hechas de goma o plástico, que parecen borradores o chicle de mascar. El término viene de \"Chiclets\", la marca de una variedad de chicle (Chiclets Adams).\nLos vendedores unánimemente querían el teclado de chicle porque era barato de producir. En los inicios, muchos computadores caseros, (notablemente ZX Spectrum) y computadores portátiles fueron lanzados con él. Sin embargo, los consumidores lo rechazaron con casi igual unanimidad, aunque no era en absoluto tan desagradable de trabajar como el teclado de membrana. Después de 1985, los teclados de chicle no fueron vistos a menudo, con excepción de algunos relojes digitales con calculadora, pequeñas calculadoras de mano, y baratos PDAs no expandibles.\nLa expresión \"teclado de chicle\" no es común para cada país. Por ejemplo, en el Reino Unido, donde la goma de mascar Chicles no se vende, es referido más a menudo como el teclado de carne muerta (por la sensación de las teclas) o simplemente el teclado teclas de goma. En Noruega, el término teclado de borrador fue comúnmente usado, por la semejanza de las teclas con los borradores de lápiz.\n"}
{"url": "https://es.wikipedia.org/wiki/UHF", "title": "UHF", "summary": "Véase también:\nUHF (siglas del inglés: Ultra High Frequency) o frecuencia ultraalta es una banda del espectro electromagnético que ocupa el rango de frecuencias de 300 megahercios a 3 gigahercios. En esta banda se produce la propagación por onda espacial troposférica, con una atenuación adicional máxima de 1 decibelio si existe despejamiento de la primera zona de Fresnel.\nDebido a la tecnología utilizada, el nombre se usó en España también para referirse al canal La 2 de TVE hasta 1990, habiendo caído esta nomenclatura progresivamente en desuso en los últimos años.\n"}
{"url": "https://es.wikipedia.org/wiki/VRAM", "title": "Memoria gráfica de acceso aleatorio", "summary": "Busca fuentes: «Memoria gráfica de acceso aleatorio» – noticias · libros · académico · imágenes\nMemoria gráfica de acceso aleatorio (Video Random Access Memory) es un tipo de memoria RAM que utiliza el controlador gráfico para poder manejar toda la información visual que le envía la CPU del sistema. La principal característica de esta clase de memoria es que es accesible de forma simultánea por dos dispositivos. De esta manera, es posible que la CPU grabe información en ella, mientras se leen los datos que serán visualizados en el monitor en cada momento. Por esta razón también se clasifica como Dual-Ported.\nEn un principio (procesadores de 8 bits) se llamaba así a la memoria solo accesible directamente por el procesador gráfico, debiendo la CPU cargar los datos a través de él. Podía darse el caso de equipos con más memoria VRAM que RAM (como algunos modelos japoneses de MSX2, que contaban con 64 KiB de RAM y 128 KiB de VRAM).\n"}
{"url": "https://es.wikipedia.org/wiki/Videotex", "title": "Videotex", "summary": "Este aviso fue puesto el 25 de noviembre de 2016.\nEl videotex, en España comercializado por Telefónica como Ibertex, se define como una aplicación interactiva que permite difundir, a través de una red de telecomunicación, información de forma paginada suministrada por un sistema informático y visualizada sobre un terminal y una línea telefónica.\nEl decodificador, que es el software característico de las aplicaciones de videotex, tiende a presentar la información en páginas también denominadas pantallas, las cuales se transmiten o reciben en bloque. Cada pantalla suele contener un menú de opciones cuya selección controla las siguientes operaciones a realizar. Una limitación importante de la actual generación de terminales es la baja velocidad de la conexión de éstos a la línea telefónica, de aproximadamente 1200 bits por segundo.\nEn España fue sustituido por InfoVía.\n"}
{"url": "https://es.wikipedia.org/wiki/Voltio", "title": "Voltio", "summary": "El voltio[1]​ o volt[2]​ en inglés, cuyo símbolo es V, es la unidad derivada del Sistema Internacional para el potencial eléctrico, la fuerza electromotriz y la tensión eléctrica.[3]​ Recibe su nombre en honor a Alessandro Volta, quien en 1800 inventó la pila voltaica, la primera batería química.\n"}
{"url": "https://es.wikipedia.org/wiki/ZX_Spectrum", "title": "Sinclair ZX Spectrum", "summary": "El Sinclair ZX Spectrum es un ordenador de 8 bits basado en el microprocesador Zilog Z80A, fabricado por la compañía británica Sinclair Research y lanzado al mercado el 23 de abril de 1982.\nEn Europa, el Sinclair ZX Spectrum fue uno de los microordenadores domésticos más populares de los años 1980. Aún hoy perduran miles de aficionados del Spectrum que siguen jugando a sus juegos (con emuladores que cargan sus ficheros volcados de cintas). Además hay un mercado de coleccionismo tanto de cintas de juegos originales como de los propios Spectrum.\n"}
{"url": "https://es.wikipedia.org/wiki/Denario", "title": "Denario", "summary": "Busca fuentes: «Denario» – noticias · libros · académico · imágenes\nEl denario[a]​ fue una antigua denominación romana de plata[1]​ acuñada aproximadamente entre 268 a. C. y 360. Su valor inicial equivalía a diez ases, de ahí su nombre y su símbolo X. También era equivalente a dos quinarios (medios denarios), cuatro sestercios (cuartos de denario), veinte semises (medio as) y cuarenta cuadrantes (cuartos de as). A principios del siglo I se estableció al denario como una veinticincoava parte de un áureo.\n"}
{"url": "https://es.wikipedia.org/wiki/Digital_object_identifier", "title": "Identificador de objeto digital", "summary": "El identificador de objeto digital, conocido en inglés como digital object identifier y abreviado DOI y DOI, es un enlace permanente en forma de código alfanumérico que identifica de forma única un contenido electrónico. Esta pieza específica de contenido intelectual puede ser un artículo científico, una imagen, un libro, una canción u otro, siempre que se trate de un objeto en el ambiente digital.[1]​ \nUna forma común de emplear el sistema DOI es dar a las publicaciones científicas un número específico que cualquiera puede utilizar para localizar a través de la Red el citado artículo. A diferencia del sistema URL, usado en las páginas web, el sistema DOI no cambia con el paso del tiempo, aunque el artículo sea reubicado en una dirección distinta puesto que lleva la información incorporada en forma de metadatos.[2]​\nEl funcionamiento del DOI se debe a la colaboración de tres tipos de organizaciones:\nInternational DOI Foundation:[3]​ Se encarga de la gestión y promoción de los estándares de la marca.\nCorporation for National Research Initiatives:[4]​ asociación estadounidense no lucrativa destinada a promover el desarrollo de las tecnologías de la información y la comunicación en el campo de la investigación científica y que se encarga de desarrollar y mantener todo el sistema para que el DOI se ejecute correctamente.\nAgencias de registro: Permiten a las editoriales conseguir un DOI para sus publicaciones bajo los criterios de la International DOI Foundation. Algunas agencias de registro son DataCite.[5]​ mEDRA[6]​ y CrossRef.[7]​\nCrossRef es la mayor agencia de registro e inició en enero de 2000. Cuenta hasta ahora con 10800 miembros de más de 114 países diferentes y más de 90 millones de elementos de contenido registrado; además, cuenta con diferentes herramientas para agilizar la búsqueda de información científica. Una de las herramientas que ofrece CrossRef es el CrossRef Metadata Search[8]​ que permite obtener, con tan solo proporcionar el DOI, los datos básicos de una publicación como título, palabras clave, autores y resumen, entre otros. También se pueden obtener los metadatos en formato Bibtex[9]​ y RIS, así como la referencia bibliográfica en formato APA, Vancouver, Chicago, MLA, IEEE y Harvard.\nUn ejemplo del funcionamiento del DOI es en Brasil, donde la Plataforma Lattes del Conselho Nacional de Desenvolvimento Científico e Tecnológico (Consejo Nacional de \nDesarrollo Científico y Tecnológico, CNPq) utiliza el DOI como una forma digital de la certificación de la producción de literatura grabada por los investigadores en sus C.V. Lattes. Cuando un programa navegador encuentra un número DOI, utiliza el prefijo para encontrar la base de datos del editor y así tener acceso a la información sobre el libro o periódico, que puede incluir datos de catálogo, críticas y enlaces.\n"}
{"url": "https://es.wikipedia.org/wiki/Espacio_(puntuaci%C3%B3n)", "title": "Espacio (puntuación)", "summary": "En puntuación, el espacio es un carácter que se representa convencionalmente por ' ' y se escribe pulsando la barra espaciadora en una máquina de escribir, un computador o cualquier otro teclado fabricado a tal efecto. El efecto de la barra espaciadora es mover el punto de inserción una posición.\ncoma\npunto\npunto y coma\ndos puntos\npp. suspensivos\ninterrogación\nexclamación\nparéntesis\ncorchetes\ncomillas\nraya\n"}
{"url": "https://es.wikipedia.org/wiki/Euro", "title": "Euro", "summary": "en búlgaro\n,\nen griego\nen húngaro\n,\nen letón\nen lituano\nen maltés\ny\nen esloveno\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n[\n]\n16 de mayo de 2024\nEl euro (EUR o €), también llamada «moneda única», es la moneda oficial de la Unión Europea (UE). Usada en la eurozona, la cual está formada por 20 de los 27 Estados miembros de la UE: Alemania, Austria, Bélgica, Chipre, Croacia, Eslovaquia, Eslovenia, España, Estonia, Finlandia, Francia, Grecia, Irlanda, Italia, Letonia, Lituania, Luxemburgo, Malta, Países Bajos y Portugal. Dinamarca ha decidido mantenerse al margen de la adopción del euro mediante una cláusula de exclusión. Los 6 Estados restantes están obligados a adoptar el euro al firmar el Tratado de Maastricht. Además, 4 micro-Estados europeos tienen acuerdos con la Unión Europea para el uso del euro como moneda: Andorra, Ciudad del Vaticano, Mónaco y San Marino. Por otra parte, el euro fue adoptado de manera unilateral por Montenegro y Kosovo. El euro es la segunda moneda de reserva así como la segunda moneda más negociada y utilizada en transacciones internacionales en el mundo, después del dólar estadounidense.\nUnos 347 millones de europeos viven en los 20 Estados de la eurozona.[4]​ Además, más de 240 millones de personas alrededor del mundo usan monedas fijadas al euro, incluyendo más de 190 millones de africanos. \nEl nombre de «euro» fue adoptado oficialmente el 16 de diciembre de 1995 en Madrid.[5]​ El euro se introdujo en los mercados financieros mundiales como una moneda de cuenta el 1 de enero de 1999, reemplazando la antigua Unidad Monetaria Europea (ecu) en una proporción de 1:1.\nLas monedas y billetes entraron en circulación el 1 de enero de 2002 en los 12 Estados de la Unión Europea que adoptaron el euro en aquel año:[6]​ Alemania, Austria, Bélgica, España, Finlandia, Francia, Grecia, Irlanda, Italia, Luxemburgo, Países Bajos y Portugal. Además también adoptaron el euro aquel año los microestados europeos de Ciudad del Vaticano, Mónaco y San Marino, que tenían acuerdos con países de la Unión Europea, y Andorra de manera no oficial. En 2011, Andorra firmó un acuerdo monetario con la Unión Europea, el cual entró en vigor el 1 de abril de 2012, que supuso la adopción del euro por Andorra de manera oficial.\nEl 1 de enero de 2007, Eslovenia se incorporó a la zona euro.[7]​ Malta[8]​ y Chipre[9]​ lo hicieron el 1 de enero de 2008 y Eslovaquia el 1 de enero de 2009.[10]​ Estonia se incorporó el 1 de enero de 2011,[11]​ siendo el primer país que había formado parte de la URSS que se convirtió en miembro de la eurozona. Letonia se incorporó el 1 de enero de 2014[12]​ y Lituania lo hizo el 1 de enero de 2015.[13]​ Finalmente, Croacia adoptó el euro el 1 de enero de 2023, siendo el último país en adoptar la moneda común europea.[14]​\nSiete países de la Unión Europea no han adoptado el euro todavía: Bulgaria, Dinamarca, Hungría, Polonia, República Checa, Rumania y Suecia. Tampoco lo hizo el Reino Unido durante sus años de pertenencia en la Unión.\n"}
{"url": "https://es.wikipedia.org/wiki/HTML", "title": "HTML", "summary": "Ejemplo de código fuente escrito en HTML.\n.html\nISO/IEC 15445:2000 (01 de mayo de 2000)\nW3C HTML 4.01 (27 de marzo de 2018)\nHTML Living Standard\nHTML, acrónimo en inglés de HyperText Markup Language («lenguaje de marcado de hipertexto»), hace referencia al lenguaje de marcado utilizado en la creación de páginas web. Este estándar que sirve de referencia del software que interactúa con la elaboración de páginas web en sus diferentes versiones. Define una estructura básica y un código (denominado código HTML) para la presentación de contenido de una página web, que incluye texto, imágenes, videos, juegos, entre otros elementos. Este estándar es gestionado por el World Wide Web Consortium (W3C) o Consorcio WWW, una organización dedicada a la estandarización de la mayoría de las tecnologías asociadas a la web, especialmente en lo relacionado con su escritura e interpretación. HTML se considera el lenguaje web más importante y su invención crucial para el surgimiento, desarrollo y expansión de la World Wide Web (WWW). Es el estándar que prevalece en la visualización de páginas web y es adoptado por todos los navegadores actuales.[1]​\nEl lenguaje HTML se fundamenta en la diferenciación como filosofía de desarrollo. Para añadir elementos externos a una página como imágenes, vídeos o scripts, no se incrustan directamente en el código de la página. En su lugar, se realiza una referencia a la ubicación de cada elemento mediante texto. De este modo, la página web contiene solamente texto, dejando al navegador web (intérprete del código) la labor de unir todos los elementos y visualizar la página final. Al ser un estándar, HTML pretende ser un lenguaje que permita que cualquier página web escrita en una determinada versión, pueda ser interpretada de manera uniforme (siguiendo el estándar) por cualquier navegador web actualizado.\nHTML es un lenguaje de marcado que posibilita definir la estructura de nuestro documento mediante etiquetas. Este lenguaje ofrece una gran adaptabilidad, una estructuración lógica y es fácil de interpre­tar tanto por humanos como por máquinas.\nA lo largo de sus diferentes versiones, HTML ha experimentado la incorporación y eliminación de distintas características, con el propósito de optimizar su eficiencia y facilitar el desarrollo de páginas web compatibles con varios navegadores y plataformas (PC de escritorio, portátiles, teléfonos inteligentes, tabletas, etc.) No obstante, para interpretar adecuadamente una nueva versión de HTML, los desarrolladores de navegadores web deben incorporar estos cambios, y los usuarios debe ser capaces de usar la nueva versión del navegador con todas las actualizaciones aplicadas. Por lo general, estos cambios se implementan mediante actualizaciones automáticas (Firefox, Chrome) u ofreciendo una nueva versión del navegador con todas las modificaciones incorporadas, disponible en un sitio web de descarga oficial (Internet Explorer). En consecuencia, un navegador desactualizado no podrá interpretar de manera precisa una página web escrita en una versión de HTML superior a la que soporta, lo que obliga a menudo a los desarrolladores a aplicar técnicas y cambios para resolver problemas de visualización e incluso de interpretación de código HTML.\nAsí mismo, las páginas web creadas en una versión anterior de HTML deberían ser actualizadas o reescritas, aunque esto no siempre se cumple. Por esta razón, algunos navegadores todavía conservan la capacidad de interpretar páginas web en versiones anteriores de HTML. Estas diferencias en la interpretación de una página web persisten debido a estas razones, generando discrepancias entre distintos navegadores y versiones.\n"}
{"url": "https://es.wikipedia.org/wiki/ISBN", "title": "ISBN", "summary": "El ISBN (por las siglas en inglés de International Standard Book Number, en español «código Internacional normalizado para libros»)[1]​ es un identificador único para libros.[Nota 1]​ Mediante este sistema, a cada libro se le asigna una cadena numérica única internacional que sirve para identificar datos básicos del objeto tales como título, editorial, tirada, extensión, materia, país, traductor, lengua original, etc. No debe confundirse con el ISSN (International Standard Serial Number, en español «número internacional normalizado de publicaciones periódicas»),[2]​ que corresponde al de las publicaciones periódicas, como revistas y diarios.\n"}
{"url": "https://es.wikipedia.org/wiki/ISO/IEC_8859", "title": "ISO/IEC 8859", "summary": " \n \nISO/IEC 8859 es un conjunto ISO y la IEC estándar de 8 bits para codificaciones de caracteres para su uso en computadoras. La norma se divide en los números, publicado por separado, tales como ISO/IEC 8859-1, ISO/IEC 8859-2, etc, cada uno de los cuales puede ser informal a que se refiere como una norma en sí misma. En la actualidad hay 15 partes a partir de 2006, sin contar el abandonado ISO/ IEC 8859-12 estándar.\n"}
{"url": "https://es.wikipedia.org/wiki/Idioma_ingl%C3%A9s", "title": "Idioma inglés", "summary": " \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n[\n]\n     Países donde el inglés es el idioma nacional o el idioma nativo de la mayoría.\n     Países donde el inglés es un idioma oficial u administrativo, pero no la lengua de la mayoría.\nEl idioma inglés (Englishⓘ) es una lengua germánica occidental perteneciente a la familia de lenguas indoeuropeas, que surgió en los reinos anglosajones de Inglaterra. Hoy en día el inglés es tanto el idioma más hablado en el mundo, así como el tercer idioma nativo más hablado, después del chino mandarín y el español.\nAsimismo, el inglés es el único idioma que es oficial en los cinco continentes. Además, es el idioma principal de la angloesfera (el conjunto de naciones industrializadas de habla inglesa), y también se habla ampliamente en áreas del Caribe, África, Asia del Sur, Sudeste Asiático y Oceanía.[1]​\nEs la lengua oficial de muchos países de la Mancomunidad de Naciones y una de las lenguas oficiales en 59 Estados soberanos.[2]​ Es uno de los idiomas oficiales de la Unión Europea y de las Naciones Unidas. También ha llegado a ser la lengua de facto de la diplomacia, ciencia, comercio internacional, turismo, aviación, entretenimiento y del internet.\nHistóricamente, el inglés moderno se originó a partir de la evolución de diversos dialectos germánicos, ahora llamados de manera colectiva anglosajón, que fueron llevados a la costa oriental de Gran Bretaña por colonizadores germánicos, los anglosajones, hacia el siglo V d. C.\nLa palabra inglés deriva del término ænglisc aplicado a los anglos.[3]​ El idioma inglés recibió después las influencias del nórdico antiguo debido a las invasiones vikingas en Gran Bretaña en los siglos VIII y IX. En cambio la mayoría de las palabras del inglés derivan de raíces latinas, pues esta fue la lengua franca del cristianismo y de la vida intelectual europea durante siglos.[4]​ Además, la conquista normanda de Inglaterra en el siglo XI dio lugar a importantes préstamos lingüísticos del idioma normando (de raíz latina), y las convenciones de vocabulario y ortografía comenzaron a darle una apariencia superficial de proximidad con las lenguas romances,[5]​[6]​ a lo que para entonces se había convertido en el inglés medio. \nEl gran desplazamiento vocálico que comenzó en el sur de Inglaterra en el siglo XV es uno de los hechos históricos que caracterizan la emergencia del inglés moderno a partir del inglés medio.\nDebido a la importante incorporación de palabras de varias lenguas europeas a lo largo de la historia, el inglés moderno contiene un vocabulario muy amplio. El Oxford English Dictionary contiene más de 250 000 palabras distintas, sin incluir muchos términos técnicos, científicos y de jergas.[7]​[8]​\nAsimismo, a fecha de 2024, es considerada la lengua franca de la era moderna.[9]​\n"}
{"url": "https://es.wikipedia.org/wiki/Idioma_irland%C3%A9s", "title": "Idioma irlandés", "summary": " \n \n \n \n \n[\n]\nIndoeuropeo\n Celta\n  Insular\n   Goidélico\n \nEl irlandés o gaélico irlandés moderno (en irlandés: Gaeilge) es un idioma goidélico de la rama celta de la familia de lenguas indoeuropeas originario de la isla de Irlanda y hablado históricamente por los irlandeses. Se estima que el número de personas de la isla que lo hablan como lengua nativa ronda entre 20 000 y 80 000, predominantemente en las regiones rurales occidentales.[2]​[3]​[4]​ El irlandés era la lengua principal de la isla antes de que se produjese la conquista inglesa de Irlanda durante la Edad Media. \nDesde 1922, con la independencia de la República de Irlanda (llamado originalmente el Estado Libre Irlandés), ha sido el idioma oficial junto al inglés. En 1998, con el Acuerdo de Viernes Santo, fue reconocido oficialmente como lengua de minoría en Irlanda del Norte, país constituyente del Reino Unido. El 13 de junio de 2005 se aprobó e incluyó como idioma de trabajo en la Unión Europea, lo que entró en vigor el 1 de enero de 2007.[5]​ El 22 de enero del mismo año, el ministro Noel Treacy lo usó por primera vez en una reunión del Consejo de Ministros de la Unión Europea.\nEn la actualidad, es idioma oficial en todos los territorios pertenecientes a Irlanda e Irlanda del Norte, oficialidad que comparte con el inglés, siendo este cooficial en todo el territorio.\nEl Departamento de la Gaeltacht de Asuntos Rurales y Comunitarios de Irlanda estimó en 2003 que alrededor de 1 500 000 personas aseguraban tener conocimiento del idioma.[6]​ En 2007, de los 4,3 millones de habitantes de la república, el 40,8 % era capaz de hablarlo.[7]​\nLas comunidades y regiones donde se habla el irlandés se llaman Gaeltachtaí (Gaeltacht en singular) y la mayor de ellas es Connemara, en el Condado de Galway, incluyendo las islas Aran.\nAl ser el irlandés un requerimiento de estudio en las escuelas públicas del país, muchos lo hablan con fluidez como segundo idioma nativo. Aunque el idioma principal de la isla es el inglés, existen varios periódicos, revistas y emisoras de radio en irlandés, especialmente en los Gaeltachtaí.[8]​ Desde 1996 existe un canal de televisión llamado Teilifís na Gaeilge (Televisión del Irlandés) o TG4.\nLos tres dialectos irlandeses principales son el del Úlster en el norte, el de Munster en el sur y el de Connacht en la región central y occidental de la isla. \n"}
{"url": "https://es.wikipedia.org/wiki/Idioma_italiano", "title": "Idioma italiano", "summary": " \n \n \nSuiza \n \n \n[\n]\nIndoeuropeo\n Itálico  Latino-Falisco   Romance    Romance oriental\n     Italorromance\n      Toscano\n4 países:\n Italia\n Suiza\n San Marino\n Ciudad del Vaticano\n1 región y 4 ciudades\n Condado de Istria\n Capodistria, Isola, Pirano, Ancarano\nOrganizaciones:\n Unión Europea\n Orden de Malta\n Santa Sede\nEl italiano (italianoⓘ) es una lengua romance procedente del latín hablado, especialmente de la variante toscana arcaica,[2]​ perteneciente a la familia italorromance de las lenguas itálicas, integrantes a su vez de las lenguas indoeuropeas.\nEs el idioma oficial de Italia, San Marino, Ciudad del Vaticano y uno de los cuatro idiomas nacionales helvéticos (con el alemán, el francés y el romanche). Es, además, lengua cooficial, con el croata, en el condado de Istria (Croacia), y con el esloveno en los municipios costeros del Litoral esloveno.\nEl italiano es usado también como primera o segunda lengua por varios millones de migrantes italianos y sus descendientes esparcidos por el mundo, sobre todo en Europa. Se calcula que en el año 2006, unos 64 millones de ciudadanos europeos hablaban el italiano como lengua materna y 14,7 millones como segunda o tercera lengua.[3]​ Núcleos consistentes de italófonos se encuentran también en América; en menor medida, en África y Oceanía (es escasa la presencia en Asia).[4]​\n"}
{"url": "https://es.wikipedia.org/wiki/Idioma_malt%C3%A9s", "title": "Idioma maltés", "summary": " Malta Italia Túnez Reino Unido Canadá Estados Unidos Australia\n \nItalia\n \nEspaña\n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \n \nAfroasiática\n  Semítica\n    Sem. Occidental\n      Árabe\n        Magrebí\nEl idioma maltés (en maltés il-Malti o también l-ilsien Malti, la lengua maltesa) es uno de los dos idiomas oficiales de Malta junto al inglés y es considerada como la lengua nacional de Malta,[1]​ además de ser una de las lenguas oficiales de la Unión Europea.\nEs una lengua semítica derivada del árabe, principalmente del árabe magrebí, que ha recibido una fuerte influencia latina en cerca del 60 % de su vocabulario (principalmente del italiano y del siciliano).[2]​ Esta lengua ha conocido una evolución peculiar y tiene buena cantidad de préstamos de otras lenguas, por lo que a menudo se dice que es una lengua mezclada,[3]​[4]​ semítica o criolla.[5]​[6]​ Algunos lingüistas dicen que el maltés es inclasificable.[4]​[7]​[5]​\nProcede del árabe coloquial siciliano, dialecto del árabe magrebí hoy desaparecido. Su aislamiento del mundo árabe, por motivos políticos y religiosos, hizo que se desarrollara como lengua diferenciada, adoptando muchos préstamos del griego, del italiano, del siciliano, del catalán, del español y del inglés. Durante algún tiempo se manejó la hipótesis de un origen fenicio, pero esta teoría se basaba más en consideraciones políticas que en lingüísticas[8]​ y hoy se encuentra desacreditada.\nEs la única lengua semítica que se escribe oficialmente con caracteres latinos. El maltés se convirtió en lengua oficial de Malta en 1936, junto con el inglés. Anteriormente, hasta 1530, la lengua oficial había sido el siciliano y, luego, el italiano.\n"}
{"url": "https://es.wikipedia.org/wiki/Italia", "title": "Italia", "summary": "Repubblica Italiana  (italiano)\n \n    \n    \n    \n41°53′35″N 12°28′58″E﻿ / ﻿41.893055555556, 12.482777777778\n \n[\n]\n \nFundación\n• Risorgimento• Reino de Italia• Toma de Roma• Marcha sobre Roma• República actual\n1848-187017 de marzo de 1861[1]​20 de sept. de 1870[1]​30 de octubre de 1922[2]​2 de junio de 1946[1]​\n \n0,906\nMuy Alto\nmedio\n \n \n↑ El francés es cooficial en la región del Valle de Aosta, el alemán en la provincia de Bolzano, el ladino en las provincias de Bolzano, Trento y Belluno, el esloveno en las provincias de Trieste y Gorizia, el friulano en la región de Friul-Venecia Julia, el catalán en el municipio de Alguer y el sardo en la región de Cerdeña.[8]​\n↑ Excepto en Campione d'Italia, donde también se usa el franco suizo. Hasta 2002 se usaba la lira italiana.\n↑ También .eu por formar parte de la Unión Europea.\nItalia, oficialmente la República Italiana (en italiano: Repubblica Italiana pronunciado /re'pub:lika ita'ljana/), es un país soberano transcontinental, constituido en una república parlamentaria compuesta por veinte regiones, integradas estas, a su vez, por ciento once provincias.[9]​ Es uno de los veintisiete Estados soberanos que forman la Unión Europea.\nItalia se ubica en el centro del mar Mediterráneo, en Europa meridional. Ocupa la península itálica así como la llanura Padana, las islas de Sicilia y Cerdeña y alrededor de ochocientas islas menores, entre las que se destacan las islas Tremiti en el mar Adriático, los archipiélagos Campano y Toscano en el mar Tirreno, o las islas Pelagias en África septentrional, entre otras. En el norte está rodeada por los Alpes y tiene frontera con Francia, Suiza, Austria y Eslovenia. Los micro-Estados de San Marino y Ciudad del Vaticano son enclaves dentro del territorio italiano; a su vez, Campione d'Italia, es un municipio que forma un pequeño exclave italiano en territorio suizo.[10]​\nDebido a su localización central en el mar Mediterráneo, Italia recibió, durante la Antigüedad,[11]​[12]​ diversas influencias de civilizaciones mediterráneas exteriores, como las de los fenicios y cartagineses en sus islas mayores[13]​[14]​ y de los antiguos griegos en la llamada Magna Grecia,[15]​[16]​ así como también fue la cuna de muchas culturas propias distintas, como la civilización nurágica, los etruscos y los latinos, siendo estos últimos quienes dieron inicio a la civilización romana,[17]​[18]​ y asistió al nacimiento de la República y del posterior Imperio romano.[19]​[20]​ Tras la caída del Imperio romano de Occidente, bizantinos, lombardos y musulmanes se disputaron el control sobre el territorio itálico,[21]​[22]​ quebrando así su anterior unidad política.[23]​[24]​\nA partir de la Plena Edad Media, Italia fue la cuna de repúblicas marítimas como Venecia, Génova, Pisa y Amalfi, de los Estados Pontificios y también del Renacimiento y del movimiento barroco, entre otros Estados y movimientos culturales.[25]​[26]​ En el curso de los siglos XVII y XVIII, la importancia económica y comercial italiana disminuyó significativamente;[27]​ mientras, en el siglo XIX, mediante el proceso conocido como Risorgimento, los varios territorios italianos lograron unificarse bajo un mismo Estado: el Reino de Italia.[28]​[29]​\nPosteriormente, a principios del siglo XX y a pesar de haber sido una de las Potencias Aliadas victoriosas en la Primera Guerra Mundial, Italia entró en un período de crisis financiera y agitación social, que condujo al surgimiento de la dictadura fascista en 1922. Con la Segunda Guerra Mundial, Italia fue parte de las Potencias del Eje hasta que fue derrotada por las Potencias Aliadas (1940-1943), resultando parte de su territorio ocupado por la Alemania nazi en cooperación con el fascismo hasta la liberación de Italia (1943-1945). Tras el final de la guerra, el país reemplazó la monarquía por la actual república mediante referéndum, en 1946.\nItalia es una república democrática, forma parte del G7 y es un país desarrollado con una calidad de vida muy alta.[30]​[31]​ Es el país número 28 (informe 2017) en materia de alto índice de desarrollo humano.[32]​ Es una potencia regional y mundial,[33]​[34]​[35]​[36]​ miembro fundador de la Unión Europea, firmante del Tratado de Roma en 1957. También es miembro fundador de la Organización del Tratado del Atlántico Norte (OTAN) y miembro del OTAN Quint, de la Organización para la Cooperación y el Desarrollo Económico, de la Organización Mundial del Comercio, del Consejo de Europa, del G-4, del G-12 y del G20.\nLa ciudad de Roma ha sido uno de los centros culturales de la civilización occidental y es sede de la Iglesia católica, siendo en la actualidad también sede de organizaciones mundiales como la FAO,[37]​ el IFAD, el Glocal Forum,[38]​ o el WFP. Otras ciudades importantes son Milán, Nápoles y Turín. Italia es el tercer país de Europa (y quinto del mundo) que más turistas recibe por año, y tiene 59 patrimonios de la humanidad declarados por la Unesco, siendo actualmente el país con mayor número del mundo.[39]​\n"}
{"url": "https://es.wikipedia.org/wiki/Lat%C3%ADn", "title": "Latín", "summary": " \nPontificia Academia de Latinidad[1]​\nEl latín (autoglotónimo: Lingua Latina o Latīnum) es una lengua itálica perteneciente al subgrupo latino-falisco,[2]​ y a su vez a la familia de las lenguas indoeuropeas,[3]​ que fue hablada en la Antigua Roma y posteriormente durante la Edad Media y la Edad Moderna, llegando hasta la Edad Contemporánea, pues se mantuvo como lengua científica hasta el siglo XIX. Su nombre deriva de una zona geográfica de la península itálica donde se desarrolló Roma, el Lacio (en latín, Latium).\nAdquirió gran importancia con la expansión de Roma,[4]​ y fue lengua oficial del Imperio romano en gran parte de Europa, África septentrional y Oriente Próximo, junto al griego. Como las demás lenguas indoeuropeas en general, el latín era una lengua flexiva de tipo fusional con un mayor grado de síntesis nominal que las actuales lenguas romances, en la cual dominaba la flexión mediante sufijos, combinada en determinadas veces con el uso de las preposiciones, mientras que en las lenguas modernas derivadas dominan las construcciones analíticas con preposiciones, mientras que se ha reducido la flexión nominal a marcar solo el género y el número, conservando los casos de declinación solo en los pronombres personales (estos tienen, además, un orden fijo en los sintagmas verbales).[a]​\nEl latín originó un gran número de lenguas europeas, denominadas lenguas romances, como el español, francés, franco-provenzal, friulano, gallego, istriano, istrorrumano, italiano, ladino, ligur, lombardo, meglenorrumano, napolitano, occitano, piamontés, portugués, romanche, rumano, sardo, siciliano, valón, véneto, aragonés, arrumano, asturleonés, catalán, corso, emiliano-romañol, y otros ya extintos, como el dalmático, panonio y el mozárabe. También ha influido en las palabras de las lenguas modernas debido a que durante muchos siglos, después de la caída del Imperio romano, continuó usándose en toda Europa como lingua franca para las ciencias y la política, sin ser seriamente amenazada en esa función por otras lenguas en auge (como el español en el siglo XVII o el francés en el siglo XVIII), hasta prácticamente el siglo XIX.\nLa Iglesia católica lo usa como lengua litúrgica oficial (sea en el rito romano o sea en los otros ritos latinos), aunque desde el Concilio Vaticano II se permiten además las lenguas vernáculas.[5]​ También se usa para los nombres binarios de la clasificación científica de los reinos animal y vegetal, para denominar figuras o instituciones del mundo del Derecho, como lengua de redacción del Corpus Inscriptionum Latinarum, y en artículos de revistas científicas publicadas total o parcialmente en esta lengua.\nEl alfabeto latino, derivado del alfabeto griego (en sí derivado del alfabeto fenicio), es ampliamente el alfabeto más usado del mundo con diversas variantes de unas lenguas a otras. El estudio del latín, junto al del griego clásico, es parte de los llamados estudios clásicos, y aproximadamente hasta los años 1970 fue estudio casi imprescindible en las humanidades. Hasta el día de hoy, en países como Alemania, en los Gymnasien se enseña latín o griego junto a lenguas modernas.\n"}
{"url": "https://es.wikipedia.org/wiki/Libra_(unidad_de_masa)", "title": "Libra (unidad de masa)", "summary": "La libra (lb) actualmente es una unidad de masa, usada desde  la Antigua Roma como unidad de peso.[1]​ La palabra (derivada del latín) significa «escala o balanza»,[2]​[3]​ y todavía es el nombre de la principal unidad de masa usada en los Estados Unidos y en algunos países de habla hispana.[4]​\nLa libra ha tenido valores muy diversos a lo largo de la historia, especialmente en la antigüedad, y la libra que todavía se utiliza es la libra avoirdupois, por lo que si se menciona la palabra «libra» refiriéndose a la masa, se entiende que se está hablando de esta libra avoirdupois.[5]​\nUna libra actual equivale a 0,453 592 37 kilogramos y a su vez un kilogramo es igual a 2,204 622 62 libras avoirdupois.[6]​\n"}
{"url": "https://es.wikipedia.org/wiki/Lira_italiana", "title": "Lira italiana", "summary": "Italia\n \n \n \nfija\nLira italiana\nEuro\nLa lira italiana (plural italiano lire, símbolo monetario: ₤) fue la moneda oficial de Italia desde 1861 hasta 2002 antes de la introducción del euro el 1 de enero de 2002, siendo reemplazada definitivamente por éste.\nLa tasa de cambio fija era de 1.936,27 liras por cada euro. \nLa lira fue también la moneda oficial del Reino Napoleónico de Italia, entre 1807 y 1814.\nEl término proviene del valor del peso físico de una libra de plata de alta pureza, guardando una relación directa con la libra esterlina; en algunos países, como Chipre y Malta, las palabras liras y libra fueron utilizados como sinónimos, antes de que el euro fuera aprobado en 2008 en ambos países.\n"}
{"url": "https://es.wikipedia.org/wiki/Mac_OS_Classic", "title": "Mac OS Classic", "summary": "Por favor, edítalo y/o discute los problemas en la discusión para mejorarlo:\nNecesita ser wikificado conforme a las convenciones de estilo de Wikipedia.\nNo se cumplen las reglas de ortografía, gramática o los estándares definidos en el Manual de estilo de Wikipedia.\nMac OS (originalmente System Software; retrónimo: Classic Mac OS) es la serie de sistemas operativos desarrollados para la familia de computadoras Macintosh por Apple Computer, Inc. de 1984 a 2001, comenzando con System 1 y terminando con Mac OS 9. Al sistema operativo Macintosh se le atribuye haber popularizado el concepto de interfaz gráfica de usuario.\nSe incluyó con todos los Macintosh que se vendieron durante la época en que se desarrolló y muchas actualizaciones del software del sistema se realizaron junto con la introducción de nuevos sistemas Macintosh.\nMotorola 68000PowerPC\nMac OS ha sido pre-instalado en casi todos los computadores Macintosh vendidos. El sistema operativo también se vendía en forma separada en las tiendas de Apple y en línea. El Mac OS original estaba basado parcialmente en el Lisa OS, previamente comercializado por Apple para la computadora Lisa en 1983 y, como parte de un acuerdo que permitía a Xerox comprar acciones de Apple a un precio favorable, también usaba conceptos del Xerox Alto, el cual Steve Jobs y otros miembros del equipo Macintosh habían visto.\n"}
{"url": "https://es.wikipedia.org/wiki/Microsoft_Windows", "title": "Microsoft Windows", "summary": "CC++lenguaje ensamblador\n(versiones basadas en MS-DOS)\n(versiones basadas en Windows NT)\nARMArquitectura Intel ItaniumMIPSDEC AlphaPowerPCx86\n[\n]\n(11.0.00000.137)\nTodos los sistemas operativos Windows reciben un grado variable de servicio, bajo la directiva de Ciclo de vida de soporte técnico de Microsoft (info)↓Véase: Historial de lanzamientos\nHistoria de Microsoft Windows\nVersiones de Microsoft Windows\nWindows es el nombre de una familia de distribuciones de software para PC, servidores, sistemas empotrados y antiguamente teléfonos inteligentes desarrollados y vendidos por Microsoft y disponibles para múltiples arquitecturas, tales como x86, x86-64 (x64) y ARM.\nDesde un punto de vista técnico, no son sistemas operativos, sino que contienen uno (tradicionalmente MS-DOS o el más actual cuyo núcleo es Windows NT) junto con una amplia variedad de software; no obstante, es usual (aunque no necesariamente correcto) denominar al conjunto como sistema operativo en lugar de distribución. Microsoft introdujo un entorno operativo denominado Windows el 20 de noviembre de 1985 como un complemento para MS-DOS en respuesta al creciente interés en las interfaces gráficas de usuario (GUI).[2]​ Microsoft Windows llegó a dominar el mercado mundial de computadoras personales, con más del 70 % de la cuota de mercado, superando a Mac OS, que había sido introducido en 1984.\nLa versión más reciente de Windows es Windows 11 para equipos de escritorio, Windows Server 2022 para servidores y Windows 10 Mobile para dispositivos móviles. La primera versión en español fue Windows 2.1.\nLa primera versión se lanzó en 1985 y comenzó a utilizarse de forma generalizada gracias a su interfaz gráfica de usuario (GUI, Graphical User Interface) basada en ventanas. Hasta ese momento (y hasta mucho después como corazón de Windows), el sistema operativo más extendido era MS-DOS (Microsoft Disk Operating System), que por aquel entonces contaba con una interfaz basada en línea de comandos.\nWindows 10 llegó de forma oficial y gratuita a usuarios con licencia genuina de Windows 7, Windows 8 y Windows 8.1 el 29 de julio de 2015. Fue la primera versión que buscó la unificación de dispositivos (escritorio, portátiles, teléfonos inteligentes, tabletas y videoconsolas) bajo una experiencia común. Su sucesor, Windows 11, se lanzó oficialmente el 5 de octubre de 2021 como una actualización gratuita a través de Windows Update de Windows 10, para aquellos equipos que cumpla con ciertas especificaciones técnicas compatibles del nuevo sistema. Microsoft promovió que Windows 11 habría mejorado el rendimiento y la facilidad de uso sobre Windows 10, contando con cambios importantes en el Shell de Windows influenciados por el cancelado Windows 10X, incluido un menú Inicio rediseñado, así como la incompatibilidad con la arquitectura x86 de 32 bits o los sistemas que usan firmware del BIOS.\n"}
{"url": "https://es.wikipedia.org/wiki/Moneda_(divisa)", "title": "Moneda (divisa)", "summary": "La moneda o unidad monetaria es una unidad de cambio que facilita la transferencia de bienes y servicios. Se muestra en forma de piezas metálicas, llamadas monedas –normalmente redondas–, o en forma de piezas de papel, llamados billetes o papel moneda. También se presenta como «dinero de plástico» (tarjetas de crédito), como talones, cheques o pagarés, etc. El término moneda que hace referencia a la divisa propia del país o del mercado monetario al que pertenece el país, se le refiere propiamente como moneda. Es decir, el metal o papel moneda utilizado para obtener bienes, productos o servicios dentro del ámbito cuyo banco central lo ha expedido. \nSe le denomina divisa, en cambio, cuando se refiere a una moneda, o unidad de cuenta, extranjera[1]​ o bajo soberanía externa respecto al ámbito con soberanía propia[2]​ por donde circula la moneda y que se utiliza fundamentalmente para el intercambio de bienes y servicios entre países.\nSegún se expresa el Banco de España,[3]​ y otras entidades,[4]​  no debe confundirse con ello dos conceptos: \nun cambio de moneda es la compraventa de la moneda diferente a la propia para usar en el ámbito geográfico donde se regula y emplea de forma similar a la propia. Por ejemplo, en el país de destino, en caso de un viaje.\nun cambio de divisa, por otro lado, no supone un movimiento físico del dinero. Por ejemplo, una transferencia recibida en dólares se ingresa en la cuenta personal en la moneda correspondiente, según el país correspondientes (euros, pesos, soles, etc).\nHabitualmente, cada país tiene establecida, al menos, una moneda oficial sobre su territorio presentada bajo diferentes medios de pago también de curso legal. En cambio, varios países pueden:\nutilizar la misma moneda (caso del euro con los países miembros de la Unión monetaria europea, o como Liechtenstein en unión monetaria con Suiza — con el franco suizo) ;\nadoptar una divisa extranjera como unidad monetaria legal : caso de Panamá, El Salvador, Puerto Rico, Islas Vírgenes Británicas, Islas Vírgenes de los Estados Unidos, Islas Turcas y Caicos, Ecuador y Zimbabue, (con el dólar estadounidense), o de la Ciudad del Vaticano, de San Marino, de Mónaco y de Andorra, y, de facto, del Kosovo y de Montenegro (con el euro).\nPor motivos prácticos, las divisas pueden tener subdivisiones, legales o tradicionales: 1/1000 (los millimes de dinar tunecino), 1/100 (los céntimos de euro), 1/20, 1/10, 1/8, 1/4 (el cuarto de dólar estadounidense), etc.\n"}
{"url": "https://es.wikipedia.org/wiki/Penique", "title": "Penique", "summary": "El penique (en plural peniques; en inglés, penny en singular, y pence en plural) es un valor de cambio monetario usado en el Reino Unido; vale la centésima parte de una libra esterlina. Antes de 1971, su valor era la 1/240 parte de una libra esterlina, y pesaba un pennyweight. Un penique era la doceava parte de un chelín.[1]​\nLas cantidades inferiores a una libra esterlina o libra irlandesa son sufijadas con una p, como en 2p 5p, 26p, 72p. Antes de 1972 a las cantidades menores de una libra se sufijaban con una d, proveniente del término denario.[2]​ \nExistieron valores de cambio inferiores al penique como los medios peniques y los cuartos peniques, llamados farthings.\n"}
{"url": "https://es.wikipedia.org/wiki/Plata", "title": "Plata", "summary": "Paladio\nCadmio\n \n \n[Kr] 4d10 5s1\n(escala de Pauling)\n(calc)\n(radio de Bohr)\nenergía de ionización\nenergía de ionización\nValores en el SI y condiciones normales de presión y temperatura, salvo que se indique lo contrario.\nLa plata es un elemento químico de número atómico 47 situado en el grupo 11 de la tabla periódica de los elementos. Su símbolo es Ag (del latín argentum, 'plata', de la raíz indoeuropea *h₂erǵ-, 'blanco, brillante'). Es un metal noble, de transición, de color blanco brillante, blando, dúctil y maleable.\nEn la naturaleza se encuentra como parte de distintos minerales (generalmente en forma de sulfuro) o como plata libre. Es poco común  en la naturaleza, de la que representa una parte en mil de corteza terrestre. La mayor parte de su producción se obtiene como subproducto del tratamiento de las minas de cobre, zinc, plomo y oro.\n"}
{"url": "https://es.wikipedia.org/wiki/Reino_Unido", "title": "Reino Unido", "summary": "United Kingdom of Great Britain and Northern Ireland  (inglés)\n \n[\n]\n51°30′26″N 0°07′39″O﻿ / ﻿51.507222222222, -0.1275\n \n \nFormación\n• Acta de Unión• Acta de Unión• Tratado anglo-irlandés\n1 de mayo de 17071 de enero de 180112 de abril de 1922\n \n0,940\nMuy Alto\nLibra esterlina (£, GBP)\n \nEl Reino Unido (R. U.; en inglés: United Kingdom, UK),[nota 1]​ oficialmente Reino Unido de Gran Bretaña e Irlanda del Norte (United Kingdom of Great Britain and Northern Irelandⓘ),[nota 2]​ es un país soberano e insular ubicado al noroeste de la Europa continental. Su territorio está formado geográficamente por la isla de Gran Bretaña, el noreste de la isla de Irlanda y pequeñas islas adyacentes. Su capital y ciudad más poblada es Londres. Desde la independencia de la República de Irlanda, Irlanda del Norte ha sido la única parte del país con una frontera terrestre, hasta la inauguración del Eurotúnel que une por tierra a la isla de Gran Bretaña con Francia y las tierras continentales europeas. Gran Bretaña limita al norte y al oeste con el océano Atlántico, al este con el mar del Norte, al sur con el canal de la Mancha y al oeste con el mar de Irlanda. El inglés es el idioma de facto y como tal comprende una de las naciones centrales de la angloesfera.\nEl Reino Unido es un Estado unitario comprendido por cuatro naciones constitutivas: Escocia, Gales, Inglaterra e Irlanda del Norte.[15]​ Es gobernado mediante un sistema parlamentario con sede de gobierno y capitalidad en Londres, pero con tres administraciones nacionales descentralizadas en Edimburgo, Cardiff y Belfast, las capitales de Escocia, Gales e Irlanda del Norte, respectivamente. Es una monarquía parlamentaria, siendo Carlos III el jefe de Estado. Coloquial y erróneamente se denomina Gran Bretaña e Inglaterra, consecuencia del mayor peso de ambos (territorio y reino, respectivamente) dentro del Estado.[16]​[17]​ Las dependencias de la Corona de las islas del Canal —Jersey y Guernsey— y la Isla de Man no forman parte del Reino Unido, si bien el Gobierno británico es responsable de su defensa y las relaciones internacionales.[18]​\nEl Reino Unido tiene catorce territorios de ultramar, todos ellos vestigios de lo que fue el Imperio británico, que en su territorio internacional llegó a alcanzar y a abarcar cerca de una quinta parte de la superficie terrestre mundial. Carlos III continúa estando a la cabeza de la Mancomunidad de Naciones y siendo jefe de Estado de cada uno de los Reinos de la Mancomunidad.\nEs un país desarrollado que por su volumen neto de producto interno bruto es la quinta economía mundial (por su PIB nominal) y novena por su PIB PPA. Fue el primer país industrializado del mundo[19]​ y la principal potencia mundial durante el siglo XIX y el comienzo del siglo XX[20]​ (1815-1945), pero el costo económico de las dos guerras mundiales y el declive de su imperio en la segunda parte del siglo XX disminuyeron su papel en las relaciones internacionales. Sin embargo, aún mantiene una significativa influencia económica, cultural, militar y política, y es una potencia nuclear. Fue miembro de la Unión Europea entre 1973 y 2020, de la que se salió en el proceso conocido como Brexit.[nota 3]​ Es uno de los cinco miembros permanentes del Consejo de Seguridad de las Naciones Unidas con derecho a veto, miembro del G7, el G-20, la OTAN, la OCDE, la UKUSA, la Mancomunidad de Naciones y la Common Travel Area.\n"}
{"url": "https://es.wikipedia.org/wiki/S%C3%ADmbolo", "title": "Símbolo", "summary": "Un símbolo (del latín: simbŏlum, y éste del griego σύμβολον,symbolon, compuesto de σύν-, \"con\", \"conjuntamente\", y ballein, \"lanzar\", \"arrojar\", \"tirar\", es decir, \"arrojar juntos\"[1]​) es la representación perceptible de una idea, con rasgos asociados por una convención socialmente aceptada. Es un signo sin semejanza ni contigüidad, que solamente posee un vínculo convencional entre su significante y su denotado, además de una clase intencional para su designado.\nLos grupos sociales suelen tener símbolos que los representan: existen símbolos referentes a diversas asociaciones culturales, artísticas, religiosas, políticas, comerciales, deportivas, entre otros.\n"}
{"url": "https://es.wikipedia.org/wiki/S%C3%ADmbolo_del_d%C3%B3lar", "title": "$", "summary": "$ (conocido como signo de peso o signo de dólar) es un símbolo monetario utilizado por múltiples monedas del mundo, sobre todo en América, entre ellas el peso, dólar, real brasileño y córdoba nicaragüense. El peso mexicano fue la primera moneda en abreviarse con el signo «$» antes que el dólar estadounidense, que también acabó abreviándose con ese símbolo.[1]​ \nEste signo de pesos se utiliza para representar, las siguientes monedas.\nel peso, ya sea el mexicano, el argentino, el chileno, el colombiano, el cubano, el dominicano, el uruguayo y otros, excepto el peso filipino, cuyo símbolo es ₱.\nel dólar, ya sea el estadounidense, el australiano, el canadiense el de Hong Kong u otros;\nel córdoba nicaragüense;\nel real brasileño,\nel pa'anga o dólar tongano.\n"}
{"url": "https://es.wikipedia.org/wiki/Unicode", "title": "Unicode", "summary": "Unicode es un estándar de codificación de caracteres diseñado para facilitar el tratamiento informático, transmisión, y visualización de textos de numerosos idiomas y disciplinas técnicas, además de textos clásicos de lenguas muertas. El término Unicode proviene de los tres objetivos perseguidos: universalidad, uniformidad, y unicidad.[1]​\nUnicode define cada carácter o símbolo mediante un nombre e identificador numérico, el punto de código (code point). Además incluye otras informaciones para el uso correcto de cada carácter, como sistema de escritura, categoría, direccionalidad, mayúsculas y otros atributos. Unicode trata los caracteres alfabéticos, ideográficos y símbolos de forma equivalente, lo que significa que se pueden mezclar en un mismo texto sin utilizar marcas o caracteres de control.[2]​\nEste estándar es mantenido por el Unicode Technical Committee (UTC), integrado en el Consorcio Unicode, del que forman parte con distinto grado de implicación empresas como: Microsoft, Apple, Adobe, IBM, Oracle, SAP, Google o Facebook, instituciones como la Universidad de Berkeley, o el Gobierno de la India y profesionales y académicos a título individual.[3]​\nEl Unicode Consortium mantiene estrecha relación con ISO/IEC, con la que mantiene desde 1991 el acuerdo de sincronizar sus estándares que contienen los mismos caracteres y puntos de código.[4]​\nLa creación de Unicode ha sido un proyecto de gran relevancia con el objetivo de reemplazar los esquemas de codificación de caracteres existentes, los cuales presentaban limitaciones significativas en tamaño y compatibilidad con entornos plurilingües. Unicode se ha convertido en el esquema de codificación de caracteres más completo y extenso, siendo el dominante en la internacionalización y adaptación local del software informático. Este estándar ha sido ampliamente adoptado en diversas tecnologías recientes, como XML, Java y sistemas operativos modernos.\nLa descripción exhaustiva del estándar y las tablas de caracteres están disponibles en el sitio web oficial de Unicode. Cada vez que se finaliza una nueva versión principal, se pública una referencia completa en formato de libro, también está disponible en su versión digital de manera gratuita. Las revisiones y adiciones se publican de manera independiente.\n"}
{"url": "https://es.wikipedia.org/wiki/Amper%C3%ADmetro", "title": "Amperímetro", "summary": "Un amperímetro en términos generales, es un simple galvanómetro (instrumento para detectar pequeñas cantidades de corriente), con una resistencia en paralelo, llamada \"resistencia shunt\". El amperímetro se utiliza para medir la intensidad de las corrientes eléctricas. Disponiendo de una gama de resistencias shunt, se puede disponer de un amperímetro con varios rangos o intervalos de medición. Los amperímetros tienen una resistencia interna muy pequeña, por debajo de 1 ohmio, con la finalidad de que su presencia no disminuya la corriente a medir cuando se conecta a un circuito eléctrico.\nEl aparato descrito corresponde al diseño original, ya que en la actualidad los amperímetros utilizan un conversor analógico/digital para la medida de la caída de tensión en un resistor por el que circula la corriente a medir. La lectura del conversor es leída por un microprocesador que realiza los cálculos para presentar en un display numérico el valor de la corriente eléctrica circulante.\n"}
{"url": "https://es.wikipedia.org/wiki/Ampere_(desambiguaci%C3%B3n)", "title": "Ampere (desambiguación)", "summary": "El término Ampere, o Amperes, puede referirse a:\nAndré-Marie Ampère, matemático y físico francés;\nAmperio o Ampere, la unidad de medición de la corriente eléctrica del Sistema Internacional de Unidades;\nAmpere, banda estadounidense de screamo;\nAmpére (Paraná), municipio de Brasil;\nMuseo Ampère, museo francés dedicado a André-Marie Ampère;"}
{"url": "https://es.wikipedia.org/wiki/Carga_el%C3%A9ctrica", "title": "Carga eléctrica", "summary": "La carga eléctrica es una propiedad física intrínseca de algunas partículas subatómicas que se manifiesta mediante fuerzas de atracción y repulsión entre ellas a través de campos electromagnéticos.[1]​ La materia cargada eléctricamente es influida por los campos electromagnéticos, siendo, a su vez, generadora de ellos. La denominada interacción electromagnética entre carga y campo eléctrico es una de las cuatro interacciones fundamentales de la física. Desde el punto de vista del modelo normal la carga eléctrica es una medida de la capacidad que posee una partícula para intercambiar fotones.\nLa carga eléctrica es de naturaleza discreta, fenómeno demostrado experimentalmente por Robert Millikan. Por razones históricas, a los electrones se les asignó carga negativa: –1, también expresada –e. Los protones tienen carga positiva: +1 o +e. A los quarks se les asigna carga fraccionaria: ±1/3 o ±2/3, aunque no se los ha podido observar libres en la naturaleza.[2]​\n"}
{"url": "https://es.wikipedia.org/wiki/Carga_elemental", "title": "Carga eléctrica", "summary": "La carga eléctrica es una propiedad física intrínseca de algunas partículas subatómicas que se manifiesta mediante fuerzas de atracción y repulsión entre ellas a través de campos electromagnéticos.[1]​ La materia cargada eléctricamente es influida por los campos electromagnéticos, siendo, a su vez, generadora de ellos. La denominada interacción electromagnética entre carga y campo eléctrico es una de las cuatro interacciones fundamentales de la física. Desde el punto de vista del modelo normal la carga eléctrica es una medida de la capacidad que posee una partícula para intercambiar fotones.\nLa carga eléctrica es de naturaleza discreta, fenómeno demostrado experimentalmente por Robert Millikan. Por razones históricas, a los electrones se les asignó carga negativa: –1, también expresada –e. Los protones tienen carga positiva: +1 o +e. A los quarks se les asigna carga fraccionaria: ±1/3 o ±2/3, aunque no se los ha podido observar libres en la naturaleza.[2]​\n"}
{"url": "https://es.wikipedia.org/wiki/Conferencia_General_de_Pesas_y_Medidas", "title": "Conferencia General de Pesas y Medidas", "summary": "La Conferencia General de Pesas y Medidas (en francés: Conférence générale des poids et mesures, CGPM) es el órgano de decisión de la Oficina Internacional de Pesas y Medidas. Tiene a su cargo tomar decisiones en materia de metrología y, en particular, en lo que concierne al Sistema Internacional de Unidades. Fue creada por la Convención del Metro, en 1875.\nSe integra por los delegados de los Estados miembros de la Convención del Metro y los estados asociados, y se reúne una vez cada 4 años.[1]​ La primera conferencia tuvo lugar en 1889, y las cuatro últimas en 2007 (23.ª), 2011 (24.ª), 2014 (25.ª) y 2018 (26.ª). Las reuniones se llevan a cabo en las instalaciones de la Oficina Internacional de Pesas y Medidas ubicadas en la ciudad de Sèvres, un suburbio de París.\nPara realizar la conferencia los delegados se basan en los informes del Comité Internacional de Pesas y Medidas\nEn 1960, en la undécima CGPM, el sistema de medidas, primero conocido como Sistema métrico decimal y más tarde su ampliación, conocido como sistema MKS, fue llamado oficialmente Sistema Internacional de Unidades.\n"}
{"url": "https://es.wikipedia.org/wiki/Constante_de_Boltzmann", "title": "Constante de Boltzmann", "summary": "La constante de Boltzmann (k o kB) es la constante física que relaciona temperatura absoluta y energía.[1]​ Se llama así en honor del físico austriaco Ludwig Boltzmann, quien hizo importantes contribuciones a la teoría de la mecánica estadística, en cuyas ecuaciones fundamentales esta constante desempeña un papel central. Su valor es un número fijo sin incertidumbre (26° CGPM de noviembre de 2018, en vigor desde el 20 de mayo de 2019):[2]​[3]​\nk\n=\n1\n,\n380649\n×\n10\n−\n23\n{\\displaystyle k=1,380649\\times 10^{-23}}\n \nJ\n{\\displaystyle {\\rm {\\ J}}}\n/\n{\\displaystyle {}/{}}\n \nK\n{\\displaystyle {\\rm {\\ K}}}\nComo parte de la Redefinición de las unidades del SI en 2019, la constante de Boltzmann es una de las siete \"constantes definitorias\" que han recibido definiciones exactas. Se utilizan en diversas combinaciones para definir las siete unidades básicas del SI. La constante de Boltzmann se define exactamente como 1,380649-23J.K-1.[3]​\n"}
{"url": "https://es.wikipedia.org/wiki/Constante_de_Planck", "title": "Constante de Planck", "summary": "[\n]\nLa constante de Planck es una constante física que desempeña un papel central en la teoría de la mecánica cuántica y recibe su nombre de su descubridor, el físico y matemático alemán Max Planck, uno de los padres de dicha teoría. Denotada como \nh\n{\\displaystyle h}\n, es la constante que frecuentemente se define como el cuanto elemental de acción. Planck la denominaría precisamente «cuanto de acción» (en alemán, Wirkungsquantum), debido a que la cantidad denominada acción de un proceso físico (el producto de la energía implicada y el tiempo empleado) solo podía tomar valores discretos, es decir, múltiplos enteros de \nh\n{\\displaystyle h}\n.\nFue inicialmente propuesta como la constante de proporcionalidad entre la energía \nE\n{\\displaystyle E}\n de un fotón y la frecuencia \nf\n{\\displaystyle f}\n de su onda electromagnética asociada. \nE\n=\nh\nf\n{\\displaystyle E=hf\\,}\nDado que la frecuencia \nf\n{\\displaystyle f}\n, la longitud de onda \nλ\n{\\displaystyle \\lambda }\n, y la velocidad de la luz \nc\n{\\displaystyle c}\n cumplen \nλ\nf\n=\nc\n{\\displaystyle \\lambda f=c}\n se puede expresar como:\nE\n=\nh\nc\nλ\n{\\displaystyle E={\\frac {hc}{\\lambda }}\\,}\nOtra ecuación fundamental en la que interviene la constante de Planck es la que relaciona el momento lineal \np\n{\\displaystyle p}\n de una partícula con la longitud de onda de De Broglie λ de la misma:\nλ\n=\nh\np\n{\\displaystyle \\lambda ={\\frac {h}{p}}}\nEn aplicaciones donde la frecuencia viene expresada en términos de radianes por segundo o frecuencia angular, es útil incluir el factor \n1\n2\nπ\n{\\displaystyle {\\frac {1}{2\\pi }}}\n dentro de la constante de Planck. La constante resultante, «constante de Planck reducida» o «constante de Dirac», se expresa como ħ (\"h barra\"):\nℏ\n=\nh\n2\nπ\n{\\displaystyle \\hbar ={\\frac {h}{2\\pi }}}\nDe esta forma la energía de un fotón con frecuencia angular \nω\n{\\displaystyle \\omega }\n, donde \nω\n=\n2\nπ\nf\n{\\displaystyle \\omega =2\\pi f}\n, se podrá expresar como:\nE\n=\nℏ\nω\n{\\displaystyle E=\\hbar \\omega }\nPor otro lado, la constante de Planck reducida es el cuanto del momento angular en mecánica cuántica. Los valores que puede tomar el momento angular orbital, de spin o total, son múltiplos enteros o semienteros de la constante reducida. Así, si \nJ\n{\\displaystyle J\\,}\n es el momento angular total de un sistema con invariancia rotacional y \nJ\nz\n{\\displaystyle J_{z}\\,}\n es el momento angular del sistema medido sobre una dirección cualquiera, por ejemplo la del eje z, estas cantidades solo pueden tomar los valores:\nJ\n2\n=\nj\n(\nj\n+\n1\n)\nℏ\n2\nj\n=\n0\n,\n1\n/\n2\n,\n1\n,\n3\n/\n2\n,\n…\nJ\nz\n=\nm\nℏ\n,\nm\n=\n−\nj\n,\n−\nj\n+\n1\n,\n…\n,\nj\n{\\displaystyle {\\begin{matrix}J^{2}=j(j+1)\\hbar ^{2}&j=0,1/2,1,3/2,\\ldots \\\\J_{z}=m\\hbar ,\\qquad \\quad &m=-j,-j+1,\\ldots ,j\\end{matrix}}}\nUnicode reserva los códigos U+210E (h) para la constante de Planck y U+210F (h con barra) para la constante de Dirac.\n"}
{"url": "https://es.wikipedia.org/wiki/Constante_f%C3%ADsica", "title": "Constante física", "summary": "En ciencias se llama constante física al valor de una magnitud física que, fijado un sistema de unidades, permanece invariable en los procesos físicos a lo largo del tiempo. En contraste, una constante matemática representa un valor invariable que no está implicado directamente en ningún proceso físico.\nExisten muchas constantes físicas; algunas de las más conocidas son la constante reducida de Planck (\nℏ\n{\\displaystyle \\hbar }\n), la constante de gravitación (\nG\n{\\displaystyle G}\n), la velocidad de la luz (\nc\n{\\displaystyle c}\n), la permitividad en el vacío (\nϵ\n0\n{\\displaystyle \\epsilon _{0}}\n), la permeabilidad magnética en el vacío (\nμ\n0\n{\\displaystyle \\mu _{0}}\n) y la carga elemental (\ne\n{\\displaystyle e}\n). Todas estas, por ser tan fundamentales, son llamadas constantes universales.\nPor otro lado, desde 1937 Paul Dirac y otros científicos han especulado que el valor de las constantes físicas podría decrecer en proporción a la edad del Universo. Hasta la fecha ningún experimento ha indicado que esto sea así, aunque se ha logrado calcular las cotas máximas de esa hipotética variación de las constantes. Las cotas máximas de variación anual resultan, en todo caso, muy pequeñas, siendo de 10-5 para la estructura fina y 10-11 para la constante de gravitación. El tema sigue siendo motivo de controversia actualmente.\n"}
{"url": "https://es.wikipedia.org/wiki/Corriente_el%C3%A9ctrica", "title": "Corriente eléctrica", "summary": "[\n]\nLa corriente eléctrica es el flujo de carga eléctrica que recorre un material.[2]​ También se puede definir como un flujo de  partículas cargadas, como electrones o iones, que se mueven a través de un conductor eléctrico o un espacio. Se mide como la tasa neta de flujo de carga eléctrica a través de una superficie o en un volumen de control.[3]​: 2 [4]​: 622  Se debe al movimiento de las cargas (normalmente electrones) en el interior del mismo. Al caudal de corriente (cantidad de carga por unidad de tiempo)  se le denomina intensidad de corriente eléctrica (representada comúnmente con la letra I). En el Sistema Internacional de Unidades se expresa en culombios por segundo (C/s), unidad que se denomina amperio (A), en honor del físico francés André-Marie Ampère. Una corriente eléctrica, puesto que se trata de un movimiento de cargas, produce un campo magnético, un fenómeno que puede aprovecharse en el electroimán.\nEl instrumento usado para medir la intensidad de la corriente eléctrica es el galvanómetro que, calibrado en amperios, se llama amperímetro, colocado en serie con el conductor por el que circula la corriente que se desea medir.\n"}
{"url": "https://es.wikipedia.org/wiki/Culombio", "title": "Culombio", "summary": "6\n,\n241509\n×\n10\n18\n{\\displaystyle 6,241509\\times 10^{18}}\nEl culombio[1]​ o coulomb[2]​ (pronunciación en francés: /kulɔ̃/; símbolo: C) es una unidad derivada del sistema internacional para la medida de la magnitud física de cantidad de electricidad (carga eléctrica).[3]​[4]​\nNombrada en honor del físico francés Charles-Augustin de Coulomb.\nSe define como la cantidad de carga llevadas en un segundo por una corriente eléctrica de un amperio de intensidad. \n1\n \nC\n=\n1\n \nA\n⋅\ns\n{\\displaystyle 1\\ \\mathrm {C} =1\\ \\mathrm {A} \\cdot \\mathrm {s} }\nDesde la 26ª Conferencia General de Pesas y Medidas en el Sistema Internacional de Unidades de 2019[3]​ la carga eléctrica elemental se redefine como 1,602 176 634 × 10-19 C, sin incertidumbre, y el culombio y el amperio se definen en función de esta carga elemental.[5]​ Dado que la carga del electrón es de la misma magnitud que la del protón, pero negativa, se necesitan 6,241 509 074 460 763 × 1018 electrones para reunir un culombio de carga negativa.\nTambién puede expresarse en términos de capacidad (F, faradio) y tensión (V, voltio), según la relación:\n1\n \nC\n=\n1\n \nF\n⋅\nV\n{\\displaystyle 1\\ \\mathrm {C} =1\\ \\mathrm {F} \\cdot \\mathrm {V} }\nobtenida directamente de la definición de faradio.\n"}
{"url": "https://es.wikipedia.org/wiki/Electr%C3%B3lisis", "title": "Electrólisis", "summary": "La electrólisis o electrolisis es el proceso que separa los elementos de un compuesto por medio de la electricidad.[1]​ En ella ocurre la liberación de electrones por los aniones en el ánodo (una \noxidación) y la captura de electrones por los cationes en el cátodo (una reducción). Este proceso se lleva a cabo en una clase importante de celdas electroquímicas que se conocen como celdas electrolíticas, donde se usa una corriente eléctrica para activar una reacción no espontánea, como resultado, los dos elementos del agua (Hidrógeno y Oxígeno) se separan. La electrólisis se basa en los mismos principios en que se fundamentan los procesos que se realizan en las celdas galvánicas. \nUna celda galvánica convierte energía química en energía eléctrica, cuando una reacción con valor positivo de E (valor negativo de \nΔ\n{\\displaystyle \\Delta }\nG) procede hacia el equilibrio; una celda electrolítica convierte energía eléctrica en energía química cuando una corriente eléctrica impulsa una reacción con valor negativo de E (y valor positivo de \nΔ\n{\\displaystyle \\Delta }\nG) en dirección que se aleja del equilibrio. Así, los procesos que suceden en celdas galvánicas y electrolíticas son inversos entre sí. El proceso de usar una corriente eléctrica para producir un cambio se conoce como electrólisis.\n"}
{"url": "https://es.wikipedia.org/wiki/Electromagnetismo", "title": "Electromagnetismo", "summary": "El electromagnetismo es la rama de la física que estudia y unifica los fenómenos eléctricos y magnéticos en una sola teoría. El electromagnetismo describe la interacción de partículas cargadas con campos eléctricos y magnéticos. La interacción electromagnética es una de las cuatro fuerzas fundamentales del universo conocido. \nEl electromagnetismo abarca diversos fenómenos del mundo real, como por ejemplo la luz. La luz es un campo electromagnético oscilante que se irradia desde partículas cargadas aceleradas. Aparte de la gravedad, la mayoría de las fuerzas en la experiencia cotidiana son consecuencia de electromagnetismo.\nLos principios del electromagnetismo encuentran aplicaciones en diversas disciplinas afines, tales como las microondas, antenas, máquinas eléctricas, comunicaciones por satélite, bioelectromagnetismo, plasmas, investigación nuclear, la fibra óptica, la interferencia y la compatibilidad electromagnéticas, la conversión de energía electromecánica, la meteorología por radar, y la observación remota. Los dispositivos electromagnéticos incluyen transformadores, relés, radio/TV, teléfonos, motores eléctricos, líneas de transmisión, guías de onda y láseres.\nLos fundamentos de la teoría electromagnética fueron presentados por Michael Faraday y formulados por primera vez de modo completo por James Clerk Maxwell en 1865. La formulación consiste en cuatro ecuaciones diferenciales vectoriales que relacionan el campo eléctrico, el campo magnético y sus respectivas fuentes materiales (corriente eléctrica, polarización eléctrica y polarización magnética), conocidas como ecuaciones de Maxwell, lo que ha sido considerada como la «segunda gran unificación de la física», siendo la primera realizada por Isaac Newton.\nEl estudio de los campos electromagnéticos se puede dividir en electrostática —el estudio de las interacciones entre cargas en reposo— y la electrodinámica —el estudio de las interacciones entre cargas en movimiento y la radiación—. La teoría clásica del electromagnetismo se basa en la fuerza de Lorentz y en las ecuaciones de Maxwell. Muchas propiedades ópticas y físicas de la materia también son explicados por la teoría electromagnético.\nEl electromagnetismo es una teoría de campos; es decir, las explicaciones y predicciones que provee se basan en magnitudes físicas vectoriales o tensoriales dependientes de la posición en el espacio y del tiempo. El electromagnetismo describe los fenómenos físicos macroscópicos en los cuales intervienen cargas eléctricas en reposo y en movimiento, usando para ello campos eléctricos y magnéticos y sus efectos sobre las sustancias sólidas, líquidas y gaseosas. Por ser una teoría macroscópica, es decir, aplicable a un número muy grande de partículas y a distancias grandes respecto de las dimensiones de estas, el electromagnetismo no describe los fenómenos atómicos y moleculares. La electrodinámica cuántica proporciona la descripción cuántica de esta interacción, que puede ser unificada con la interacción nuclear débil según el modelo electrodébil.\n"}
{"url": "https://es.wikipedia.org/wiki/Electrotecnia", "title": "Ingeniería eléctrica", "summary": "La ingeniería eléctrica es el campo de la ingeniería que se ocupa del estudio y la aplicación de la electricidad, electromagnetismo, electromecánica y la electrónica a sistemas eléctricos de potencia. Aplica conocimientos de ciencias como la física y las matemáticas, se ocupa de la generación, transmisión, distribución, utilización de energía eléctrica y los aparatos eléctricos conectados a un sistema  eléctrico de potencia, un sistema eléctrico de potencia es un conjunto de componentes eléctricos instalados para suministrar, transferir y usar energía eléctrica. Un ejemplo de un sistema eléctrico de potencia es la red eléctrica que proporciona energía a un área extendida. Aunque gran parte del campo se ocupa de los problemas de la alimentación de CA trifásica, el estándar para la transmisión y distribución de energía a gran escala, una fracción significativa del campo se ocupa de la conversión entre alimentación de CA y CC, diseño y desarrollo de aparatos de un sistema eléctrico de potencia como las máquinas eléctricas, disyuntores, condensadores, relés de protección, etc., y al diseño de sistemas eléctricos de potencia especializados como los utilizados en aviones, sistemas ferroviarios eléctricos, transatlánticos, submarinos, automóviles,etc. \nDada su evolución en el tiempo, este campo ahora abarca una serie de disciplinas que incluyen la electrotecnia, la electrónica, los sistemas de control y las telecomunicaciones.\n"}
{"url": "https://es.wikipedia.org/wiki/Experimento", "title": "Experimento", "summary": "Un experimento es un procedimiento llevado a cabo para apoyar, refutar, o validar una hipótesis. Los experimentos proporcionan idea sobre causa-y-efecto por la demostración del resultado, que ocurre cuándo un factor particular es manipulado. Los experimentos varían mucho en objetivo y escala, pero se apoyan en la repetición de procedimientos y análisis lógico y estadístico de los resultados. Allí también existen estudios experimentales naturales.\nUn niño puede realizar experimentos básicos para comprender el efecto de la gravedad, mientras que los equipos de científicos pueden tomar años de investigación sistemática para avanzar en su comprensión de un fenómeno. Los experimentos y otros tipos de actividades prácticas son muy importantes para el aprendizaje de los alumnos en el aula de ciencias. Los experimentos pueden elevar los puntajes de las evaluaciones y ayudar a un estudiante a involucrarse más e interesarse en el material que está aprendiendo, especialmente cuando se usa con frecuencia.[1]​ Los experimentos pueden variar desde comparación personal e informal natural (por ejemplo, probar una variedad de chocolates para encontrar uno favorito), hasta aquellos que son altamente controlados (por ejemplo, pruebas que requieren aparatos complejos que sean supervisados por muchos científicos que esperan descubrir información sobre partículas subatómicas). Los usos de los experimentos varían considerablemente entre las ciencias naturales y humanas. \nAquellos experimentos que típicamente incluyen controles, diseñados para reducir los efectos de variables distintas de la variable independiente única. Esto aumenta la fiabilidad de los resultados, a menudo a través de una comparación entre las mediciones de control y las otras mediciones. Los controles científicos son parte del método científico . Es ideal que, todas las variables en un experimento estén controladas (tomadas en cuenta por las mediciones de control) y ninguna está fuera de control. En tal experimento, si todos los controles funcionan como se espera, es posible concluir que el experimento funciona según lo previsto, y que los resultados se deben al efecto de la variable probada.\n"}
{"url": "https://es.wikipedia.org/wiki/Fuerza", "title": "Fuerza", "summary": "En física clásica, la fuerza (abreviatura F) es un fenómeno que modifica el movimiento de un cuerpo (lo acelera, frena, cambia el sentido, etc.) o bien lo deforma. Las fuerzas pueden representarse mediante vectores, ya que poseen magnitud y dirección.  No debe confundirse el concepto de fuerza con el esfuerzo o la energía. \nEn el Sistema Internacional de Unidades, la unidad de medida de la fuerza es el newton que se representa con el símbolo N, en reconocimiento a Isaac Newton por su aporte a la física, especialmente a la mecánica clásica. El newton es una unidad derivada del Sistema Internacional de Unidades que se define como la fuerza necesaria para proporcionar una aceleración de 1m/s² a un objeto de 1kg de masa.\nLos conceptos relacionados con la fuerza incluyen: empuje, que aumenta la velocidad de un objeto; arrastrar, que disminuye la velocidad de un objeto; y par motor, que produce cambios en la velocidad de rotación de un objeto. En un cuerpo extendido, cada parte suele aplicar fuerzas sobre las partes adyacentes; la distribución de dichas fuerzas a través del cuerpo es la tensión mecánica interna. Tales tensiones mecánicas internas no causan ninguna aceleración de ese cuerpo, ya que las fuerzas se equilibran entre sí. La presión, la distribución de muchas fuerzas pequeñas aplicadas sobre un área de un cuerpo, es un tipo de tensión simple que, si se desequilibra, puede hacer que el cuerpo se acelere. El estrés suele provocar la deformación de los materiales sólidos, o el flujo en los fluidos.\n"}
{"url": "https://es.wikipedia.org/wiki/Fuerza_de_Lorentz", "title": "Fuerza de Lorentz", "summary": "En física (específicamente en electromagnetismo), la fuerza de Lorentz es la fuerza ejercida por el campo electromagnético que recibe una partícula cargada o una corriente eléctrica.\n"}
{"url": "https://es.wikipedia.org/wiki/Galvan%C3%B3metro", "title": "Galvanómetro", "summary": "Busca fuentes: «Galvanómetro» – noticias · libros · académico · imágenes\nHilos de entrada de corriente a medir\nResorte de retroceso\nUn galvanómetro es un instrumento que se usa para detectar y medir la corriente eléctrica.[1]​ Se trata de un transductor analógico electromecánico que produce una deformación de rotación en una aguja o puntero en respuesta a la corriente eléctrica que fluye a través de su bobina.[2]​ Este término se ha ampliado para incluir los usos del mismo dispositivo en equipos de grabación, posicionamiento y servomecanismos.\nEs capaz de detectar la presencia de pequeñas corrientes en un circuito cerrado, y puede ser adaptado, mediante su calibración, para medir su magnitud. Su principio de operación (bobina móvil e imán fijo) se conoce como mecanismo de D'Arsonval,[2]​ en honor al científico que lo desarrolló. Este consiste en una bobina normalmente rectangular, por la cual circula la corriente que se quiere medir. Esta bobina está suspendida dentro del campo magnético asociado a un imán permanente, según su eje vertical, de forma tal que el ángulo de giro de dicha bobina es proporcional a la corriente que la atraviesa.[3]​ La inmensa mayoría de los instrumentos indicadores de aguja empleados en instrumentos analógicos se basan en el principio de operación explicado, utilizándose una bobina suspendida dentro del campo asociado a un imán permanente. Los métodos de suspensión empleados varían, lo cual determina la sensibilidad del instrumento. Así, cuando la suspensión se logra mediante una cinta metálica tensa, puede obtenerse deflexión a plena escala con solo 2 μA, pero el instrumento resulta extremadamente frágil, mientras que el sistema de \"joyas y pivotes\", semejante al empleado en relojería, permite obtener un instrumento más robusto pero menos sensible que el anterior, en el que típicamente se obtiene deflexión a plena escala, con 50 μA.\n"}
{"url": "https://es.wikipedia.org/wiki/Impedancia_caracter%C3%ADstica", "title": "Impedancia característica", "summary": "Busca fuentes: «Impedancia característica» – noticias · libros · académico · imágenes\nSe denomina impedancia característica de una línea de transmisión a la relación existente entre la diferencia de potencial aplicada y la corriente absorbida por la línea en el caso hipotético de que esta tenga una longitud infinita, o cuando aún siendo finita no existen reflexiones. \nEn el caso de líneas reales, se cumple que su impedancia permanece inalterable cuando son cargadas con elementos, generadores o receptores, cuya impedancia es igual a la impedancia característica.\nLa impedancia característica es independiente de la longitud de la línea. Para una línea sin pérdidas, esta será asimismo independiente de la frecuencia de la tensión aplicada, por lo que esta aparecerá como una carga resistiva y no se producirán reflexiones  por desadaptación de impedancias, cuando se conecte a ella un generador con impedancia igual a su impedancia característica.\nDe la misma forma, en el otro extremo de la línea esta aparecerá como un generador con impedancia interna resistiva y la transferencia de energía será máxima cuando se le conecte un receptor de su misma impedancia característica.\nNo se oculta, por tanto, la importancia de que todos los elementos que componen un sistema de transmisión presenten en las partes conectadas a la línea impedancias idénticas a la impedancia característica de esta, para que no existan ondas reflejadas y el rendimiento del conjunto sea máximo.\nLa impedancia característica de una línea de transmisión depende de los denominados parámetros primarios de ella misma que son: resistencia, capacitancia, inductancia y conductancia (inversa de la resistencia de aislamiento entre los conductores que forman la línea).\nLa fórmula que relaciona los anteriores parámetros y que determina la impedancia característica de la línea es:\nZ\n0\n=\nR\n+\nj\n⋅\nL\nω\nG\n+\nj\n⋅\nC\nω\n{\\displaystyle {Z_{0}}={\\sqrt {\\frac {R+j\\cdot L\\omega }{G+j\\cdot C\\omega }}}}\ndonde:"}
{"url": "https://es.wikipedia.org/wiki/Intensidad_de_corriente_el%C3%A9ctrica", "title": "Corriente eléctrica", "summary": "[\n]\nLa corriente eléctrica es el flujo de carga eléctrica que recorre un material.[2]​ También se puede definir como un flujo de  partículas cargadas, como electrones o iones, que se mueven a través de un conductor eléctrico o un espacio. Se mide como la tasa neta de flujo de carga eléctrica a través de una superficie o en un volumen de control.[3]​: 2 [4]​: 622  Se debe al movimiento de las cargas (normalmente electrones) en el interior del mismo. Al caudal de corriente (cantidad de carga por unidad de tiempo)  se le denomina intensidad de corriente eléctrica (representada comúnmente con la letra I). En el Sistema Internacional de Unidades se expresa en culombios por segundo (C/s), unidad que se denomina amperio (A), en honor del físico francés André-Marie Ampère. Una corriente eléctrica, puesto que se trata de un movimiento de cargas, produce un campo magnético, un fenómeno que puede aprovecharse en el electroimán.\nEl instrumento usado para medir la intensidad de la corriente eléctrica es el galvanómetro que, calibrado en amperios, se llama amperímetro, colocado en serie con el conductor por el que circula la corriente que se desea medir.\n"}
{"url": "https://es.wikipedia.org/wiki/Ley_de_Ohm", "title": "Ley de Ohm", "summary": "La ley de Ohm,  postulada por el físico y matemático alemán Georg Simon Ohm, es una ley básica para entender los fundamentos principales de los circuitos eléctricos. Establece que la diferencia de potencial \nV\n{\\displaystyle V}\n que aplicamos entre los extremos de un conductor determinado es directamente proporcional a la intensidad de la corriente \nI\n{\\displaystyle I}\n que circula por el citado conductor. Ohm completó la ley introduciendo la noción de resistencia eléctrica \nR\n{\\displaystyle R}\n; que es el factor de proporcionalidad que aparece en la relación entre \nV\n{\\displaystyle V}\n e \nI\n{\\displaystyle I}\n:\nV\n=\nR\n⋅\nI\n{\\displaystyle V=R\\cdot I\\,}\nLa fórmula anterior se conoce como fórmula general de la ley de Ohm,[1]​[2]​ y en la misma, \nV\n{\\displaystyle V}\n corresponde a la diferencia de potencial, \nR\n{\\displaystyle R}\n a la resistencia e \nI\n{\\displaystyle I}\n a la intensidad de la corriente. Las unidades de esas tres magnitudes en el sistema internacional de unidades son, respectivamente, voltios (V), ohmios (Ω) y amperios (A).\nEn física, el término ley de Ohm se usa para referirse a varias generalizaciones de la ley originalmente formulada por Ohm. El ejemplo más simple es:\nJ\n=\nσ\nE\n,\n{\\displaystyle \\mathbf {J} =\\sigma \\mathbf {E} ,}\ndonde J es la densidad de corriente en una localización dada en el material resistivo, E es el campo eléctrico en esa localización, y σ (sigma) es un parámetro dependiente del material llamado conductividad.  Esta reformulación de la ley de Ohm se debe a Gustav Kirchhoff.[3]​\n"}
{"url": "https://es.wikipedia.org/wiki/Magnitud_f%C3%ADsica", "title": "Magnitud física", "summary": "Una magnitud física (cantidad física o propiedad física) es una cantidad medible de un sistema físico a la que se le pueden asignar distintos valores como resultado de una medición o una relación de medidas. Las magnitudes físicas se miden usando un patrón que tenga bien definida esa magnitud, y tomando como unidad la cantidad de esa propiedad que posea el objeto patrón. Por ejemplo, se considera que el patrón principal de longitud es el metro en el Sistema Internacional de Unidades.\nExisten magnitudes básicas y derivadas, que constituyen ejemplos de magnitudes físicas: la masa, la longitud, el tiempo, la carga eléctrica, la densidad, la temperatura, la velocidad, la aceleración y la energía. En términos generales, es toda propiedad de los cuerpos o sistemas que puede ser medida. De lo dicho se desprende la importancia fundamental del instrumento de medición en la definición de la magnitud.[1]​\nLa Oficina Internacional de Pesas y Medidas, por medio del Vocabulario Internacional de Metrología (International Vocabulary of Metrology, VIM), define a la magnitud como un atributo de un fenómeno, un cuerpo o sustancia que puede ser distinguido cualitativamente y determinado cuantitativamente.[2]​\nA diferencia de las unidades empleadas para expresar su valor, las magnitudes físicas se expresan en cursiva: así, por ejemplo, la «masa» se indica con m, y «una masa de 3 kilogramos» la expresaremos como m = 3 kg.\n"}
{"url": "https://es.wikipedia.org/wiki/May%C3%BAscula", "title": "Mayúscula", "summary": "En diversos alfabetos, las letras mayúsculas son letras que tienen mayor tamaño y por lo general distinta forma que las minúsculas, con las que contrastan. En el caso del alfabeto latino, del latín original solo se conserva ese conjunto de letras, que ―cuando posteriormente se desarrollaron las minúsculas actuales― se convertirán en las mayúsculas.\n"}
{"url": "https://es.wikipedia.org/wiki/Min%C3%BAscula", "title": "Minúscula", "summary": "En diversos alfabetos, la minúscula es la grafía que, por oposición a la mayúscula, tiene menor tamaño y generalmente forma distinta. Es la grafía no marcada, de uso general, mientras que la mayúscula tiene usos especializados concretos (nombres propios, títulos, etcétera).\nEl nombre deriva del latín minusculus: ‘menor’, con sufijo diminutivo.[1]​ \nApareció a finales del siglo III, en escrituras de este tipo en papiros de la administración imperial romana.\nSe utiliza en los alfabetos europeos griego, latín, cirílico y armenio. Por ejemplo, la letra de figura y tamaño a es minúscula, y la letra de figura y tamaño A es mayúscula.\nOriginalmente las letras de los alfabetos se escribían en mayúsculas, con espaciado bien definido entre los límites superior e inferior. Cuando se escribe rápidamente a mano (manuscrito, con pluma, lápiz u otro medio) tienden a redondearse y a ser mucho más simples, como las unciales.\nDesde las unciales, las letras minúsculas se desarrollaron por vez primera, así como las minúsculas medio unciales y las cursivas, que ya no quedan ligadas entre dos líneas.[2]​\nLas cursivas a su vez constituyen la base de la escritura minúscula carolingia ―desarrollada por Alcuino para su uso en la corte de Carlomagno―, que rápidamente se extendió por toda Europa. En este continente, por vez primera, llegó a ser común el uso simultáneo de mayúsculas y minúsculas en un texto único.\nEl término minúscula evolucionó después del desarrollo de los tipos móviles, introducidos por Johannes Gutenberg. Las minúsculas contenían las versiones pequeñas de las letras y sus ligaduras, ya que estos caracteres se utilizaban con mayor frecuencia.\n"}
{"url": "https://es.wikipedia.org/wiki/N%C3%BAmero_de_Avogadro", "title": "Constante de Avogadro", "summary": "[\n]\nConstante de Avogadro\nConstante de Boltzmann\nConstante de los gases\nConcentración másica\nConcentración molar\nMolalidad\nMasa\nVolumen\nDensidad\nFracción molar\nFracción másica\nCantidad de sustancia\nMasa molar\nMasa atómica\nNúmero de partículas\nPresión\nTemperatura termodinámica\nVolumen molar\nVolumen específico\nLey de Charles\nLey de Boyle\nLey de Gay-Lussac\nLey de los gases combinados\nLey de Avogadro\nLey de los gases ideales\nDesde la revisión efectuada en la 26.ª Conferencia General de Pesas y Medidas (CGPM) celebrada en el año 2018 la constante de Avogadro (símbolos: L, NA) tiene un valor exacto definido como 6,022 140 76 ×1023 mol−1. El número de Avogadro (símbolo: N0) equivale a la cantidad de 6,022 140 76 ×1023 expresada en notación científica, esto es 602 214 076 000 000 000 000 000 (seiscientos dos mil doscientos catorce trillones setenta y seis mil billones de unidades, una cifra mucho mayor que el número de granos de arena en todas las playas de la Tierra).\nLa constante de Avogadro es el factor de proporcionalidad entre el número de partículas o entidades elementales y la cantidad de sustancia. Al dividir la cantidad de entidades elementales, cualesquiera que sean, entre la constante de Avogadro se obtiene la cantidad de sustancia. Así, por ejemplo:\n1\n \nm\no\nl\n=\n6\n,\n02214076\n×\n10\n23\nN\nA\n{\\displaystyle 1\\ \\mathrm {mol} ={\\frac {6,02214076\\times 10^{23}}{N_{A}}}}\nDefiniciones anteriores de cantidad química involucraron el número de Avogadro, un término histórico íntimamente relacionado con la constante de Avogadro pero definida de otra forma: inicialmente definido por Jean Baptiste Perrin como el número de átomos en un mol de hidrógeno. Luego fue redefinido como el número de átomos en 12 gramos del isótopo carbono-12 y posteriormente generalizado para relacionar cantidades de sustancias a sus pesos moleculares. Por ejemplo, de forma aproximada, 1 gramo de hidrógeno, que tiene un número másico de 1, contiene 6,022 × 1023 átomos de hidrógeno, es decir, más de seiscientos mil trillones de átomos. De igual manera, 12 gramos de carbono-12 (número másico 12) contienen el mismo número de átomos, 6,02214 × 1023. El número de Avogadro es una magnitud adimensional y tiene el valor numérico de la constante de Avogadro, que posee unidades de medida.[2]​[3]​[4]​[5]​[6]​\nLa constante de Avogadro es fundamental para entender la composición de las moléculas y sus interacciones y combinaciones. Por ejemplo, ya que un átomo de oxígeno de 16 uma se combinará con dos átomos de hidrógeno de 1 uma por átomo para crear una molécula de agua (H2O) de 18 uma, de igual forma un mol de oxígeno (6,022 × 1023 átomos de O) de 16 gramos se combinará con dos moles de hidrógeno (2 × 6,022 × 1023 átomos de H) de 1 gramo cada uno para crear un mol de H2O (6,022 × 1023 moléculas de H2O) de 18 gramos de peso o 18 mililitros de volumen.\n"}
