{"url": "https://es.wikipedia.org/wiki/Pantalla", "title": "Pantalla", "summary": "Pantalla puede referirse a:", "sections": [{"name": "Imagen", "text": "Pantalla de ordenador o monitor de computadora; dispositivo de salida que representa visualmente la información.\nPantalla plana, utilizada en ordenadores y televisores.\nPantalla ancha, formato propio de salas de proyección cinematográfica.\nPantalla táctil, pantalla que permite la entrada de datos mediante contacto táctil sobre su superficie.\nPantalla automultiescópica, próximo a las pantallas 3D.\nPantalla 3D, pantalla que reproduce la visión estereoscópica.\nPantalla transparente de realidad aumentada, mezcla sensación de volumen («3D») con objetos reales.\nPor tecnología de visualización\nMonitor monocromo o pantalla de fósforo; uno de los primeros tipos de pantalla de ordenador.\nPantalla moduladora interferométrica, utilizada, por ejemplo, en teléfonos móviles.\nPantalla de plasma, dispositivo generador de imágenes basado en la descarga de plasma.\nPantalla de cristal líquido o LCD (del inglés Liquid Crystal Display); pantalla delgada y plana formada por un número de píxeles colocados delante de una fuente de luz.\nPantalla LED, pantalla electrónica con tecnología de ledes.\nPantalla de proyección, superficie utilizada para proyectar imágenes.\nPantalla inflable, tipo de pantalla de proyección.\nPantalla azul de la muerte, pantalla de error en varios sistemas operativos de Microsoft.\nPantalla roja de la muerte, pantalla de error en varios sistemas operativos de Microsoft.\nPantalla de enfoque, material traslúcido plano de una cámara que permite al usuario previsualizar la imagen enmarcada en un visor\nProtector de pantalla, programa de ordenador diseñado para conservar la calidad del monitor del PC.", "subsections": []}, {"name": "Sonido", "text": "Pantalla acústica, altavoz de tipo panel.\nPantalla infinita, sistema de colocación para altavoz dinámico muy poco utilizado.", "subsections": []}, {"name": "Ingeniería civil", "text": "Pantalla, tipo de estructura de contención de tierras.\nPantalla de paneles prefabricados de hormigón, subtipo de la anterior.\nPantalla de pilotes, subtipo de la primera.", "subsections": []}, {"name": "Otros artículos en Wikipedia", "text": "Pantalla abierta, desaparecido programa de televisión chileno emitido por Canal 13.\nPantalla del director de juego, desplegable de cartulina utilizado en los juegos de rol.", "subsections": []}, {"name": "Enlaces externos", "text": "El Diccionario de la Real Academia Española tiene una definición para pantalla.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Pin_(electr%C3%B3nica)", "title": "Pin (electrónica)", "summary": "En electrónica, se denomina pin, palabra inglesa que significa «clavija»,[1]​ a la terminal o patilla de cada uno de los contactos metálicos de un conector o de un componente fabricado de un material conductor de la electricidad. Estos se utilizan para conectar componentes sin necesidad de soldar algo, de esta manera se logra transferir electricidad e información.\nPara determinar la misión de cada uno de los pines de un dispositivo, se deberán consultar sus respectivas hojas de datos o datasheet.", "sections": [{"name": "Referencias", "text": "↑ «Pocket Oxford Spanish Dictionary». ", "subsections": []}, {"name": "Véase también", "text": "Enchufe\nPinout", "subsections": []}, {"name": "Enlaces externos", "text": "Base de datos de pines Página con información acerca de los pines más utilizados.\nInformación sobre conectores y pines Página con una presentación de los pines y conectores más utilizados.\nBase de datos de pines Pines en español\nTodos los pines (all pinouts) Web de contenido libre basada en una recopilación de todos los pines que conocemos.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Placa_madre", "title": "Placa base", "summary": "Busca fuentes: «Placa base» – noticias · libros · académico · imágenes\nAsRockASUSBiostarGigabyte TechnologyIntel CorporationLenovoMSI\nXTAT, Baby-AT, ATX, microATX, FlexATX, MiniATXITX, Mini-ITX, Nano-ITX, Pico-ITXBTX, Micro BTX, Pico BTX, Regular BTXDTX, Mini DTX, Full DTX\nLa placa base, también conocida como tarjeta madre, placa madre o placa principal (motherboard o mainboard en inglés), es una tarjeta de circuito impreso a la que se conectan los componentes que constituyen la computadora. En muchos lugares de habla hispana se usa la palabra inglesa con el artículo en femenino.[1]​[2]​\nEs una parte fundamental para montar cualquier computadora personal de  escritorio o portátil o algún dispositivo. Tiene instalados una serie de circuitos integrados, entre los que se encuentra el circuito integrado auxiliar (chipset), que sirve como centro de conexión entre el microprocesador (CPU), la memoria de acceso aleatorio (RAM), las ranuras de expansión y otros dispositivos.\nEstá instalada dentro de una carcasa o gabinete que por lo general está hecha de chapa y tiene un panel para conectar dispositivos externos y muchos conectores internos y zócalos para instalar componentes internos.\nLa placa base, además incluye un firmware llamado BIOS, que le permite realizar las funcionalidades básicas, como pruebas de los dispositivos, vídeo y manejo del teclado, reconocimiento de dispositivos y carga del sistema operativo.", "sections": [{"name": "Componentes de la placa base", "text": "Una placa base típica admite los siguientes componentes:\nConectores de alimentación de energía eléctrica.\nZócalo de CPU (monoprocesador) o zócalos de CPU (multiprocesador).\nRanuras de RAM.\nChipset.", "subsections": [{"name": "Conectores de alimentación", "text": "Véase también:\nPor uno o varios de estos conectores de alimentación, una alimentación eléctrica proporciona a la placa base los diferentes voltajes e intensidades necesarios para su funcionamiento."}, {"name": "Puertos de CPU", "text": "Artículo principal:\nEl zócalo (socket) de CPU es un receptáculo que encastra el microprocesador y lo conecta con el resto de componentes a través del bus frontal de la placa base.\nSi la placa base dispone de un único zócalo para microprocesador, se denomina monoprocesador. En cambio, si dispone de dos o más zócalos, se denomina placa multiprocesador."}, {"name": "Ranuras de RAM", "text": "Las placas bases constan de ranuras (slots) de memoria de acceso aleatorio, su número es de 2 a 6 ranuras en una misma placa base común.\nEn ellas se insertan dichas memorias del tipo conveniente dependiendo de la velocidad, capacidad y fabricante requeridos según la compatibilidad de cada placa base y la CPU."}, {"name": "Chipset", "text": "El chipset es una serie o conjunto de circuitos electrónicos, que gestionan las transferencias de datos entre los diferentes componentes de la computadora (procesador, memoria, tarjeta gráfica, unidad de almacenamiento secundario, etcétera).\nEl chipset, generalmente se divide en dos secciones:\nPuente norte (northbridge): gestiona la interconexión entre el microprocesador, la memoria RAM y la unidad de procesamiento gráfico.\nPuente sur (southbridge): gestiona la interconexión entre los periféricos y los dispositivos de almacenamiento, como los discos duros o las unidades de disco óptico.\nLas nuevas líneas de procesadores de escritorio tienden a integrar el propio controlador de memoria dentro del procesador."}, {"name": "Otros componentes importantes", "text": "El reloj: regula la velocidad de ejecución de las instrucciones del microprocesador y de los periféricos internos.\nLa CMOS: una pequeña memoria que preserva cierta información importante (como la configuración del equipo, fecha y hora), mientras el equipo no está alimentado por electricidad.\nLa pila de la CMOS: proporciona la electricidad necesaria para operar el circuito constantemente y que este último no se apague perdiendo la serie de configuraciones guardadas, como la fecha, hora, secuencia de arranque...\nLa BIOS: un programa registrado en una memoria no volátil (antiguamente en memorias ROM, pero desde hace tiempo se emplean memorias flash). Este programa es específico de la placa base y se encarga de la interfaz de bajo nivel entre el microprocesador y algunos periféricos. Recupera, y después ejecuta, las instrucciones del registro de arranque principal (Master Boot Record, MBR), o registradas en un disco duro o un dispositivo de estado sólido, cuando arranca el sistema operativo.\nActualmente, las computadoras modernas sustituyen el MBR por la tabla de particiones GUID (GPT) y el BIOS por Extensible Firmware Interface (EFI).\nEl bus frontal o bus delantero (front-side bus o FSB): también llamado bus interno, conecta el microprocesador al chipset. Está cayendo en desuso frente a HyperTransport y Quickpath.\nEl bus de memoria conecta el chipset a la memoria temporal.\nEl bus de expansión (también llamado bus E/S): une el microprocesador a los conectores de entrada/salida y a las ranuras de expansión.\nLos conectores de entrada/salida que cumplen normalmente con la norma PC 99; estos conectores incluyen:\nLos puertos serie, para conectar dispositivos antiguos.\nLos puertos paralelos, para la conexión de impresoras antiguas.\nLos puertos PS/2 para conectar teclado y ratón; estas interfaces tienden a ser sustituidas por USB.\nLos puertos USB (en inglés Universal Serial Bus), por ejemplo, para conectar diferentes periféricos, como por ejemplo: mouse, teclado, memoria USB, teléfonos inteligentes, impresoras.\nLos conectores RJ-45, para conectarse a una red informática.\nLos conectores VGA, DVI, HDMI o DisplayPort para la conexión del monitor de computadora o proyector de vídeo.\nLos conectores IDE o Serial ATA, para conectar dispositivos de almacenamiento, tales como discos duros (HDD), dispositivos de estado sólido (SSD) y unidades de disco óptico.\nLos conectores jacks de audio, para conectar dispositivos de audio, por ejemplo: altavoces y auriculares (código de color: verde), y micrófonos (código de color: rosado).\nLas ranuras de expansión: se trata de receptáculos (slots) que pueden acoger placas o tarjetas de expansión (estas tarjetas se utilizan para agregar características o aumentar el rendimiento de la computadora; por ejemplo, una tarjeta gráfica se puede añadir para mejorar el rendimiento 3D). Estos puertos pueden ser puertos:\nISA (Industry Standard Architecture) interfaz antigua,\nPCI (Peripheral Component Interconnect),\nAGP (Accelerated Graphics Port) y,\nPCIe o PCI-Express, son los más recientes.\nCon la evolución de las computadoras, más y más características se han integrado en la placa base, tales como circuitos electrónicos para la gestión del vídeo, de sonido o de redes, evitando así la adición de tarjetas de expansión:\ninterfaz gráfica integrada o unidad de procesamiento gráfico (GPU, Graphics Processing Unit, o IGP, Integrated Graphic Processor);\ninterfaz integrada de audio o sonido;\ninterfaz integrada Ethernet o puertos de red integrados ((10/100 Mbit/s)/(1 Gbit/s)).\nEn la placa también existen distintos conjuntos de pines, llamados jumpers o puentes, que sirven para configurar otros dispositivos:\nJMDM1: Sirve para conectar un módem por el cual se puede encender el sistema cuando este recibe una señal.\nJIR2: Este conector permite conectar módulos de infrarrojos IrDA, teniendo que configurar la BIOS.\nJBAT1: Se utiliza para poder borrar todas las configuraciones que como usuario podemos modificar y restablecer las configuraciones que vienen de fábrica.\nJP20: Permite conectar audio en el panel frontal.\nJFP1 Y JFP2: Se utiliza para la conexión de los interruptores del panel frontal y los ledes.\nJUSB1 Y JUSB3: Es para conectar puertos USB del panel frontal."}, {"name": "Tipos de bus", "text": "Los buses son espacios físicos que permiten el transporte de información y energía entre dos puntos de la computadora.\nLos buses generales son cinco:\nBus de datos\nLos buses de datos son las líneas de comunicación por donde circulan los datos externos e internos del microprocesador.\nBus de dirección\nEl bus de dirección es la línea de comunicación por donde viaja la información específica sobre la localización de la dirección de memoria del dato o dispositivo al que se hace referencia.\nBus de control\nEl bus de control es la línea de comunicación por donde se controla el intercambio de información con un módulo de la unidad central y los periféricos.\nBus de expansión\nLos buses de expansión son el conjunto de líneas de comunicación encargado de llevar el bus de datos, el bus de dirección y el de control a la tarjeta de interfaz (entrada, salida) que se agrega a la placa principal.\nBus del sistema\nTodos los componentes de la placa base se vinculan a través del bus del sistema, mediante distintos tipos de datos del microprocesador y de la memoria principal, que también involucra a la memoria caché de nivel 2. La velocidad de transferencia del bus de sistema está determinada por la frecuencia del bus y el ancho."}]}, {"name": "Formatos de placa base", "text": "Las placas base necesitan tener muchas dimensiones compatibles con las cajas que las contienen, de manera que desde los primeros computadores personales se han establecido características mecánicas, llamadas factor de forma. Definen la distribución de diversos componentes y las dimensiones físicas, como por ejemplo el largo y ancho de la tarjeta, la posición de los agujeros para los tornillos de sujeción y las características de los conectores.\nCon los años, varias normas se fueron imponiendo.", "subsections": [{"name": "XT", "text": "1983: XT (sigla en inglés de eXtended Technology 'tecnología extendida') es el formato de la placa base de la computadora IBM PC XT (modelo 5160), lanzado en 1983. En este factor de forma se definió un tamaño exactamente igual al de una hoja A4 y un único conector externo para el teclado."}, {"name": "AT", "text": "1984: AT (Advanced Technology 'tecnología avanzada') es uno de los formatos más grandes de toda la historia de la PC (305 × 279 × 330 mm), definió un conector de potencia formado por dos partes. Fue usado de manera extensa de 1985 a 1995.\nAT: 305 × 305 mm (IBM)\nBaby-AT: 216 × 330 mm"}, {"name": "ATX", "text": "1995: ATX (Advanced Technology eXtended 'tecnología avanzada extendida') utiliza las conexiones exteriores en forma de un panel de E/S y definió un conector de veinticuatro pines para la energía. Se usa en la actualidad en forma de algunas variantes, que incluyen conectores de energía extra o reducciones de tamaño.\nATX: 305 × 244 mm (Intel)\nMicroATX: 244 × 244 mm\nFlexATX: 229 × 191 mm\nMiniATX: 284 × 208 mm"}, {"name": "ITX", "text": "2001: ITX (Information Technology eXtended 'tecnología de información extendida'), con rasgos procedentes de las especificaciones microATX y FlexATX de Intel, el diseño de VIA se centra en la integración en placa base del mayor número posible de componentes, además de la inclusión del hardware gráfico en el propio chipset del equipo, siendo innecesaria la instalación de una tarjeta gráfica en la ranura AGP.\nITX: 215 × 195 mm (VIA)\nMini-ITX: 170 × 170 mm\nNano-ITX: 120 × 120 mm\nPico-ITX: 100 × 72 mm"}, {"name": "BTX", "text": "2004: BTX (Balanced Technology eXtended 'tecnología balanceada extendida') fue retirada en muy poco tiempo por la falta de aceptación, resultó prácticamente incompatible con ATX, salvo en la fuente de alimentación. Fue creada para intentar solventar los problemas de ruido y refrigeración, como evolución de la ATX.\nBTX: 325 × 267 mm (Intel)\nMicro BTX: 264 × 267 mm\nPico BTX: 203 × 267 mm\nRegular BTX: 325 × 267 mm"}, {"name": "DTX", "text": "2007: DTX[3]​ eran destinadas a las PC de pequeño formato. Hacen uso de un conector de energía de veinticuatro pines y de un conector adicional de 2 × 2.\nxtd: 249 × 203 mm (AMD)\nMini DTX: 170 × 203 mm\nFull DTX: 243 × 203 mm"}, {"name": "Formatos privativos", "text": "Durante la existencia del PC, muchas marcas han intentado mantener un esquema cerrado de hardware, denominado privativo, fabricando placas base incompatibles físicamente con los factores de forma con dimensiones, distribución de elementos o conectores que son atípicos. Entre las marcas más persistentes está Dell, que rara vez fabrica equipos diseñados con factores de forma de la industria."}]}, {"name": "Fabricantes de placas base", "text": "Varios fabricantes se reparten el mercado de placas base, tales como: Advantech, Albatron, Aopen, ASUS, AsRock, Biostar, Chaintech, Dell, DFI, ECS EliteGroup, FIC, Foxconn, Gigabyte Technology, iBase, iEi, Intel, Lenovo, MSI, Pc Chips, Sapphire Technology, Super Micro, Tyan, VIA, XFX, Zotac.\nAlgunos diseñan y fabrican uno o más componentes de la placa base, mientras que otros ensamblan los componentes que terceros han diseñado y fabricado.", "subsections": []}, {"name": "Tipos de placas principales", "text": "La mayoría de las placas de PC fabricadas después de 2001 se pueden clasificar en dos grupos:\nLas placas base para microprocesadores AMD:\nSlot A: Duron, Athlon\nSocket A: Duron, Athlon, Athlon XP, Sempron\nSocket 754: Athlon 64, Mobile Athlon 64, Sempron, Turion\nSocket 939: Athlon 64, Athlon FX, Athlon X2, Sempron, Opteron\nSocket 940: Opteron y Athlon 64 FX\nSocket AM2: Athlon 64, Athlon FX, Athlon X2, Sempron, Phenom\nSocket F: Opteron\nSocket AM2 +: Athlon 64, Athlon FX, Athlon X2, Sempron, Phenom\nSocket AM3: Phenom II X2/X3/X4/x6, Athlon II X2/X3/X4, Sempron 100 Series\nSocket AM3+: Sempron, Athlon II X2/X3/X4, Phenom II X2/X3/X4/X6, FX X4/X6/X8\nSocket FM1: A4X2, A6X3/X4, A8X4, Athlon II\nSocket FM2: APU A4, APU A6, APU A8, APU A10, Athlon II X2/X4\nSocket AM4: Procesadores de arquitectura Zen\nLas placas base para microprocesadores Intel:\nSocket 7: Pentium I, Pentium MMX\nSlot 1: Pentium II, Pentium III, Celeron\nSocket 370: Pentium III, Celeron\nSocket 423: Pentium 4\nSocket 478: Pentium 4, Celeron\nLGA 775: Pentium 4, Celeron, Pentium D (doble núcleo), Core 2 Dúo, Core 2 Quad, Core 2 Extreme, Xeon\nSocket 603: Xeon\nSocket 604: Xeon\nSocket 771: Xeon\nLGA 1366: Intel Core i7 (Nehalem), Xeon (Nehalem)\nLGA 1156: Intel Core i3, Intel Core i5, Intel Core i7 (Nehalem)\nLGA 2011: Intel Core i7, Xeon (Sandy Bridge)\nLGA 1155: Intel Core i5 e Intel Core i3 (Sandy Bridge), Intel Core i7, Intel Core i5 e Intel Core i3 (Ivy Bridge)\nLGA 1150: Intel Core i7, Intel Core i5 e Intel Core i3 (Haswell y Broadwell)\nLGA 1151: Intel Core i7, Intel Core i5, Intel Core i3, Intel Pentium G4000/G5000 series e Intel Celeron G3900 series (Skylake) y (Kaby Lake)\nLGA 1200: Core i9, Core i7, Core i5, Core i3, Pentium Gold, Celeron.", "subsections": []}, {"name": "Placa multiprocesador", "text": "Este tipo de placa base incluye zócalos para instalar varios procesadores (generalmente 2, 4, 8 o más). No nos estamos refiriendo a instalar un procesador con varios núcleos, sino a que podemos instalar varios procesadores físicos. Algunos fabricantes proveen placas base que pueden acoger hasta 8 procesadores (en el caso de socket 939 para procesadores AMD Opteron y sobre socket LGA 2011 para procesadores Intel Xeon).", "subsections": []}, {"name": "Véase también", "text": " Portal:Informática. Contenido relacionado con Informática.\nBackplane\nDoble canal", "subsections": []}, {"name": "Referencias", "text": "↑ mrhardware (18 de enero de 2021). «La tarjeta madre - componentes esenciales que debes conocer». Consultado el 2 de febrero de 2023. \n↑ Marchese, Gaston. Qué es la motherboard. \n↑ «DTX». ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Puerto_paralelo", "title": "Puerto paralelo", "summary": "Un puerto paralelo es una interfaz entre un computador y un periférico, cuya principal característica es que los bits de datos viajan juntos, enviando un paquete de byte a la vez. Es decir, se implementa un cable o una vía física para cada bit de datos formando un bus. Mediante el puerto paralelo podemos controlar también periféricos como focos, motores entre otros dispositivos.\nEl cable paralelo es el conector físico entre el puerto paralelo y el dispositivo periférico. En un puerto paralelo habrá una serie de bits de control en vías aparte que irán en ambos sentidos por caminos distintos.\nEn contraposición al puerto paralelo está el puerto serie, que envía los datos bit a bit por el mismo hilo.", "sections": [{"name": "Puerto paralelo Centronics", "text": "El puerto paralelo de las computadoras, de acuerdo a la norma Centronics, está compuesto por un bus de comunicación bidireccional de 8 bits de datos, además de un conjunto de líneas de protocolo. Las líneas de comunicación cuentan con un retenedor que mantiene el último valor que les fue escrito hasta que se escribe un nuevo dato, las características eléctricas son:\nTensión de nivel alto: 3,3 o 5 V.\nTensión de nivel bajo: 0 V.\nIntensidad de salida máxima: 2,6 mA.\nIntensidad de entrada máxima: 24 mA.\nLos sistemas operativos basados en DOS y compatibles gestionan las interfaces de puerto paralelo con los nombres LPT1, LPT2 y así sucesivamente (LPT significa Line Print Terminal), mientras que los de tipo Unix los nombran como /dev/lp0, /dev/lp1 o /dev/parport0, /dev/parport1, y demás. Las direcciones base de los dos primeros puertos son:\nLPT1 = 0x378.\nLPT2 = 0x278\nPara puertos de más de [1] han recomendado a la dirección:\nLa estructura consta de tres registros: de control, de estado y de datos.\nEl registro de control es un bidireccional de 4 bits, con un bit de configuración que no tiene conexión al exterior, su dirección en el LPT1 es 0x37A.\nEl registro de estado, se trata de un registro de entrada de información de 5 bits, su dirección en el LPT1 es 0x379.\nEl registro de datos, se compone de 8 bits, es bidireccional. Su dirección en el LPT1 es 0x378.", "subsections": [{"name": "Contactos", "text": "Los pines del puerto paralelo con conector DB25 son:\nLas líneas invertidas toman valor verdadero cuando el nivel lógico es bajo. Si no están invertidas, entonces el nivel lógico alto es el valor verdadero.\nEl pin 25 en el conector DB25 podría no estar conectado a la tierra en computadoras modernas."}]}, {"name": "Puerto paralelo IDE", "text": "No obstante existe otro puerto paralelo usado masivamente en los ordenadores: el puerto paralelo IDE, también llamado PATA (Parallel ATA), usado para la conexión de discos duros, unidades lectoras/grabadoras (CD-ROM, DVD), unidades magneto-ópticas, unidades ZIP y SuperDisk, entre la placa base del ordenador y el dispositivo.", "subsections": []}, {"name": "Puerto paralelo SCSI", "text": "Un tercer puerto paralelo, muy usado en los ordenadores Apple referencia para el uso en el computador y sirve como un puerto serial el hardware 1.5 para PC/Commodore Amiga.[1]​", "subsections": []}, {"name": "Véase también", "text": "IEEE 1284 Es el estándar de la IEEE para el puerto de impresora de un PC.\nIntel i8255 controlador paralelo de Intel\nZ80PIO controlador paralelo de Zilog\nCable Paralelo\nHardware\nPlaca base\nPuerto serie\nPC 99", "subsections": []}, {"name": "Referencias", "text": "↑ Versiones de siamese", "subsections": []}, {"name": "Bibliografía", "text": "Axelson, Jan (2000). Parallel Port Complete. Lakeview Research. ISBN 0-9650819-1-5.\nCiriaco García de Celis (1994). «12.10: El puerto de la impresora». El universo digital del IBM PC, AT y PS/2 (4ª edición). Grupo Universitario de Informática. ", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una categoría multimedia sobre Puerto paralelo.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/QWERTY", "title": "Teclado QWERTY", "summary": "Busca fuentes: «Teclado QWERTY» – noticias · libros · académico · imágenes\nEl teclado QWERTY es la distribución de teclado más común. Fue diseñado y patentado por Christopher Sholes en 1868, incluido en su máquina de escribir y vendido a Remington en 1873. Su nombre proviene de las primeras seis letras de su fila superior de teclas.\nLa distribución QWERTY se diseñó con el propósito de lograr que las personas escribieran más rápido distribuyendo las letras de tal forma que se pudieran usar las dos manos para escribir la mayoría de las palabras. Otro de los objetivos principales era separar las letras más usadas de la zona central del teclado, para evitar que se atascaran las máquinas de escribir de primera generación, y aunque hoy en día no es necesario, se sigue utilizando mayoritariamente esta distribución. Además de máquinas de escribir y ordenadores, el QWERTY actualmente se utiliza en teléfonos móviles, televisores inteligentes, cajeros automáticos y, en general, cualquier interfaz de texto. \nEn este teclado, según la técnica de mecanografía más difundida, en posición de reposo, cuatro dedos de cada mano se colocan sobre la fila central de teclas. Para poder encontrar esta posición sin tener que mirar el teclado, las teclas correspondientes a los dedos índice de cada mano (F y J) suelen tener algún rasgo distintivo al tacto.\nEsta disposición de teclado se llevó a las computadoras para desplazar más fácilmente a las máquinas de escribir en las oficinas. De esta forma, las personas encargadas de 'mecanografiar' documentos seguían sabiendo manejar los nuevos teclados informáticos.\nEl teclado QWERTY tiene versiones para diferentes lenguas. Hay países, como Alemania, que intercambian la tecla «Y» por la tecla «Z», con lo que se convierte en teclado QWERTZ. En Francia y Bélgica hay más cambios y las primeras seis teclas alfabéticas tienen la secuencia AZERTY. En la disposición española e hispanoamericana se incluye la letra «Ñ» justo a la derecha de la «L», en la portuguesa y en la española (para la lengua catalana) se incluye la «Ç» a la izquierda del enter. En Japón, usa caracteres kana, impresos a un lado de los caracteres latinos y números, pero algunos caracteres especiales fueron movidos respecto al teclado inglés.", "sections": [{"name": "Teclado QWERTY", "text": "Teclado IBM PC/Compatible IBM PC/Microsoft Windows (distribución latinoamericana).\n←\n↹\n⇪\n↲\n⇧\n⊞\n≣\n↑\n↓\n→", "subsections": []}, {"name": "Véase también", "text": "AZERTY\nQWERTZ\nTeclado HCESAR\nTeclado Dvorak", "subsections": []}, {"name": "Enlaces externos", "text": "The Dvorak Zine Historia detallada de los teclados QWERTY y Dvorak en forma de historieta (en inglés)\nComparador de teclados Te permite introducir un texto y calcular la velocidad que tardarías según el teclado\nTeclado QWERTY que es el teclado QWERTY y por qué se llama así\nQWERTY Historia detallada.\nPor qué escribimos como lo hacemos  Diario El Confidencial de España\nDiferencias entre los teclados español y latinoamericano Diferencias en la distribución de teclas entre el teclado español y el latinoamericano", "subsections": []}]}
