{"url": "https://es.wikipedia.org/wiki/Modelo_de_color_RGB", "title": "RGB", "summary": "RGB (sigla del inglés Red, Green, Blue; en español, ‘Rojo, Verde, Azul’) o RVA (sigla preferida por la ASALE y la RAE[cita requerida]) es la composición del color en términos de la intensidad de los colores primarios de la luz.", "sections": [{"name": "Modelo de color RGB", "text": "RGB es un modelo de color basado en la síntesis aditiva, con el que es posible representar un color mediante la mezcla por adición de los tres colores de luz primarios. El modelo de color RGB no define por sí mismo lo que significa exactamente rojo, Aunque utilicen un mismo modelo de color, sus espacios de color pueden variar considerablemente.", "subsections": [{"name": "Percepción y sensacion de cada color", "text": "Los ojos humanos tienen dos tipos de células sensibles a la luz o fotorreceptores: los bastones y los conos. Estos últimos son los encargados de aportar la información de color.\nPara saber cómo es percibido un color, hay que tener en cuenta que existen tres tipos de conos con respuestas frecuenciales diferentes, y que tienen máxima sensibilidad a los colores que forman la terna RGB. Aunque los conos que reciben información del verde y el rojo tienen una curva de sensibilidad similar, la respuesta al color azul es una veinteava (1/20) parte de la respuesta a los otros dos colores. Este hecho lo aprovechan algunos sistemas de codificación de imagen y vídeo, como el JPEG o el MPEG, «perdiendo» de manera consciente más información del componente azul, ya que el ser humano no percibe esta pérdida.\nLa sensación de color se puede definir como la respuesta de cada una de las curvas de sensibilidad al espectro radiado por el objeto observado. De esta manera, obtenemos tres respuestas diferentes, una por cada color. \nEl hecho de que la sensación de color se obtenga de este modo, hace que dos objetos observados, radiando un espectro diferente, puedan producir la misma sensación. Y en esta limitación de la visión humana se basa el modelo de síntesis del color, mediante el cual podemos obtener a partir de estímulos visuales estudiados y con una mezcla de los tres colores primarios, el color de un objeto con un espectro determinado."}]}, {"name": "Tratamiento de la señal de vídeo RGB", "text": "RGB es el tratamiento de la señal de vídeo que trata por separado las señales de los tres colores rojo, verde y azul. Al usarlo independientemente, proporciona mayor calidad y reproducción más fiel del color.", "subsections": [{"name": "Visión general", "text": "El modelo de color llamado RGB es el que se utiliza en todos los sistemas que forman imágenes a través de rayos luminosos, ya sea emitiéndolos o recibiéndolos.\nEl modelo RGB está formado por los tres componentes de colores primarios aditivos y como mínimo un componente de sincronismo. Los componentes de color son las señales rojo, verde y azul; siendo transmitidos cada uno independiente y aislado del resto.\nDe esta forma no hay pérdidas en el tratamiento de la imagen puesto que los colores primarios siguen existiendo como tal en su transmisión. Por el contrario, mediante este sistema hay mucha información redundante, con el consiguiente aumento del ancho de banda necesario respecto a otros métodos de transmisión. Por ejemplo, cada color lleva el valor de brillo de toda la imagen, de forma que esta información está por triplicado."}, {"name": "Emisores RGB", "text": "Unos sistemas (los que emiten rayos luminosos) forman las imágenes bien a través de tubos de rayos catódicos (TV, monitores, proyectores de vídeo, etc.), a través de LED (diodos luminosos) o sistemas de Plasma (TV, monitores, etc.).\nSeñal de luminancia\nLa sensación de luminosidad viene dada por el brillo de un objeto y por su opacidad, pudiendo producir dos objetos con tonalidades y prismas diferentes la misma sensación lumínica. La señal de luminancia es la cuantificación de esa sensación de brillo. Para mantener la compatibilidad entre las imágenes en blanco y negro y las imágenes en color, los sistemas de televisión actuales (PAL, NTSC, SECAM) transmiten tres informaciones: la luminancia y dos señales diferencia de color.\nDe esta manera, los antiguos modelos en blanco y negro pueden obviar la información relativa al color, y reproducir solamente la luminancia, es decir, el brillo de cada píxel aplicado a una imagen en escala de grises. Y las televisiones en color obtienen la información de las tres componentes RGB a partir de una matriz que relaciona cada componente con una de las señales diferencia de color.\nPara cada uno de los sistemas de televisión se transmiten de diferente manera, motivo por el cual podemos tener problemas al reproducir una señal NTSC en un sistema de reproducción PAL.\nSeñal de sincronismo\nLa señal de sincronismo es necesaria para poder marcar la pauta de guiado de la muestra de colores en pantalla, tanto en el sentido horizontal (el avance de la línea de imagen), como en sentido vertical (el salto a una nueva línea de imagen.\nEl sincronismo puede transmitirse principalmente de tres formas:\nSincronismos separados (RGBHV): Mediante este método existe una señal para el sincronismo horizontal HSync y otra señal para el sincronismo vertical VSync, ambas independientes entre sí y entre las señales de colores, teniendo en total 5 señales en la transmisión.\nSincronismo compuesto (RGBS): Mediante este método existe una señal con toda la información del sincronismo horizontal y vertical, independiente entre las señales de colores, teniendo en total 4 señales en la transmisión.\nSincronismo en verde (RGsB o SoG -Sync on Green-): Mediante este método existe una señal con toda la información del sincronismo horizontal y vertical multiplexada junto con la señal de color verde, teniendo en total 3 señales en la transmisión.\nNótese que este modelo existe solamente en pantallas y combinaciones de luz. No se aplica a los pigmentos (pintura), a los que corresponde el modo sustractivo de luz.[1]​"}, {"name": "Receptores RGB", "text": "Los sistemas que reciben y capturan luz (capturan las imágenes) son las cámaras digitales de fotografía y vídeo, los escáneres, etc. Gracias al establecimiento de este modelo de color, ha sido posible la creación de todos estos sistemas de emisión y recepción de imágenes. \nSin embargo, algunos valores (intensidad de brillo) no pueden ser obtenidos por este método."}]}, {"name": "Uso de RGB en HTML y en lenguajes de programación", "text": "Para indicar con qué proporción es mezclado cada color, se asigna un valor a cada uno de los colores primarios, de manera que el valor \"0\" significa que no interviene en la mezcla y, a medida que ese valor aumenta, se entiende que aporta más intensidad a la mezcla. Aunque el intervalo de valores podría ser cualquiera (valores reales entre 0 y 1, valores enteros entre 0 y 37, etc.), es frecuente que cada color primario se codifique con un byte (8 bits).\nAsí, de manera usual, la intensidad de cada una de las componentes se mide según una escala que va del 0 al 255 y cada color es definido por un conjunto de valores escritos entre paréntesis (correspondientes a valores \"R\", \"G\" y \"B\") y separados por comas.\nDe este modo, el rojo se obtiene con (255,0,0), el verde con (0,255,0) y el azul con (0,0,255), obteniendo, en cada caso un color resultante monocromático. La ausencia de color, es decir el color negro, se obtiene cuando las tres componentes son 0: (0,0,0). La combinación de dos colores a su máximo valor de 255 con un tercero con valor 0 da lugar a tres colores intermedios. De esta forma, aparecen los colores amarillo (255,255,0), cian (0,255,255) y magenta (255,0,255). El color blanco se forma con los tres colores primarios a su máximo valor (255,255,255).\nEl conjunto de todos los colores también se puede representar en forma de cubo. Cada color es un punto de la superficie o del interior de este. La escala de grises estaría situada en la diagonal que une al color blanco con el negro.", "subsections": [{"name": "HTML", "text": "En las pantallas, la sensación de color se produce por la mezcla aditiva de rojo, verde y azul. Las pantallas se dividen en puntos minúsculos llamados píxeles formados por tres subpíxeles de colores primarios de luz, cada uno de los cuales brilla con una determinada intensidad.\nAl principio, la limitación en la profundidad de color de la mayoría de los monitores condujo a una gama limitada a 216 colores, definidos por el cubo de color, mediante la fórmula 63=216. No obstante, el predominio de los monitores de 24-bit (resultante de 224), posibilitó el uso de 16.777.216 colores del espacio de color HTML RGB.\nLa gama de colores de la Web consiste en 216 combinaciones de rojo, verde y azul, donde cada color puede tomar un valor entre seis diferentes (en numeración hexadecimal): #00, #33, #66, #99, #CC o #FF, cuyos valores respectivos en sistema decimal equivalen a 0, 51, 102, 153, 204 y 255, que tienen un porcentaje de intensidad de 0%, 20%, 40%, 60%, 80% y 100%, respectivamente. Esto nos permite dividir los 216 colores en un cubo de dimensión 6.\nSe procura que los píxeles sean de un color tal que cuanto más saturado sea, será mejor, pero nunca se trata de un color absolutamente puro. Por tanto la producción de colores con este sistema tiene limitaciones:\nLa derivada del funcionamiento de las mezclas aditivas: sólo pueden ser obtenidos los colores interiores del triángulo formado por los tres colores primarios de luz.\nLa derivada del hecho que los colores primarios usados no son absolutamente monocromáticos.\nLas diversas pantallas no son iguales exactamente, además de ser configurables por los usuarios, con lo cual varios parámetros pueden variar.\nEsto implica que las codificaciones de los colores destinadas a las pantallas se deben interpretar como descripciones relativas, y entender la precisión de acuerdo con las características de la pantalla."}, {"name": "Codificación hexadecimal del color", "text": "La codificación dodecadecimal del color permite expresar fácilmente un color concreto de la escala RGB, utilizando la notación hexadecimal, como en el lenguaje HTML y en JavaScript. Este sistema utiliza la combinación de tres códigos de dos dígitos para expresar las diferentes intensidades de los colores primarios RGB .\nEn el sistema de numeración hexadecimal, además de los números del 0 al 9 se utilizan seis letras con un valor numérico equivalente; a=10, b=11, c=12, d=13, e=14 y f=15. La correspondencia entre la numeración hexadecimal y la decimal u ordinaria viene dada por la siguiente fórmula:\nLa intensidad máxima es ff, que se corresponde con (15×16)+15= 255 en decimal, y la nula es 00, también 0 en decimal. De esta manera, cualquier color queda definido por tres pares de dígitos.\nA partir de aquí se puede hacer cualquier combinación de los tres colores.\nLos colores más saturados y los más luminosos\nSupongamos tres fuentes luminosas, r, g y b, de las características indicadas en el gráfico adjunto:\nCualquier color que se pueda obtener a partir de esos tres colores primarios tendrá la forma:\ndonde ir, ig e ib son los coeficientes de las intensidades correspondientes a cada color primario.\nSi situamos los colores obtenidos en el gráfico, tenemos que:\nSi dos de los coeficientes son nulos, el color se sitúa en el vértice correspondiente al color de coeficiente no nulo.\nSi un coeficiente es nulo, el color se sitúa en uno de los lados del triángulo: el conjunto de todos ellos son los colores más saturados.\nSi ninguno de los coeficientes es nulo, el color se sitúa en un punto del interior; cuanto más parecidos sean los tres coeficientes, más cerca estará del blanco (en el centro).\nAl representar combinaciones de tres valores independientes en un diagrama que sólo tiene dos, resulta que a cada punto del diagrama le corresponde toda una familia de colores. Por ejemplo, los siguientes colores tienen la misma proporción de rojo, verde y azul, y por tanto les corresponde el mismo punto del gráfico. Solo se diferencian en la intensidad.\nSi las intensidades ir, ig e ib tienen un límite superior (255), la condición necesaria y suficiente para que un color sea el más intenso de la familia (es decir, de los representados por el mismo punto) es que al menos uno de sus coeficientes sea 255.\nLos colores que presentan la máxima saturación y la máxima luminosidad a la vez, son los que reúnen dos requisitos: al menos uno de los coeficientes es 255 y al menos uno de los coeficientes es 0. De esto se deduce que los colores más saturados y más luminosos siguen la siguiente secuencia:\n(0, 0, 0) es negro\n(255, 255, 255) es blanco\n(255, 0, 0) es rojo\n(0, 255, 0) es verde\n(0, 0, 255) es azul\n(255, 255, 0) es amarillo\n(0, 255, 255) es cian\n(255, 0, 255) es magenta"}]}, {"name": "Véase también", "text": "Espacio de color sRGB\nModelo de color CMYK\nModelo de color HSL\nModelo de color HSV\nModelo de color RYB\nMétodo Santana\nColores web o colores HTML\nYPBPR\nVideo Graphics Array", "subsections": []}, {"name": "Referencias", "text": "↑ https://web.archive.org/web/20080209023216/http://www.ipsi.fraunhofer.de/Kueppersfarbe/es/index.html", "subsections": []}, {"name": "Enlaces externos", "text": "Una herramienta que convierte los códigos de colores: hex rgb hsl", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Ordenador_dom%C3%A9stico", "title": "Computadora doméstica", "summary": "Se denomina computadora doméstica, computador doméstico u ordenador doméstico a la segunda generación de computadoras, que entraron en el mercado con el nacimiento del Altair 8800 y se extiende hasta principios de la década de 1990. Esto engloba a todos los ordenadores de 8 bits (principalmente con unidad central de procesamiento —CPU por sus siglas en inglés— Zilog Z80, MOS Technology 6502 o Motorola 6800) y a la primera ola de equipos con CPU de 16 bits (principalmente Motorola 68000 e Intel 8086 y 8088). El término proviene de que llevaron la computadora de la industria al hogar. Aunque se suele excluir de ese grupo a los compatibles IBM PC, lo cierto es que hasta el triunfo definitivo y la adopción del término \"computadora personal\", tuvieron que competir con las líneas patrocinadas por Atari, Commodore y Apple Computer, por lo que algunos optan por incluir en la categoría de doméstico a los modelos más significativos de 16 bits, o al menos a los compatibles PC orientados al mismo mercado como la gama Tandy.\nEn cierta manera, guardando cierta similitud con las nuevas formas animales aparecidas en el periodo cámbrico, una gran cantidad de máquinas de todas las clases, incluyendo rarezas como el ordenador Jupiter Ace en lenguaje Forth aparecían en el mercado y desaparecían de nuevo. Algunos tipos de ordenadores permanecieron durante más tiempo, otros evolucionaron tratando de mantener la compatibilidad (existen, por ejemplo, tarjetas de emulación Apple II para los primeros Mac). Sin embargo, al final de la década la mayoría fueron eliminados por la computadora personal compatible con IBM y las generaciones más nuevas de videoconsolas porque ambas utilizaban sus propios formatos incompatibles. La revolución IBM fue provocada en 1981 por la salida del ordenador personal de IBM 5150, el IBM PC.[1]​\nPese a ello, siguen existiendo grupos de usuarios que no renuncian a usar y mejorar sus viejos equipos dotándoles de las posibilidades modernas como disco duro o conexión a Internet. Aunque todas son muy activas (teniendo en cuenta la cada vez menor base de usuarios), destacan por mérito propio la de usuarios de MSX en los 8 bits y la de Commodore Amiga en los 16 bits (calificados por un redactor de MacByte como las aldeas de irreductibles galos que resisten el asedio de las legiones Wintel). Asimismo han dado nacimiento a una serie de aficiones que se suelen englobar bajo el vocablo retroinformática.\nUna de las más conocidas es la emulación, normalmente por software, pero también por hardware, de estas viejas computadoras y consolas en todo tipo de dispositivos: modernas computadoras personales, consolas, PDA, teléfonos móviles, reproductores de DVD decodificadores de TDT, cámaras fotográficas digitales, etc.\nMuchos de estos ordenadores eran superficialmente similares y tenían frecuentemente un teclado de «fabricación barata» integrado en la carcasa que albergaba debajo la placa base con la CPU, una fuente de alimentación externa y como unidad de visualización más común un televisor. Muchas utilizaban casetes de audio compactos como mecanismo (notoriamente poco fiable) de almacenamiento de datos ya que las unidades de disco flexible eran muy caras en aquella época. Su bajo precio era común a la mayoría de las computadoras.\nAparte de casos como CP/M y OS-9, la mayoría tienen en ROM las rutinas básicas (que podrían considerarse su sistema operativo) junto con el lenguaje BASIC. Es lo que hoy suele conocerse como el firmware de los periféricos (una unidad de disco o lectora de DVD puede llevar integrada en su circuitería microcontroladores precisamente basados en las CPUs de estos equipos).", "sections": [{"name": "Referencias", "text": "↑ «IBM PC turns 25». CNN. ", "subsections": []}, {"name": "Véase también", "text": "Historia de los computadores personales\nComputadora personal\nMicrocomputadora de 8 bits\nAnexo:Historia de la computación", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Oric_Atmos", "title": "Oric Atmos", "summary": "El Oric Atmos fue un ordenador doméstico fabricado por Oric Products International Ltd para competir con el Sinclair ZX Spectrum con un procesador 6502. Es el sucesor del Oric 1.", "sections": [{"name": "Datos técnicos", "text": "CPU Synertek SY6502A o Rockwell R6502AP (versiones licenciadas del MOS Technology 6502)[1]​ a 1 MHz\nROM 16 Kilobytes con un BASIC derivado del de Microsoft que incluye comandos de sonido. En esta versión (1.1) se han eliminado los Bugs y se añade un comprobador de grabación en cinta. Puede ampliarse mediante ROMs externas, como la de la unidad de disco (con hardware capaz de conmutar su ROM con la del equipo)\nRAM 64 Kilobytes el resto (se planeó un modelo de 16 Kilobytes que sensatamente se abandonó). Aunque se anuncia de 48 Kilobytes esto se debe a que la ROM oculta la parte alta de la memoria, pero al igual que en el Commodore 64 se puede acceder a todos los bancos de memoria mediante ensamblador\nVRAM no tiene. La pantalla se direcciona en la RAM alta :\nTexto: BB80-BFE0\nHires: A000-BFE0\nCarcasa pequeña, de 280 × 178 × 150 mm, en plástico rojo y negro. Inclinada para facilitar la escritura. Hueco de altavoz en la parte inferior (los Oric, al revés que el resto, tienen la cara principal de la placa madre boca abajo). En la zona superior rejilla de ventilación y nuevo logotipo de Oric (la etiqueta dice 48 Kb)\nTeclado Estándar QWERTY o AZERTY (los franceses) de 58 teclas tipo máquina de escribir, con las teclas especiales en color rojo y las alfanuméricas en negro. La tecla adicional es FUNCtion (de utilidad similar a ALT), pero apenas usada para mantener la compatibilidad con el Oric 1. No presentan TAB o CAPS LOCK (ésta se ha asignado a CTRL-T). Teclas de cursor a ambos lados de la barra espaciadora.\nPantalla usa una ULA con 2 modos:\nModo texto de 40 × 28 con 8 colores. Set ASCII de 128 caracteres en matriz de 6 × 8 píxels, redefinibles por soft. Fila superior no utilizada (normalmente usada por la ROM como línea de status). El atributo Serial de los caracteres de Teletexto se usa para seleccionar colores, parpadeo, caracteres de doble ancho, insertar fragmentos de gráficos modo texto, y seleccionar entre el set de caracteres estándar (ASCII), y el alternativo (caracteres semigráficos de Teletexto), en el que cada carácter representa una cadena de 2 × 3 PELs (bloques gráficos). Cada atributo serial ocupa el espacio de un carácter que no puede ser utilizado para nada más. Por ello, para cambiar a tinta amarilla sobre fondo azul, necesitamos 2 espacios. Esta es la mayor desventaja del ordenador.\nModo gráfico de 240 × 200 píxeles. 6 bits por píxel. Los atributos serial se utilizan también aquí (cada atributo ocupa hasta 6 por 1 píxeles). Tres líneas de texto en la zona inferior de la pantalla.\nSonido General Instrument AY-3-8912 con 3 canales de 8 octavas de sonido más uno de ruido blanco. Sonido Mono, con 16 niveles de volumen por el altavoz interno.\nSoporte\nInterfaz de casete a 300 y 2400 baudios.\nUnidad de disquete de 3 pulgadas (el oficial Oric Microdisc, de simple cara y 160 kB por cara), 3,5 o 5,25 pulgadas. Hasta 4 unidades direccionables, pudiendo mezclarse los modelos (solo Doble Densidad) y las capacidades, al poder definirse libremente los parámetros.\nEntrada/Salida Visto por detrás, de izquierda a derecha\nConector de TV PAL (modulador de RF UHF)\nConector DIN 5 de Monitor RGB\nConector DIN 7 de Interfaz de casete a 300 baudios y 2400 baudios\nPuerto paralelo de impresora de 20 pines\nConector de BUS de 34 pines\nConector de alimentación DC 9 Voltios 600 mA (negativo fuera, positivo centro)\nAmpliaciones\nPlóter de 4 colores y 40 columnas\nUnidad de disquete Oric de 3 pulgadas\nJasmin (una controladora alternativa de floppy para 1/Atmos)\nCumana Disk Interface\nPort MIDI\nInterfaz RS-232C (de MCP): se distribuye con el módem Telemod y soft para Prestel (Videotex en Inglaterra)\nInterfaz serie a 300 baudios de Kenema Associates\nOric V23 módem (V22/V23)\nVarias interfaces de Joystick (por el puerto paralelo o el BUS)\nSintetizadores de voz", "subsections": []}, {"name": "Historia", "text": "Tras la compra por Edenspring y los 4 millones de libras esterlinas para seguir adelante, se lanza un nuevo equipo del que se eliminan todos los fallos de la ROM y se le dota de un mejor teclado y un aspecto más profesional. Kenure Plastics fabrica la nueva carcasa en Hampton Farm, Gran Bretaña, mientras que el teclado es fabricado por Stackpole en Estados Unidos. Se presenta en el Which Computer Show del 17 de enero de 1984, junto con un prototipo del OricDisk. M.C.P., presenta igualmente sus novedades :\nSintetizador de voz / interfaz de joystick por 79,35 £\nInterfaz de joystick programable por 23,70 £\nConvertidor Analógico / Digital de 8 vías por 77 £\nReloj en tiempo real por 30 £\nInterfaz RS-232 por 38,50 £.\nSe desarrollan por fin las ampliaciones, como la unidad de disco (presentada oficialmente a la prensa el 4 de febrero de 1984)... pero la máquina sigue siendo la misma (mientras tanto Sinclair ha presentado el Sinclair QL), y las 170 £ del precio de venta está ahora por encima del precio del Sinclair ZX Spectrum y de otras máquinas. Es más, las primeras versiones de la nueva ROM presentan problemas de carga de casete. La ya endémica falta de soft se agrava (los desarrolladores no ven mercado suficiente para esforzarse en conversiones, cuando otras máquinas minoritarias con un 6502 como la familia Atari de 8 bits tiene un mercado mayor) y Oric UK tras la desastrosa campaña de Navidad acaba en la quiebra. Esto deja a la división francesa (Oric se ha vendido aceptablemente allí) como únicos fabricantes (al ser dos compañías diferentes, no se ven afectados). Deciden dejar de lado los proyectos de clones PC (con interfaz de casete) y centrarse en el nuevo equipo, que presentado como Stratos, acabará llamándose Oric Telestrat. \nEn ese momento el servicio de Videotex francés, llamado Minitel se ha convertido en una fiebre nacional (incluso en los tiempos del módem de 56 Kb y el boom del acceso a Internet era más popular), y los Oric utilizan muchas de sus definiciones. Se lanza un módem oficial V23 para los Atmos, y se planea el nuevo equipo para que además de cliente pueda actuar como un pequeño servidor. Pero al orientarse a un mercado más profesional no va a reemplazar al Atmos. Los nuevos equipos fabricados en Francia, además del teclado AZERTY incorporan de serie las resistencias necesarias en la interfaz RGB para poder conectarla directamente al Euroconector (debido a la complejidad de crear un modulador SECAM, se opta por usar el euroconector como sistema estándar de conexión al televisor de cualquier otro equipo, con la ventaja añadida de una mejor imagen, y el imperativo legal de una ley del gobierno francés)\nIgual que el Oric 1 se ha distribuido por Europa, pero sin mucha suerte, eclipsado en un mercado ya consolidado que comienza a ver la nueva generación de 16 bits. En Francia además debe luchar contra el ordenador patrio por excelencia, las gamas TO y MO de Thomson, que se encuentran en todas las escuelas francesas.", "subsections": []}, {"name": "Referencias", "text": "↑ Defence-Force tiene imágenes de las placas madre de los Oric/Pravetz", "subsections": []}, {"name": "Fuente", "text": "La mayor parte de este artículo procede de El Museo de los 8 Bits bajo licencia Creative Commons Atribución 2.5", "subsections": []}, {"name": "Enlaces externos", "text": "Oric.org Principal portal de los usuarios de Oric (en inglés)\nThe Oric FAQ sobre los Microtan 65, Oric 1, Oric Atmos & Stratos IQ164/Telestrat; website de James Groom (en inglés)\nDefence-Force: Oric Forums – The main Oric discussion forum (en inglés)\nLe monde Oric con un libro en línea sobre Oric (en francés)\nOric Webring (en inglés)", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/P%C3%ADxel", "title": "Píxel", "summary": "Un píxel o pixel,[1]​ plural píxeles o pixeles ( neologismo del inglés pixel, derivado del acrónimo del inglés picture element, 'elemento de la imagen') es, en informática, la unidad mínima que forma una imagen digital. Esta imagen puede ser mostrada e interpretada por el hardware de un ordenador, por ejemplo, mediante un monitor o una impresora. \nUn píxel usualmente se visualiza como un punto o un cuadrado, pero conceptualmente no tiene una forma determinada. Se puede decir que se trata de una muestra abstracta o una unidad de medida de resolución de pantalla. El píxel no tiene una medida concreta, en cada caso se establece por el fabricante del aparato que los usa, aunque acostumbra a ser del orden de micrómetros.\nLos píxeles son elementos independientes, pero el hecho que se perciban visualmente como un conjunto es debido a la limitación de nuestra visión, que hace que se obtenga una sensación de continuidad. A partir del concepto de píxel, se han derivado otros términos como por ejemplo vóxel (elemento de volumen), tèxel (elemento de textura) y surfel (elemento de superficie), utilizados por otros procesamientos de la imagen.[2]​[3]​[4]​[5]​ \nSe considera que Russell Kirsch fue su inventor cuando trabajaba en el Instituto Nacional de Estándares y Tecnología, y fue la base por el desarrollo de las imágenes digitales. La primera imagen escaneada es una foto de su hijo, del año 1957.[6]​ ", "sections": [{"name": "Concepto", "text": "Ampliando lo suficiente una imagen  (zoom) en la pantalla de una computadora, pueden observarse los píxeles que la componen, basta con ver esta pantalla a través de una gota de agua. Los píxeles son los puntos de color (siendo la escala de grises una gama de color monocromática). Las imágenes se forman como una sucesión de píxeles. La sucesión marca la coherencia de la información presentada, siendo su conjunto una matriz coherente de información para el uso digital. El área donde se proyectan estas matrices suele ser rectangular. La representación del píxel en pantalla, al punto de ser accesible a la vista por unidad, forma un área homogénea en cuanto a la variación del color y densidad por pulgada, siendo esta variación nula, y definiendo cada punto sobre la base de la densidad, en lo referente al área.\nEn las imágenes de mapa de bits, o en los dispositivos gráficos, cada píxel se codifica mediante un conjunto de bits de longitud determinada (la profundidad de color); por ejemplo, puede codificarse un píxel con un byte (8 bits), de manera que cada píxel admite hasta 256 variaciones de color (28 posibilidades binarias), de 0 a 255. En las imágenes llamadas de color verdadero, normalmente se usan tres bytes (24 bits) para definir el color de un píxel; es decir, en total se pueden representar unos 224 colores, esto es 16.777.216 variaciones de color. Una imagen en la que se utilicen 32 bits para representar un píxel tiene la misma cantidad de colores que la de 24 bits, ya que los otros 8 bits son usados para efectos de transparencia.\nPara poder visualizar, almacenar y procesar la información numérica representada en cada píxel, se debe conocer, además de la profundidad y brillo del color, el modelo de color que se utiliza. Por ejemplo, el modelo de color RGB (Red-Green-Blue) permite crear un color compuesto por los tres colores primarios según el sistema de mezcla aditiva. De esta forma, según la cantidad de cada uno de ellos que se use en cada píxel será el resultado del color final del mismo. Por ejemplo, el color magenta se logra mezclando el rojo y el azul, sin componente verde (este byte se pone en 0). Las distintas tonalidades del mismo color se logran variando la proporción en que intervienen ambas componentes (se altera el valor de esos dos bytes de color del píxel). En el modelo RGB lo más frecuente es usar 8 bits al representar la proporción de cada una de las tres componentes de color primarias. Así, cuando una de las componentes vale 0, significa que ella no interviene en la mezcla y cuando vale 255 (28 – 1) significa que interviene dando el máximo de ese tono, valores intermedios proveen la intensidad correspondiente.\nLa mayor parte de os dispositivos que se usan con una computadora (monitor, escáner, etc.) usan el  modelo RGB (modelo de reflexión o aditivo), excepto los que aportan tintes, como las impresoras, que suelen usar el  modelo CMYK (modelo sustractivo).", "subsections": [{"name": "Profundidad de color", "text": "Véase también:\nUn píxel, comúnmente, se representa con: 8 bits (28 colores), con 24 bits (224 colores, 8 bits por canal de color) o con 48 bits (248 colores); en  fotografía avanzada y digitalización de imágenes profesional se utilizan profundidades aún mayores, expresadas siempre en valores de bits/canal de color en lugar de la suma de los tres canales. Los primeros son los más utilizados, reservando el de 8 bits para imágenes de alta calidad pero en tonos de grises, o bien con 256 colores en paleta seleccionada para baja calidad colorimétrica; el de 24 bits es el más común y de alta calidad, se lo utiliza en la mayoría de las imágenes fotográficas."}]}, {"name": "Propiedades", "text": "", "subsections": [{"name": "Intensidad de color al píxel", "text": "La intensidad de cada píxel es variable: en los sistemas de color, cada píxel tiene normalmente tres o cuatro dimensiones de variabilidad del tipo rojo, verde y azul (modelo de color RGB), o bien cian, magenta, amarillo y negro (modelo de color CMYK). A cada píxel, se le asocia un número digital que corresponde a su nivel de luminosidad en la imagen. El valor de esta magnitud representa la energía electromagnética capturada y siempre es un número positivo codificado en binario.\nEl número de colores diferentes que podemos representar con un píxel depende del número de bits por píxel (bpp) o profundidad de color. El máximo número de colores que puede tomar un píxel podemos encontrarlo elevando 2 al número de bpp. Los valores más comunes son los siguientes:\n1 bpp → \n2\n1\n=\n2\n{\\displaystyle 2^{1}=2}\n colores, también llamado monocrom.\n2 bpp →  \n2\n2\n=\n4\n{\\displaystyle 2^{2}=4}\ncolores, llamado CGA.\n4 bpp →\n2\n4\n=\n16\n{\\displaystyle 2^{4}=16}\n  colores, esta es la profundidad mínima aceptada por el estándar VGA.\n8 bpp →  \n2\n8\n=\n256\n{\\displaystyle 2^{8}=256}\n colores, llamado súper-VGA.\n16 bpp →\n2\n16\n=\n65536\n{\\textstyle 2^{16}=65536}\n colores, conocido como Highcolor.\n24 bpp → \n2\n24\n=\n16777216\n{\\displaystyle 2^{24}=16777216}\n colores, llamado Truecolor.\n48 bpp →  \n2\n48\n=\n281474976710656\n{\\textstyle 2^{48}=281474976710656}\n colores, utilizado para trabajos profesionales.\nTodas las imágenes digitales están formadas por una disposición de píxeles a modo de matriz, con sus correspondientes filas y columnas que nos darán la localización de cada elemento de la composición. Cuantos más píxeles se usen para representar una imagen, más fiel será al modelo original."}, {"name": "Resolución del píxel", "text": "El número de píxeles de una imagen se llama a veces resolución, aunque la resolución tiene una definición más específica, ya que incluye otros parámetros. Los píxeles de una imagen se pueden expresar de diversas maneras: como un único número, como en el caso de las cámaras digitales, en las que decimos \"5 megapíxeles\" y nos referimos a ellas que tiene 5 millones de píxeles; también los podemos definir con dos números, como \"640 x 480\", en los que entendemos que la imagen tiene 640 píxeles de anchura y 480 de altura.\nEs importante establecer la diferencia entre los píxeles como elementos de la imagen y los píxeles como dispositivos físicos capaces de captar luz dentro de la matriz de un sensor digital, aunque es correcto hablar de píxeles con ambos significados.\nEn informática, una imagen formada por píxeles se llama mapa de bits o imagen rasterizada."}, {"name": "Píxel cuadrado", "text": "El píxel cuadrado es la representación del punto en formato digital. El píxel es la unidad mínima de información en imagen gráfica 2D, que tanto sirve para la representación como para el almacenamiento de información.\nRelación\nEn los sistemas de hoy en día, a partir de la relación de aspecto y de la definición espacial, los píxeles se mesuran en unas determinadas unidades. Para el caso de la definición horizontal (\nD\nH\n{\\displaystyle D_{H}}\n)se mesura en cpw i, en cambio, la definición vertical (\nD\nV\n{\\displaystyle D_{V}}\n) se mesura en cph. Dadas estas definiciones, porqué el píxel se considere cuadrado tiene que cumplir la siguiente : \nD\nH\nD\nV\n=\nW\nH\n{\\displaystyle {D_{H} \\over D_{V}}={W \\over H}}\nen qué \nW\nH\n{\\displaystyle {W \\over H}}\nes la relación de aspecto.\nConcepto a partir de la relación\nLa relación anterior pone de manifiesto que, para comparar dos magnitudes (\nD\nH\n{\\displaystyle D_{H}}\n i \nD\nV\n{\\displaystyle D_{V}}\n), tienen que contener las mismas unidades. Por tanto, por el caso de (\nD\nH\n{\\displaystyle D_{H}}\n), si multiplicamos por H (centímetros por unidad de altura), quedan las unidades de ciclos/\n(\nc\nm\n−\n1\n)\n{\\displaystyle (\\mathrm {cm} ^{-1})}\nAnalógicamente, por si acaso (\nD\nV\n{\\displaystyle D_{V}}\n), si multiplicamos por V (centímetros por unidad de anchura), quedan las unidades de ciclos/\n(\nc\nm\n−\n1\n)\n{\\displaystyle (\\mathrm {cm} ^{-1})}\nPor lo tanto, ahora ya podemos comparar las dos magnitudes. En caso de que sean iguales, se trata de un píxel cuadrado.\nUtilidad\nEn términos de exploración entrelazada, el fenómeno del píxel cuadrado se dio a conocer en la década de 1980. En aquel momento, la compañía Apple tuvo muchas dificultades para poder representar la realidad tal como era; quiso utilizar un sistema de exploración antiguo en altas resoluciones de la época (640 x 200), que deformaban notablemente la realidad. A partir de entonces, se vio la necesidad de adaptar los sistemas de exploración a las altas resoluciones."}]}, {"name": "Múltiplos habituales", "text": "", "subsections": [{"name": "Megapíxel", "text": "Un megapíxel o megapixel (Mpx) equivale a 1 millón de píxeles, a diferencia de otras medidas usadas en la computación en donde se suele utilizar la base de 1024 para los prefijos, en lugar de 1000, debido a su conveniencia respecto del uso del sistema binario. Usualmente se utiliza esta unidad para expresar la resolución de imagen de cámaras digitales; por ejemplo, una cámara que puede tomar fotografías con una resolución de 2048 × 1536 píxeles se dice que tiene 3,1 megapíxeles (2048 × 1536 = 3.145.728).\nLa cantidad de megapíxeles que tenga una cámara digital define el tamaño de las fotografías que puede tomar y el tamaño de las impresiones que se pueden realizar; sin embargo, hay que tener en cuenta que la matriz de puntos está siendo distribuida en un área bidimensional y, por tanto, la diferencia de la calidad de la imagen no crece proporcionalmente con la cantidad de megapíxeles que tenga una cámara, al igual que las x de una grabadora de discos compactos.\nLas cámaras digitales usan componentes de electrónica fotosensible, como los CCD (del inglés Charge-Coupled Device) o sensores CMOS, que graban niveles de brillo en una base por-píxel. En la mayoría de las cámaras digitales, el CCD está cubierto con un  mosaico de filtros de color, teniendo regiones color rojo, verde y azul (RGB) organizadas comúnmente según el filtro de Bayer, así que cada píxel-sensor puede grabar el brillo de un solo color primario. La cámara interpola la información de color de los píxeles vecinos, mediante un proceso llamado interpolación cromática, para crear la imagen final.\nPara saber el número total de píxeles de una cámara, basta multiplicar el ancho de la imagen máxima que puede generar por el alto de la misma —desactivando previamente el zoom digital—; también es posible dividir el número de píxeles de ancho entre el número correspondiente al alto, y conocer la proporción de la imagen obtenida."}, {"name": "Gigapíxel", "text": "Un gigapíxel (Gpx) equivale a un millardo o mil millones de píxeles, utilizando la base 1000 de los prefijos del sistema internacional, en vez de la base 1024 ISO/IEC 80000 o prefijo binario utilizados normalmente en el entorno de la informática. Usualmente se utiliza esta unidad para expresar la resolución de imagen de cámaras digitales.\nExisten cámaras digitales capaces de realizar fotografías en gigapíxeles, como por ejemplo la ARGUS-IS de la Agencia de Proyectos de Investigación Avanzados de Defensa (DARPA)[7]​ y la \"super cámara\" desarrollada por David Brady y su equipo de ingenieros de la Universidad de Duke.[8]​[9]​"}, {"name": "Subpíxel", "text": "Muchos sistemas de adquisición y reproducción de imagen, por varias razones, no son sensibles en los diferentes canales de colores de un mismo lugar. Esta aproximación se suele resolver usando múltiples subpíxeles, cada uno de los cuales soporta un único canal de color.\nEn este tipo de sistemas que utilizan subpíxeles, se pueden realizar dos tipos de aproximaciones:\nLos subpíxeles pueden ser ignorados, tratando los píxeles como la unidad más pequeña a la cual nos podemos dirigir en una imagen.\nEl subpíxel puede ser incluido en los cálculos de representación; esto supone una mejor resolución del color de la imagen resultante, aunque el proceso de representación será más largo."}]}, {"name": "Véase también", "text": "Vóxel\nTexel\nPíxel muerto\nResolución de pantalla\nTesela\nDot pitch", "subsections": []}, {"name": "Referencias", "text": "↑ Real Academia Española. «píxel». Diccionario de la lengua española (23.ª edición). \n↑ «What is a Pixel? Definition, Meaning and How They Work | TechTarget». WhatIs.com (en inglés). Consultado el 28 de noviembre de 2023. \n↑ «What is a Pixel?». Ultimate Photo Tips (en inglés estadounidense). 15 de junio de 2017. Consultado el 28 de noviembre de 2023. \n↑ «Pixel Definition - What is a pixel?». techterms.com. Consultado el 28 de noviembre de 2023. \n↑ «What Exactly Is a Pixel?». Mental Floss (en inglés estadounidense). 9 de noviembre de 2014. Consultado el 28 de noviembre de 2023. \n↑ Oregonian/OregonLive, Mike Rogoway | The (12 de agosto de 2020). «Russell Kirsch, inventor of the pixel, dies in Oregon at age 91». oregonlive (en inglés). Consultado el 28 de noviembre de 2023. \n↑ «DARPA's new 1.8-gigapixel camera is a super high-resolution eye in the sky» (en inglés). gizmag.com. Consultado el 6 de marzo de 2014. \n↑ «La cámara del futuro tomará imágenes de hasta 50 gigapíxeles». telesurtv.net. Consultado el 6 de marzo de 2014. \n↑ «Supercamera: More Pixels Than You Know What To Do With» (en inglés). npr.org. Consultado el 6 de marzo de 2014. ", "subsections": []}, {"name": "Enlaces externos", "text": "En \"artículo enmendado\" (avance de la 23a. edición del Diccionario de la Real Academia Española, aparecen las dos ortografías de esta palabra.\nFoto de 2,54 Gigapixels, va cargando a medida que se hace zoom con el ratón.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/PAL", "title": "PAL", "summary": "     PAL o PAL/SECAM\n     NTSC\n     SECAM\n     Sin Información\nPAL es la sigla de Phase Alternating Line (en español ‘línea de fase alternada’). Es el nombre con el que se designa al sistema de codificación utilizado en la transmisión de señales de televisión analógica en color en la mayor parte del mundo. Se utiliza en la mayoría de los países africanos, asiáticos y europeos, además de Australia y algunos países América del Sur, como Argentina, Brasil, Paraguay y Uruguay.\nOtros sistemas en uso son el NTSC, utilizado en casi toda América, Japón y el Sureste Asiático, y el SECAM, utilizado en Francia, en algunos países del Este de Europa y África. El sistema PAL deriva del NTSC, incorporando algunas mejoras técnicas.", "sections": [{"name": "Detalles técnicos", "text": "El sistema PAL surgió en el año 1963, de manos del Dr. Walter Bruch en los laboratorios de Telefunken en su intento por mejorar la calidad y reducir los defectos en los tonos de color que presentaba el sistema NTSC. No obstante, los conceptos fundamentales de la transmisión de señales han sido adoptados del sistema NTSC.\nAl igual que NTSC, es un sistema entrelazado. Primero se exploran las líneas impares y luego las pares. En PAL se exhiben 50 \"medios fotogramas\" por segundo. Primero se ven las líneas impares del fotograma 1, luego las líneas pares del fotograma 2; las impares del 3; las pares del 4, y así sucesivamente. Al conjunto de dos \"medios fotogramas\" (o \"campos\") se lo denomina \"cuadro\". Por tanto, en PAL tenemos 25 cuadros por segundo, que muestran 50 \"medios fotogramas\" entrelazados. En escenas con nulo o poco movimiento, el entrelazado no es perceptible; pero en paneos bruscos las imágenes de los campos de un mismo cuadro se \"alejan\", produciendo un \"efecto peine\". Este efecto también existe en NTSC y SECAM, por ser sistemas entrelazados. En la adaptación de cine para TV (\"telecine\"), los 24 cuadros por segundo del filme son acelerados a 25 cuadros por segundo. Esto significa que una película de 100 minutos, convertida a PAL dura 96 minutos, y ambos campos de un cuadro corresponden al mismo fotograma; dando la sensación de ser video progresivo (no hay efecto peine). En NTSC, en cambio, el proceso de telecine no se puede realizar como en PAL, ya que una película de 100 minutos pasaría a durar 80 (demasiada aceleración). En NTSC se utiliza la técnica \"3:2 pulldown\", que consiste en repetir dos de cada tres campos y eliminar uno cada cierto intervalo de tiempo, a fin de que cuatro fotogramas se conviertan en cinco; pasando de 24 cuadros por segundo a 29,97. Esto produce un entrelazado muy notorio y movimientos no fluidos; haciendo que NTSC sea muy inferior a PAL en cuanto a la transmisión de cine por TV. Además, PAL tiene una definición vertical 20% superior. \nEl nombre '''phase alternating line''' hace referencia al modo en que la información de crominancia (color) de la señal de vídeo es transmitida, siendo invertida en fase en cada línea, permitiendo la corrección automática de los posibles errores en fase al cancelarse entre sí. En la transmisión de datos por radiofrecuencia, los errores de fase son comunes y se deben a retardos de la señal en su llegada o procesado. Los errores de fase en la transmisión de vídeo analógico provocan un error en el tono del color, afectando negativamente a la calidad de la imagen.\nAprovechando que habitualmente el contenido de color de una línea y la siguiente es similar, en el receptor se compensan automáticamente los errores de tono de color tomando para la muestra en pantalla el valor medio de una línea y la siguiente, dado que el posible error de fase existente entre ambas será contrario. De esta forma, en lugar de apreciarse dicho error como un corrimiento del tono, como ocurriría en NTSC, se aprecia como un ligero defecto de saturación de color, que es mucho menos perceptible al ojo humano. Esta es la gran ventaja del sistema PAL frente al sistema NTSC.\nLas líneas en las que la fase está invertida con respecto a cómo se transmitirían en NTSC se llaman a menudo líneas PAL, y las que coincidirían se denominan líneas NTSC.\nEl funcionamiento del sistema PAL implica que es constructivamente más complicado de realizar que el sistema NTSC. Esto se debe a que, si bien los primeros receptores PAL aprovechaban las imperfecciones del ojo humano para cancelar los errores de fase, sin la corrección electrónica explicada anteriormente (toma del valor medio), esto daba lugar a un efecto muy visible de peine si el error excedía los 5º. La solución fue introducir una línea de retardo en el procesado de la señal de luminancia de aproximadamente 64µs que sirve para almacenar la información de crominancia de cada línea recibida. La media de crominancia de una línea y la siguiente es lo que se muestra por pantalla. Los dispositivos que eran capaces de producir este retardo eran relativamente caros en la época en la que se introdujo el sistema PAL, pero en la actualidad se fabrican receptores a muy bajo coste. \nEsta solución reduce la resolución vertical de color en comparación con NTSC, pero como la retina humana es mucho menos sensible a la información de color que a la de luminancia o brillo, este efecto no es muy visible. Los televisores NTSC incorporan un corrector de matiz de color (en inglés, tint control o HUE) para realizar esta corrección manualmente.\nEl sistema PAL es más consistente que el formato NTSC. Este último puede ser técnicamente superior en aquellos casos en los que la señal es transmitida sin variaciones de fase (por tanto, sin los defectos de tono de color anteriormente descritos). Pero para eso deberían darse unas condiciones de transmisión ideales (sin obstáculos como montes, estructuras metálicas...) entre el emisor y el receptor. En cualquier caso en el que haya rebotes de señal, el sistema PAL se ha demostrado netamente superior al NTSC (del que, en realidad, es una mejora técnica). Esa fue una razón por la cual la mayoría de los países europeos eligieron el sistema PAL, ya que la orografía europea es mucho más compleja que la norteamericana (toda la mitad este es prácticamente llana). Otro motivo es que en los EE. UU. son habituales las emisiones de carácter local y en Europa lo son las estaciones nacionales, cuyas emisoras suelen tener un área de cobertura más extensa. En el único aspecto en el que el NTSC es superior al PAL es en evitar la sensación de parpadeo que se puede apreciar en la zona de visión periférica cuando se mira la TV en una pantalla grande (más de 21 pulgadas), porque la velocidad de refresco es superior (60 Hz en NTSC frente a 50 Hz en PAL). De todas formas este es un argumento relativamente nuevo ya que en los años 50 el tamaño medio de la pantalla de un receptor de televisión era de unas 15 pulgadas, siendo además que esta frecuencia de refresco de imagen se adoptó en su origen condicionada por la frecuencia de la corriente alterna en los países europeos, que es 50 Hz frente a los 60 Hz de los EE. UU.\nDe hecho, el utilizar la frecuencia de 50 Hz permite la emisión o videograbación de películas cinematográficas rodadas a 24 fps de forma más sencilla por los aparatos de telecine, acelerando la cadencia de paso de las mismas hasta 25 fps (un 4 %), haciendo coincidir cada fotograma filmado con dos campos de la exploración de TV. Por el contrario, en los sistemas de televisión que emplean 60 Hz como frecuencia de campo, acelerar el movimiento de la película hasta 30 fps sería excesivo, por lo que, manteniendo la cadencia a 24 imágenes/segundo, han de realizar un sobremuestreo a 3 campos cada dos fotogramas explorados (3-2-3-2-3...), con lo que la continuidad del movimiento queda afectada, ya que un sujeto móvil aparecerá como andando \"a tirones\".\nAdemás, una mayor frecuencia de campo, trae consigo una reducción del número de líneas de exploración empleadas por el sistema de televisión, a igualdad de ancho de banda del canal de vídeo, por lo que la resolución vertical se verá mermada en la misma proporción.\nEl sistema NTSC utiliza 525 líneas, de las cuales sólo son visibles 486, ya que son las que se utilizan realmente para la formación de imagen en la pantalla. Por el contrario, el PAL emplea 625, de las cuales son efectivas 576, con el consiguiente aumento de resolución.\nEn ambos sistemas, las líneas no empleadas para la formación de imagen sirven para configurar el intervalo de borrado (zona negra que encuadra la imagen efectiva) anterior y posterior a los pulsos de sincronismo vertical, así como para transmitir el sonido.", "subsections": []}, {"name": "Resumen del sistema de televisión PAL B/G", "text": "Relación de aspecto: 4:3\nNúmero de líneas: 625\nLíneas activas (resolución vertical efectiva): 576\nRelación de aspecto de pixel (PAR): 59:54\nResolución final (SAR): 720x576\nColumnas activas: Depende del ancho de banda de la señal\nBorrado vertical: 25 H + 12 microsegundos\nFrecuencia de cuadro: 25 Hz (40 ms)\nFrecuencia de campo: 50 Hz (20 ms, de los cuales 18,4 ms activos)\nFrecuencia horizontal o de líneas: 15625 Hz\nFrecuencia de pulsos igualación: 31250 Hz\nFrecuencia de la subportadora de crominancia: 4,4336 MHz (Modulada en amplitud y fase)\nFrecuencia de la señal P (PAL): 7,8 kHz (1/2 de la frecuencia de líneas)\nPeriodo de línea (H): 64 µs\nPeriodo activo de línea: 52 µs\nDuración del pórtico anterior: 1,5 +/- 0,3 µs\nDuración del pórtico posterior: 5,8 +/- 0,2 µs\nDuración del sincronismo horizontal: 4,7 +/- 0,2 µs\nDuración del borrado horizontal: 12 +/- 0,3 µs\nDuración del burst: 2,25 +/- 0,2 µs = 10 +/- 1 ciclos\nDuración breezeaway: 0,9 µs (Respecto al flanco posterior)\nDuración del pulso vertical 27,3 µs (hay 5 pulsos)\nDuración del sincronismo vertical: 160 µs (Los cinco pulsos)\nDuración del pulso igualador: 2,35 µs (hay 5 Pulsos)\nDuración del pórtico anterior vertical: 160 µs (contiene 5 pulsos pre-EQ)\nDuración pórtico posterior vertical: 1,280 µs (5 pulsos + 17,5 H)\nDuración del pulso de borrado vertical: 1,612 µs\nComienzo del burst respecto a 0H: 5,6 +/- 0 1 µs\nLas medidas están hechas al 50 % de amplitud de los pulsos (Ref tiempos)\nTiempo de subida y bajada de los pulsos (Del 10 al 90 %): 0,2 +/- 0,1 µs\nTiempo de subida y bajada del vídeo activo (del 10 al 90 %): 0,3 +/-0,2 µs\nIluminante D (X=0,313 / Y=0,329)\nValor de gamma: 2,8 (precorrección)", "subsections": [{"name": "Obtención de la señal de luminancia", "text": "Se definen R, G y B, como las componentes del rojo, verde y azul. Se define Y como la componente de luminancia. Se tiene que:\nY(R,G,B) = 0,30R + 0,59G + 0,11B"}, {"name": "Obtención de las señales de crominancia", "text": "Se definen B, R e Y como las componentes del azul, del rojo y de la luminancia respectivamente. Se definen U y V como las componentes de diferencia al azul y de diferencia al rojo. Se tiene que:\nU(B,Y) = 0,493(B - Y)\nV(R,Y) = 0,877(R - Y)\nAncho de banda total: 5 MHz\nAncho de banda de U y V: 1 MHz"}]}, {"name": "Descripción de la parte inactiva de la línea en el sistema PAL", "text": "", "subsections": [{"name": "Pórtico anterior", "text": "Duración 1,5 microsegundos.\nSu función primaria es eliminar el haz de electrones tanto en la cámara como en el receptor permitiendo el retorno del trazo al principio de la línea siguiente.\nEn los formatos de grabación segmentados la conmutación entre cabezas se realiza en el intervalo de borrado horizontal. En los formatos C, y Cuadruplex la conmutación se realiza en el pórtico anterior."}, {"name": "Sincronismo horizontal o sincronismo de línea", "text": "Pulso negativo con una amplitud del 30 % del margen dinámico de la señal, tiene una duración de 4,7 microsegundos."}, {"name": "Pórtico posterior", "text": "Permite el borrado del haz antes del comienzo de la parte activa de la línea y aísla el tiempo de retorno de haz. En los VTR se usa para restablecer el nivel de DC de la señal después de la detección. En los VTR las correcciones del circuito AFC de los moduladores se realizan aquí, porque la señal es la misma en todas las líneas. Durante el pórtico posterior se compara y corrige la RF de esta parte de la línea (a la salida del modulador) con respecto a un oscilador de cuarzo. 5,8 microsegundos."}, {"name": "Burst", "text": "Duración 2,27 microsegundos (10 +/- 1 ciclos).\nEstá situado en el pórtico posterior, y proporciona una referencia de fase (tono) y amplitud (saturación) constantes para que el receptor demodule correctamente información de color que se modula en la línea.\nEn los VTR se usa para establecer que se graba o reproduce en color, y activa la circuitería asociada a estos procesos.\nCualquier ruido de alta frecuencia que se ubique en el lugar del burst puede dar lugar a que se active la circuitería de color con la consiguiente distorsión en la imagen. Ya que el burst debiera tener una fase y amplitud constantes, y es una componente de alta frecuencia de la señal de video, que se repite en todas las líneas, se usa durante la reproducción para determinar si la señal demodulada está correctamente ecualizada."}, {"name": "Ecualización", "text": "Es el proceso de cambio de la curva de respuesta de un amplificador para lograr una respuesta plana cuando el factor de amplificación varía con la frecuencia. Así se compensa la no linealidad en la reproducción de las cabezas y los materiales de las cintas. En los VTR modernos es automático (se muestrea el Burst). Cualquier variación en la frecuencia o fase del burst durante la demodulación es señal de que el reproductor tiene problemas de base de tiempos que requieren corrección. El Burst se compara con una referencia estable y el resultado se usa para corregir estos errores. (Si se graba en B/N se usa para esto el borde de ataque del sincronismo horizontal)."}, {"name": "Burst Flag", "text": "Duración aproximada de 2,3 microsegundos.\nEs un pulso cuyo borde de ataque está retardado 5,6 microsegundos respecto al borde de ataque del sincronismo horizontal, y se usa para situar el burst en el sitio correcto del pórtico posterior.\nNotas:\nVTR = Video Tape Recorder. En tecnología de vídeo profesional se refiere a una máquina que graba vídeo en banda base o en componentes con calidad profesional (típicamente la resolución de una película de 16 mm o superior).\nTBC = Time Base Corrector. Un TBC es un aparato que se encarga de normalizar la señal que entrega un VTR para que pueda utilizarse conjuntamente con la señal de las cámaras y otros dispositivos electrónicos que se usan en la producción audiovisual. Esto es necesario porque los VTR son dispositivos electromecánicos y están expuestos a derivas e irregularidades de funcionamiento propias de los motores eléctricos y, en general, de cualquier dispositivo mecánico. En un estudio de televisión es indispensable mantener la sincronía de funcionamiento entre las cámaras y cualquier otro aparato que suministre imágenes si se quieren realizar cosas tan simples como una mezcla o fundido entre varias de ellas."}]}, {"name": "Formatos del sistema PAL", "text": "El sistema de color PAL se usa habitualmente con un formato de vídeo de 625 líneas por cuadro (un cuadro es una imagen completa, compuesta de dos campos entrelazados) y una tasa de refresco de pantalla de 25 cuadros por segundo, entrelazadas, como ocurre por ejemplo en las variantes PAL-B, G, H, I y N.\nEn Brasil, se emplea una versión de PAL de 525 líneas y 29,97 cuadros por segundo, PAL M, muy próximo a NTSC en la frecuencia de subportadora de color (3,575611 MHz). El organismo regulador de las telecomunicaciones de Brasil, Anatel, tomó a comienzos de los años 70 la decisión de usar una norma propia para evitar la importación de aparatos receptores de color y permitir la compatibilidad con los receptores monocromáticos. Por otra parte los ensayos del NTSC hechos en ese país, en los años 60, habían resultado muy desalentadores debido a la pérdida de calidad del color al ser distribuida la señal en largas distancias. Casi todos los demás países que emplean la norma M de blanco y negro usan NTSC como sistema de color. \nEn Argentina, Paraguay y Uruguay, se usa PAL con el sistema estándar de 625 líneas, aunque con la frecuencia subportadora de color (3,582056 MHz) muy cercana a la del NTSC. Estas variantes se llaman PAL-N. Cuando se inició la televisión en Argentina, los equipos receptores y transmisores, de procedencia estadounidense, debieron ser ajustados en sus parámetros de barrido vertical para adaptarse a la frecuencia de 50 Hz del servicio de electricidad (625 líneas por imagen y 25 imágenes por segundo), pero manteniendo los demás parámetros de radiofrecuencia: esquema de canales, ancho de banda, separación de portadora de imagen y sonido, etc. Así nacieron las normas N por derivación de las normas M. Cuando se inició la televisión en color en ese país, para mantener estos mismos parámetros y permitir la recepción en televisores monocromáticos, se decidió el uso del sistema PAL con la norma N.\nComúnmente en algunos países de Latinoamérica, fabricantes de equipos de vídeo presentan receptores trinorma que pueden ser usados en cualquier país del continente americano, donde NTSC-J, NTSC-M, PAL-M y PAL-N son las normas usadas. En Europa, los receptores de televisión PAL más recientes pueden mostrar señales de todos estos sistemas, salvo en algunos casos PAL-M y PAL-N. La mayoría también puede recibir señales SECAM del Este de Europa y de Oriente Medio, excepto, normalmente, de Francia, salvo en equipos de fabricantes franceses. Muchos pueden incluso mostrar señales en norma NTSC-M en banda base introducidas solamente por sus entradas de vídeo para señales procedentes de un reproductor de vídeo o consola de videojuegos.\nCuando el vídeo se transmite en banda base, la mayor parte de las diferencias entre las variantes de PAL no son ya significativas, salvo por la resolución vertical y la tasa de refresco de cuadro. En este contexto, el referirse al sistema PAL implica hacerlo a sistemas de 625 líneas horizontales a 25 cuadros por segundo, entrelazados, con el color codificado según cada una de las variantes existentes.", "subsections": []}, {"name": "PAL digital", "text": "El sistema PAL es analógico. Hubo un intento de fabricar equipos que digitalizasen la señal PAL en los años 80, pero no tuvo ningún éxito comercial y ahora son una rareza. En los dispositivos digitales, como televisión digital, videoconsolas modernas, computadoras, etc., se utilizan sistemas en componentes de color donde se transmiten por tres cables diferentes las señales R, G y B o bien Y (luminancia), R-Y y B-Y (diferencia de color). En estos casos sólo se tiene en cuenta el número de líneas horizontales totales - 625 en PAL digital y 525 en NTSC - y la frecuencia de cuadros - 25/s en PAL Digital y 30/s en NTSC digital. Mención aparte merecen los sistemas basados en el estándar MPEG-2, como el DVD y la televisión por satélite, televisión por cable, o la televisión digital terrestre (TDT); pero es otro sistema de televisión que no tiene prácticamente nada que ver con el PAL.", "subsections": []}, {"name": "Comparación de resoluciones entre 576i (PAL) y 480i (NTSC)", "text": "PAL es estrictamente un sistema que define la forma de transmisión del color exclusivamente, independientemente del formato de la imagen. Sin embargo normalmente se lo asocia con el formato 576i o 625/50 (con Normas B,D,G,H,I,K,N). \nEn 576i (\"PAL\" B,D,G,H,I,K,N) se utiliza un sistema de exploración de 625 líneas totales y 576 líneas activas (las que se muestran en pantalla), pues 49 líneas no son visibles y se utilizan para el retrazado.\nEn 480i (\"NTSC\" M,J), se utiliza un sistema de exploración de 525 líneas totales y 480 líneas activas, pues 45 líneas se utilizan para el borrado.\n\"NTSC\" es un estándar que se define con el sistema de transmisión de color NTSC y las normas M o J, destacando que la norma J se utilizaba solo en Japón (hasta la llegada del sistema digital ISDB-T).\nHay un estándar que utiliza el sistema color PAL y la norma M, es el de Brasil donde se utiliza el PAL M. \nDebido a que el cerebro humano puede resolver menos información de la que existe realmente, podemos hablar de la \"relación de utilización\" o \"factor de Kell\", que se define como la razón entre la resolución subjetiva y la resolución objetiva. El factor de Kell para sistemas entrelazados como 576i (PAL) y 480i (NTSC) vale 0,7 (para sistemas progresivos vale 0,9).\nEntonces, tanto en PAL como NTSC tenemos que:\nResolución subjetiva / Resolución objetiva = 0,7\nLa resolución objetiva de 576i (PAL) es 576 líneas, mientras que la de 480i (NTSC) es de 480 líneas.\nDe esta manera, en 576i (PAL) tenemos una resolución subjetiva de 403,2 líneas; mientras que en 480i (NTSC) se perciben 336 líneas.\nPor tanto, 576i (PAL) ofrece una resolución subjetiva y objetiva de un 20 % superior a 480i (NTSC).", "subsections": []}, {"name": "Distribución geográfica de los formatos PAL", "text": "", "subsections": [{"name": "Países y territorios que emplean PAL B/G o PAL D/K", "text": "En Europa\nAlbania, Alemania, Isla Ascensión, Austria, Bélgica, Bosnia y Herzegovina, Chipre, Croacia, Dinamarca, Eslovenia, España, Estonia, Islas Feroe, Finlandia, Gibraltar, Grecia, Groenlandia, Islandia, Italia, Letonia, Liechtenstein, Lituania, Luxemburgo, Macedonia del Norte, Malta, Montenegro, Noruega, Países Bajos, Polonia, Portugal, Rumanía, Serbia, Suecia, Suiza y Ciudad del Vaticano.\nEn Asia\nAfganistán, Baréin, Bangladés, Brunéi, República Popular China, Corea del Norte, Chipre, Dubái, Emiratos Árabes Unidos, India, Indonesia, Israel, Jordania, Kuwait, Líbano, Malasia, Maldivas, Nepal, Omán, Pakistán, Catar, Singapur, Sri Lanka, Siria, Tailandia, Territorios Palestinos (Franja de Gaza y Cisjordania), Turquía y Yemen.\nEn África\nArgelia, Angola, Botsuana, Camerún, Cabo Verde, Eritrea, Etiopía, Gambia, Ghana, Guinea, Guinea Bissau, Kenia, Lesoto, Liberia, Malaui, Mozambique, Namibia, Nigeria, Seychelles, Sierra Leona, Somalia, Sudáfrica, Sudán, Sudán del Sur,  Suazilandia, Tanzania, Tristán da Cunha, Uganda, Zambia y Zimbabue.\nEn Oceanía\nAustralia, Islas Cook, Nueva Zelanda, Isla Norfolk, Papúa Nueva Guinea, Islas Salomón, Tonga y Vanuatu."}, {"name": "Países y territorios que emplean PAL-I", "text": "Hong Kong, Islas Malvinas, Macao, Reino Unido, República de Irlanda, Sudáfrica y Angola."}, {"name": "Países y territorios que emplean PAL-M", "text": "Brasil, (NTSC & PAL-M) y Laos, (SECAM & PAL-M)."}, {"name": "Países y territorios que emplean PAL-N", "text": "Argentina (NTSC y PAL-N) (hasta septiembre de 2023)[1]​, Paraguay y Uruguay"}, {"name": "Países y territorios que han dejado de utilizar PAL", "text": "Los siguientes países ya no usan PAL para transmisiones terrestres y están en proceso de conversión de PAL (cable) a DVB-T, DTMB o ISDB-T.\nAlbania\n2019-10-01\nAndorra \n2007-09-25\n2023\n2013-12-10\nAustria \n2010-06-07\nAzerbaiyán\n2015-06-17\nBélgica \n2010-03-01\nBrasil \nBrunéi\n2015-01-01\nBulgaria\n2013-09-30\nCamboya\nCroacia\n2010-10-20\nChipre\n2011-07-01\nRepública Checa \n2012-06-30\nDinamarca\n2009-11-01\nEstonia\n2010-07-01\n2002–12\nFinlandia \n2007-09-01\nGeorgia\n2015-07-01\nAlemania\n2009-06-04\nGhana\n2015-06\nGrecia\n2015-02-05\n2012-12-31\n2010-11-17\nHong Kong\n2020-12-01\nHungría\n2013-10-31\nIslandia\n2015-02-02\n2015-02-31\nIrán\n2014-12-19\n2012-10-24\nIsla de Man\nIsrael\n2011-06-13\nItalia\n2012-07-04\nJersey\nKenia\n2015-03\nLetonia\n2010-06-01\nLituania \n2012-10-29\nLuxemburgo\n2006-09-01\nMacedonia del Norte\n2013-05-31\nMalta\n2011-10-31\nMónaco\n2011-05-24\nMontenegro\nNamibia\n2014-09-13\nPaíses Bajos \n2006-12-14\nNueva Zelanda\n2013-12-01\nNoruega\n2009-12\nPolonia \n2013-07-23\n2012-04-26\nCatar\n2012-02-13\nRumania\n2016-12-31\nRuanda\n2014-03\n2010-12-02\nArabia Saudita\nSerbia\n2015-06-07\nSingapur\n2019-01-02\nEslovaquia\nEslovenia\n2010-12-01\n2015\nEspaña\n2010-04-03\nSuecia\n2007-10-29\nSuiza \n2007-11-26\nTanzania\n2014-07\n2020-09\nUcrania\nEmiratos Árabes Unidos\nReino Unido\n2014-12-31"}]}, {"name": "Referencias", "text": "↑ «TRANSICIÓN DE LA TELEVISIÓN ANALÓGICA AL SISTEMA ARGENTINO DE TELEVISIÓN DIGITAL TERRESTRE (SATVD-T) - DECRETO 156/22». \n↑ «TV og radio». \n↑ «Switching Off Analogue TV Will Lock Out Many In Africa». \nEl estándar que define el sistema PAL fue publicado por la Unión Internacional de Telecomunicaciones en 1998 y se titula \"Recomendación ITU-R BT.470-6, Sistemas de Televisión Convencionales.\"", "subsections": []}]}
