{"url": "https://es.wikipedia.org/wiki/Baudio", "title": "Baudio", "summary": "El baudio es una unidad de medida utilizada en telecomunicaciones que representa el número de símbolos por segundo en un medio de transmisión.[1]​ Debe su nombre al apellido de Émile Baudot, que fue un ingeniero de telegrafía francés inventor de un aparato telegráfico y del código Baudot (1874) utilizado por los teletipos.\nEn general, cada símbolo se compone de una o varias señales físicas en función del esquema de modulación y se corresponde con una u otra cantidad de información en bits. Así, es posible encontrar una relación directa entre la velocidad en baudios y la velocidad en bits por segundo en una línea; solo cuando cada símbolo representa un único bit de información ambas velocidades coinciden. Así\nn\n=\nr\nb\nr\ns\n{\\displaystyle n={\\frac {rb}{rs}}}\ndonde:\nr\nb\n{\\displaystyle rb}\n: régimen binario o tasa de bits\nr\ns\n{\\displaystyle rs}\n: tasa de modulación o tasa de símbolos y\nn\n{\\displaystyle n}\n: número de bits por nivel para la codificación de línea.\nEl baudio puede escalarse en términos métricos:\n1 kBd (kilobaudio) = 1000 Bd\n1 MBd (megabaudio) = 1000 kBd\n1 GBd (gigabaudio) = 1000 MBd.\nEn cuanto a las aplicaciones en el ámbito de las telecomunicaciones, en los módems tradicionales, la tasa de baud era una medida crucial del rendimiento. Por ejemplo, un módem de 9600 baud podría transmitir hasta 9600 cambios de señal por segundo. Mientras que en la comunicación de datos, los sistemas modernos de comunicación de datos a menudo usan la tasa de baud para describir la velocidad de transferencia de datos. En técnicas de modulación complejas, un solo baud puede representar varios bits de datos, por lo que entender la técnica de modulación es importante para correlacionar la tasa de baud con la tasa de bits.[2]​\nLas técnicas de modulación binarias son tales que en esquemas de modulación binaria simples, cada baud representa un bit. Por ejemplo, en un sistema de 2400 baud usando modulación binaria, la tasa de datos también es de 2400 bits por segundo. Mientra sque en modulación multinivel, en técnicas de modulación más avanzadas como la Modulación por Amplitud en Cuadratura (QAM), cada baud puede representar múltiples bits. Por ejemplo, en 16-QAM, cada símbolo representa 4 bits, por lo que la tasa de bits puede ser mucho mayor que la tasa de baud.\nEn las comunicaciones digitales contemporáneas[3]​, la tasa de baud a menudo se discute junto con la tasa de bits y la tasa de símbolos para describir con precisión las velocidades de transmisión de datos. Los sistemas modernos utilizan técnicas de modulación avanzadas que hacen que la comparación directa de la tasa de baud con la tasa de bits sea menos directa.[2]​[4]​", "sections": [{"name": "Historia", "text": "En 1926, debido a la existencia de dos tipos de sistemas de telegrafía (los caracterizados por elementos de transmisión de igual duración y los diferenciales), la velocidad de transmisión se definió por el número de intervalos elementales transmitidos por segundo.[5]​\nEsta definición se da en 1929 en el periódico telegráfico de julio de 1929, bajo el nombre de velocidad de transmisión que reemplaza el término velocidad de transferencia ; el mismo año, se propuso el término baudios en homenaje a Émile Baudot.[6]​\nEl propósito de esto fue comparar dispositivos cuyas diferencias en las características técnicas llevaron a diferentes unidades de conteo: número de revoluciones por minuto, número de agujeros, longitud de las tiras perforadas por minuto, número de palabras por minuto (independientemente del número de letras), número de letras por minuto.[7]​\nAsí, en 1929, para una teleimpresora que funcionaba a una velocidad de rotación de 210 revoluciones por minuto, las velocidades en baudios eran las siguientes:\nEn 1931, se llevaron a cabo transmisiones a 50 baudios a través de redes fantasmas y redes superfantasmas a distancias de varios cientos de kilómetros.\nEn 1933, se alcanzaron transmisiones a 25 baudios sobre 58.000  km.\nEn 1934, se reorganizó el sistema de medición de la velocidad de transmisión para tener una velocidad de transmisión válida para todos los sistemas de telégrafo, tanto Hugues como Baudot. En ese momento, para una rotación de 120 revoluciones por minuto (dos revoluciones por segundo), la velocidad del sistema Hugues se contaba a 56 baudios (2 × 28 pernos), pero el nuevo sistema de medición contaba entonces solo 22,4 baudios (debido a una proporción de 2,5). Al mismo tiempo, para una velocidad de 180 revoluciones por minuto (tres revoluciones por segundo), el sistema Baudot cuádruple de 25 contactos se midió a 75 baudios (3 × 25) y el sistema Baudot doble, a la mitad.\nEn 1958, en los Estados Unidos, el primer módem informático comercial fue el Bell 101 que funcionaba a una velocidad de 110 baudios.\nEn 1960, en Francia, una velocidad de 50 baudios seguía siendo la velocidad de referencia normal para un servicio de telégrafo.\nEn 1962, Electronic Industries Alliance estandarizó el puerto RS-232 utilizado para enlaces seriales locales.\nEn 1962, en los Estados Unidos, el Bell 103 fue el segundo módem informático comercial entregado por AT&T Corporation . Operaba a través de líneas telefónicas regulares a una velocidad de 300 baudios.\nEn 1976 aparecen los estándares V10 y V11 operando a 100 kbaudios y 10 Mbaudios.\nEn 1976, el protocolo V.29 fue validado / estandarizado, proporcionando módems que transmiten a una velocidad de 9600 baudios en circuitos arrendados de tipo telefónico punto a punto con cuatro cables.\nEn 1979, en Francia, determinados sistemas industriales funcionaban a una velocidad de 600 baudios.\nEn 1980, el Bell 212A (protocolo V.22) transmitía a 1200 baudios (o 600 baudios).\nEn 1988, la UIT aprobó uno de los primeros estándares de módem telefónico de consumo, el estándar V.23 (utilizado en Minitels ) que permite transferencias a 1200 baudios y 600 baudios y un canal de retorno a 75 baudios.\nEn 1998 aparecieron módems de 56 kb / s (8000/3429 baudios) (protocolo V.90).\nPosteriormente, los enlaces seriales de modulación de banda base y portadora única más o menos cayeron en desuso [ref. necesario] en favor de otras tecnologías y protocolos más complejos que no transfieren cada bit en un tiempo fijo (tecnologías de redes inalámbricas, DSL, OFDM, etc.).", "subsections": []}, {"name": "Relación con la tasa de bits bruta", "text": "La velocidad de símbolo está relacionada con la velocidad de bits bruta expresada en bit/s. \nEl término baudio a veces se ha utilizado incorrectamente para referirse a la velocidad de bits,[8]​ ya que estas velocidades son las mismas en los módems antiguos y en los enlaces de comunicación digital más simples que utilizan solo un bit por símbolo, de modo que se representa el dígito binario \"0\" por un símbolo y el dígito binario \"1\" por otro símbolo. En módems y técnicas de transmisión de datos más avanzados, un símbolo puede tener más de dos estados, por lo que puede representar más de un bit. Un bit (dígito binario) siempre representa uno de dos estados.\nSi se transportan N bits por símbolo, y la tasa de bits bruta es R, incluida la sobrecarga de codificación de canal, la tasa de símbolos fs se puede calcular como\nf\ns\n=\nR\nN\n.\n{\\displaystyle f_{\\text{s}}={R \\over N}.}\nAl tomar la información por pulso N en bit/pulso como el logaritmo en base 2 del número de mensajes distintos M que podrían enviarse, Hartley[9]​ construyó una medida de la tasa de bits bruta R como\nR\n=\nf\ns\nN\n{\\displaystyle R=f_{\\text{s}}N\\quad }\nN\n=\n⌈\nlog\n2\n⁡\n(\nM\n)\n⌉\n.\n{\\displaystyle \\quad N=\\left\\lceil \\log _{2}(M)\\right\\rceil .}\nAquí el \n⌈\nx\n⌉\n{\\displaystyle \\left\\lceil x\\right\\rceil }\n denota la función de techo de \nx\n{\\displaystyle x}\n. Donde \nx\n{\\displaystyle x}\n se toma como cualquier número real mayor que cero, entonces la función de techo se redondea al número natural más cercano (p. ej. \n⌈\n2.11\n⌉\n=\n3\n{\\displaystyle \\left\\lceil 2.11\\right\\rceil =3}\n).\nEn ese caso M = 2N, se utilizan diferentes símbolos. En un módem, estos pueden ser tonos de onda sinusoidal de tiempo limitado con combinaciones únicas de amplitud, fase y/o frecuencia. Por ejemplo, en un módem 64QAM, M = 64 , por lo que la velocidad de bits es N = log2(64) = 6 veces la velocidad en baudios. En un código de línea, estos pueden ser M niveles de voltaje diferentes.\nLa razón no es necesariamente un número entero; en la codificación 4B3T, la tasa de bits es 4/3 de la velocidad en baudios. (Una interfaz de velocidad básica típica con una velocidad de datos sin procesar de 160 kbit / s funciona a 120 kBd).\nLos códigos con muchos símbolos y, por tanto, con una tasa de bits superior a la tasa de símbolos, son más útiles en canales como las líneas telefónicas con un ancho de banda limitado pero una alta relación señal/ruido dentro de ese ancho de banda. En otras aplicaciones, la tasa de bits es menor que la tasa de símbolos. La modulación de ocho a catorce como se usa en los CD de audio tiene una tasa de bits 8/14 de la velocidad en baudios.", "subsections": []}, {"name": "Módem por cable", "text": "Un módem por cable se conecta a un sistema de televisión por cable en las instalaciones del abonado y permite la transmisión bidireccional de datos a través del sistema de cable, generalmente a un proveedor de servicios de Internet. El cablemódem suele estar conectado a un ordenador personal o a un router mediante una conexión Ethernet que funciona a velocidades de línea de 10 o 100 Mbps. En la \"cabecera\", o punto central de distribución del sistema de cable, un sistema de terminación de módem por cable conecta la red de televisión por cable a Internet. Dado que los sistemas de módem por cable funcionan simultáneamente con los sistemas de televisión por cable, las frecuencias de subida (del abonado al CMTS) y de bajada (del CMTS al abonado) deben seleccionarse para evitar interferencias con las señales de televisión.[10]​\nLa capacidad bidireccional era bastante rara en los servicios de cable hasta mediados de los años 90, cuando la popularidad de Internet aumentó considerablemente y se produjo una importante consolidación de los operadores en la industria de la televisión por cable. Los módems de cable se introdujeron en el mercado en 1995. Al principio todos eran incompatibles entre sí, pero con la consolidación de los operadores de cable surgió la necesidad de un estándar. En América del Norte y del Sur, un consorcio de operadores desarrolló la Especificación de Interfaz de Servicios de Datos por Cable (DOCSIS) en 1997. La norma DOCSIS 1.0 ofrecía un servicio básico de datos bidireccional de 27 a 56 Mbps de bajada y hasta 3 Mbps de subida para un solo usuario. Los primeros módems DOCSIS 1.0 estuvieron disponibles en 1999. La norma DOCSIS 1.1, publicada ese mismo año, añadió la capacidad de voz sobre el protocolo de Internet (VoIP), permitiendo así la comunicación telefónica a través de los sistemas de televisión por cable. DOCSIS 2.0, publicado en 2002 y estandarizado por la UIT como J.122, ofrece velocidades de datos ascendentes mejoradas del orden de 30 Mbps.[11]​\nTodos los cablemódems DOCSIS 1.0 utilizan QAM en un canal de televisión de seis megahercios para el flujo descendente. Los datos se envían de forma continua y son recibidos por todos los cablemódems en el ramal híbrido coaxial-fibra. Los datos de subida se transmiten en ráfagas, utilizando la modulación QAM o la modulación por desplazamiento de fase en cuadratura (QPSK) en un canal de dos megahercios. En la modulación por desplazamiento de fase (PSK), las señales digitales se transmiten cambiando la fase de la señal portadora en función de la información transmitida. En la modulación por desplazamiento de fase binaria, la portadora adopta las fases +90° y -90° para transmitir un bit de información; en QPSK, la portadora adopta las fases +45°, +135°, -45° y -135° para transmitir dos bits de información. Como un ramal de cable es un canal compartido, todos los usuarios deben compartir el ancho de banda total disponible. En consecuencia, la tasa de rendimiento real de un cablemódem es una función del tráfico total en la rama; es decir, a medida que más abonados utilizan el sistema, el rendimiento total por usuario se reduce. Los operadores de cable pueden acomodar mayores cantidades de tráfico de datos en sus redes reduciendo la extensión total de un único ramal de fibra coaxial.[10]​\nCada elemento modificado de la onda portadora modulada (por ejemplo, un desplazamiento de una frecuencia a otra o un desplazamiento entre dos fases) se conoce como baudio. En los primeros módems de banda de voz de los años 60, un baudio representaba un bit, de modo que un módem que funcionaba, por ejemplo, a 300 baudios por segundo (o, más sencillamente, 300 baudios) transmitía datos a 300 bits por segundo. En los módems modernos, un baudio puede representar muchos bits, por lo que la medida más precisa de la velocidad de transmisión son los bits o kilobits (mil bits) por segundo.[10]​ A lo largo de su desarrollo, los módems han aumentado su rendimiento de 300 bits por segundo (bps) a 56 kilobits por segundo (Kbps) y más. Los módems de cable alcanzan un rendimiento de varios megabits por segundo (Mbps; millones de bits por segundo). A las velocidades de bits más altas, es necesario emplear esquemas de codificación de canal para reducir los errores de transmisión. Además, se pueden utilizar varios esquemas de codificación de la fuente para \"comprimir\" los datos en menos bits, lo que aumenta la velocidad de transmisión de la información sin aumentar la tasa de bits.", "subsections": []}, {"name": "Tecnologías en desarrollo para aumentar velocidades de transmisión de datos", "text": "A principios del siglo XXI hay varias áreas de investigación en curso y tecnologías emergentes destinadas a aumentar las tasas de transmisión y mejorar la eficiencia de los sistemas de comunicación. Estas áreas de investigación y tecnologías están empujando los límites de los sistemas de comunicación actuales, con el objetivo de aumentar significativamente las tasas de baud y las capacidades generales de transmisión de datos. Involucran avances en técnicas de modulación, fibra óptica, nuevas bandas de frecuencia, arquitectura de red y tecnologías cuánticas. Mantenerse al tanto de estos desarrollos puede proporcionar información sobre las capacidades futuras de los sistemas de comunicación.\nTécnicas de Modulación Avanzadas\nLa investigación se centra en desarrollar esquemas de modulación más eficientes, como la Modulación por Amplitud en Cuadratura (QAM) de orden superior y la Multiplexión por División de Frecuencia Ortogonal (OFDM). Estas técnicas aumentan la cantidad de datos transmitidos por baud al representar múltiples bits por símbolo. Con esquemas de modulación avanzados como 256-QAM o 1024-QAM, las tasas de baud pueden ser muy altas. Por ejemplo, en sistemas de fibra óptica de alta velocidad, se han demostrado tasas de baud de hasta 100 GHz, donde cada baud puede transportar múltiples bits debido a la modulación de alto orden.[12]​ \nTecnologías de Fibra Óptica[13]​\nMultiplexión por División de Longitud de Onda (DWDM): DWDM permite enviar múltiples flujos de datos simultáneamente a través de una sola fibra óptica utilizando diferentes longitudes de onda (canales). Esto multiplica efectivamente la capacidad de los sistemas de fibra óptica. Con las tecnologías actuales, cada longitud de onda puede manejar tasas de baud en el rango de 100-400 Gbaud. Combinado con modulación avanzada, las tasas de datos pueden superar 1 Tbps por fibra.\nTecnologías de Peine de Frecuencia Óptica: Se están explorando para aumentar aún más el número de canales y el ancho de banda en las comunicaciones ópticas. Se exploran tasas de baud de hasta varios terahercios (THz) utilizando peines de frecuencia óptica. Por ejemplo, los sistemas experimentales han alcanzado tasas de baud en el rango de 1 THz.  \nComunicación en Terahercios\nBanda de Terahercios (THz): La investigación en comunicación THz busca utilizar el espectro de frecuencias entre microondas e infrarrojo, lo que tiene el potencial de proporcionar tasas de datos extremadamente altas. La comunicación THz podría ofrecer anchos de banda y tasas de transmisión significativamente mayores en comparación con las tecnologías actuales. La investigación en comunicación THz está orientada a tasas de baud en el rango de cientos de gigahercios a terahercios. Los sistemas experimentales han demostrado tasas de baud de hasta 1 THz.\nTecnologías 5G y Más Allá (6G)\nRedes 5G: El 5G introduce nuevas tecnologías como MIMO Masivo (Multiple Input Multiple Output) y formación de haces avanzada que mejoran las tasas de datos y la eficiencia. Para los sistemas 5G utilizando MIMO avanzado y formación de haces, las tasas de baud pueden alcanzar hasta 100 GHz en algunas aplicaciones de alta velocidad. Sin embargo, la tasa de datos real depende del esquema de modulación y las condiciones del canal.\nInvestigación en 6G: La investigación en 6G está explorando bandas de frecuencia aún más altas (como sub-terahercios) y tecnologías avanzadas como la formación de haces holográfica y superficies inteligentes para impulsar aún más las tasas de transmisión de datos. Las tecnologías 6G están explorando tasas de baud de hasta varios terahercios. La investigación experimental ha demostrado tasas de baud en el rango de 1-10 THz, pero la implementación generalizada aún está a unos años de distancia.\nComunicación Cuántica\nDistribución de Claves Cuánticas (QKD): Esta tecnología proporciona canales de comunicación seguros con tasas de transmisión potencialmente altas. La investigación en comunicación cuántica está explorando formas de aumentar las tasas de datos y la distancia. Los sistemas experimentales utilizando entrelazamiento cuántico y fotónica han logrado altas tasas de datos, con tasas de baud potenciales en el rango de gigahercios para sistemas prácticos.\nTecnologías MIMO (Multiple Input Multiple Output)[14]​\nMIMO Masivo: Los avances en MIMO masivo implican el uso de un gran número de antenas para mejorar la eficiencia espectral y aumentar las tasas de transmisión. Esta tecnología es un componente clave del 5G y se está desarrollando aún más para redes futuras. Con los sistemas MIMO del 5G, las tasas de baud pueden alcanzar hasta 100 GHz, con posibles aumentos futuros a medida que se desarrollan más antenas y técnicas avanzadas de formación de haces.\nCodificación de Red\nTécnicas de Codificación de Red: Estas técnicas implican codificar datos a través de múltiples rutas de red para aumentar el rendimiento y la eficiencia. La investigación está en curso para mejorar la implementación y efectividad de la codificación de red en diversos escenarios de comunicación.\nCódigos de Corrección de Errores Avanzados:\nCorrección y Detección de Errores: El desarrollo de códigos de corrección de errores más eficientes, como los códigos de Paridad de Baja Densidad (LDPC) y los códigos Turbo, puede mejorar la fiabilidad y la tasa de datos efectiva de los sistemas de comunicación.[12]​\nTécnicas de Procesamiento de Señales:\nProcesamiento de Señales Avanzado: Técnicas como la filtración adaptativa, la ecualización y el procesamiento no lineal se están investigando para mejorar el rendimiento de los sistemas de comunicación y aumentar las tasas efectivas de baud. Las técnicas avanzadas de procesamiento de señales mejoran la tasa de baud efectiva al mejorar la integridad de la señal y reducir el ruido. Las tasas de baud en sistemas prácticos pueden alcanzar hasta 100 GHz o más, dependiendo de la tecnología específica y la aplicación.\nComunicación Satelital y Espacial\nSatélites en Órbita Baja (LEO): Se están desarrollando redes de satélites LEO para proporcionar cobertura global de internet de alta velocidad, con investigaciones en curso para mejorar las tasas de datos y reducir la latencia.", "subsections": []}, {"name": "Ejemplos", "text": "En el caso de las máquinas teletipo, todavía en uso en algunos medios, se decía que la velocidad de transmisión era normalmente de 50 baudios. En este caso, como los eventos eran simples cambios de voltaje 1 --> (+), 0 --> (–), cada evento representaba un solo bit o impulso elemental, y su velocidad de transmisión en bits por segundo coincidía con la velocidad en baudios.\nSin embargo, en los módems que utilizan diversos niveles de codificación, por ejemplo mediante modulación de fase, cada evento puede representar más de un bit, con lo cual ya no coinciden bits por segundo y baudios.", "subsections": []}, {"name": "Referencias", "text": "↑ Tanenbaum, Andrew S. (enero de 2002). «2.5 La red telefónica pública conmutada». Redes de computadoras. Pearson. ISBN 970-26-0162-2. \n↑ a b William Stallings. Data and Computer Communications (2017) 768 pag, ISBN: 978-0134444284\n↑  Rodger E. Ziemer, William H. Tranter. Principles of Communications: Systems, Modulation, and Noise. (2008) 704 pag. ISBN: 978-0471457222\n↑ John G. Proakis, Masoud Salehi. Digital Communications (2014)  1072 pag. ISBN: 978-0073380647\n↑ Journal télégraphique Éditeur : [s.n.] (Berne) Date d'édition : 1934-05 gallica.bnf.fr/ark:/12148/bpt6k5660237t/f16.item\n↑ Journal télégraphique Éditeur : [s.n.] (Berne) Date d'édition : 1929-07 gallica.bnf.fr/ark:/12148/bpt6k5573015h/f6.item\n↑ Journal télégraphique Éditeur : [s.n.] (Berne) Date d'édition : 1930-10 gallica.bnf.fr/ark:/12148/bpt6k5573081h/f3.item\n↑ Banks, Michael A. (1990). «BITS, BAUD RATE, AND BPS Taking the Mystery Out of Modem Speeds». Brady Books/Simon & Schuster. Consultado el 17 de septiembre de 2014. \n↑ D. A. Bell (1962). Information Theory and its Engineering Applications (3rd edición). New York: Pitman. OCLC 1626214. \n↑ a b c Curt Franklin. «How Cable Modems Work». HowStuffWorks. Consultado el 28 de agosto de 2010. \n↑ Andrew Brandt (1999). «How It Works: Cable Modems». PC World. Archivado desde el original el 3 de noviembre de 2011. Consultado el 28 de agosto de 2010. \n↑ a b John G. Proakis and Masoud Salehi. Digital Communications (2014) 1072 pag. ISBN: 978-0073380647\n↑ John M. Senior. Optical Fiber Communications (2020) 608 pag. ISBN: 978-0133948996\n↑ Herbert Taub, Donald L. Schilling. Principles of Communication Systems (2011) 496 pag. \nISBN: 978-0073375667", "subsections": []}, {"name": "Bibliografía", "text": "Karl-Dirk Kammeyer: Nachrichtenübertragung. 4. Auflage. Vieweg + Teubner, 2008, ISBN 978-3-8351-0179-1.\nBruce Carlson. Communication Systems, Mcgraw Hill Higher Education; 5th Edition (January 1, 2009), 768 pag. ISBN 0071263322, ISBN 978-0071263320\nLouis Frenzel. Principles of Electronic Communication Systems.  McGraw Hill; 4th edition (February 9, 2015) 944 pag. ISBN 0073373850, ISBN 978-0073373850", "subsections": []}, {"name": "Enlaces externos", "text": "Martin, Nicolas (January 2000). «On the origins of serial communications and data encoding». dBulletin, the dBASE Developers Bulletin (7). Consultado el 4 de enero de 2007. \nFrenzel, Lou (27 de abril de 2012). «What's The Difference Between Bit Rate And baud?». Electronic Design Magazine. ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/CPU", "title": "Unidad central de procesamiento", "summary": "La unidad central de procesamiento (conocida por las siglas CPU, del inglés Central Processing Unit) o procesador es un componente del hardware dentro de un ordenador, teléfonos inteligentes, y otros dispositivos programables.\nSu función es interpretar las instrucciones de un programa informático mediante la realización de las operaciones básicas aritméticas, lógicas, y externas (procedentes de la unidad de entrada/salida). Su diseño y su avance ha variado notablemente desde su creación, aumentando su eficiencia y potencia y reduciendo el consumo de energía y el coste.\nUn ordenador puede contener más de una CPU (multiprocesamiento). En la actualidad, los microprocesadores están constituidos por un único circuito integrado (chip) aunque existen los procesadores multinúcleo (varias CPU en un solo circuito integrado). Un circuito integrado que contiene una CPU también puede contener los dispositivos periféricos y otros componentes de un sistema informático; similar a un microcontrolador (menos potente en RAM) se le denomina sistema en un chip (SoC).\nLos componentes de la CPU son:\nUnidad aritmético lógica o unidad de cálculo (del inglés: Arithmetic Logic Unit o ALU): realiza operaciones aritméticas y lógicas.[1]​\nUnidad de control (CU): dirige el tráfico de información entre los registros de la CPU y conecta con la ALU las instrucciones extraídas de la memoria.\nRegistros internos: no accesibles (de instrucción, de bus de datos y bus de dirección) y accesibles de uso específico (contador programa, puntero pila, acumulador, flags, etc.) o de uso general.", "sections": [{"name": "Historia", "text": "Artículo principal:\nLos primeros ordenadores, como el ENIAC, tenían que recablearse físicamente para realizar diferentes tareas, lo que hizo que estas máquinas se denominaran \"ordenadores de programa fijo\". Dado que el término \"CPU\" generalmente se define como un dispositivo para la ejecución de software (programa informático), los primeros dispositivos que con razón podríamos llamar CPU vinieron con el advenimiento de la ordenador de programa almacenado.\nLa idea de un ordenador con programa almacenado ya estaba presente en el diseño de John Presper Eckert y en el ENIAC de John William Mauchly, pero esta característica se omitió inicialmente para que el aparato pudiera estar listo antes. El 30 de junio de 1945, antes de que se construyera la ENIAC, el matemático John von Neumann distribuyó el trabajo titulado First Draft of a Report on the EDVAC (Primer Borrador de un Informe sobre el EDVAC). Fue el esbozo de un ordenador de programa almacenado, que se terminó en agosto de 1949.[2]​ El EDVAC se diseñó para realizar un cierto número de instrucciones (u operaciones) de varios tipos. Significativamente, los programas escritos para el EDVAC se crearon para almacenarse en la memoria de alta velocidad del ordenador y no para que los especificara su cableado físico. Esto permitió superar una grave limitación del ENIAC, que era el tiempo y el esfuerzo necesarios para volver a configurar el equipo para realizar una nueva tarea. Con el diseño de von Neumann, el programa (o software) que corría en el EDVAC podría cambiarse simplemente cambiando el contenido de la memoria. Sin embargo, el EDVAC no fue el primer ordenador de programa almacenado: la Máquina Experimental de Pequeña Escala de Mánchester, un pequeño prototipo de ordenador de programa almacenado, ejecutó su primer programa el 21 de junio de 1948.[3]​ Su sucesor, el Manchester Mark I, ejecutó su primer programa en la noche del 16 al 17 de junio de 1949.\nLas primeras CPU se diseñaron a medida como parte de un ordenador más grande, generalmente un ordenador único en su especie. Sin embargo, este método de diseñar las CPU a medida, para una aplicación particular, ha desaparecido en gran parte y se ha sustituido por el desarrollo de clases de procesadores baratos y estandarizados adaptados para uno o varios propósitos. Esta tendencia de estandarización comenzó generalmente en la era de los transistores discretos, los ordenador centrales, y los microprocesadoress y se aceleró rápidamente con la popularización del circuito integrado (IC). Este ha permitido que se diseñen y se fabriquen CPU más complejas en espacios pequeños, del orden de nanómetros. Por la miniaturización y la estandarización de las CPU, ha aumentado la presencia de estos dispositivos digitales en la vida moderna mucho más allá de las aplicaciones limitadas de máquinas de computación dedicadas. Los microprocesadores modernos aparecen en todo, desde automóviles hasta teléfonos móviles (celulares) y juguetes de niños.\nSi bien von Neumann ha sido muchas veces acreditado por el diseño del ordenador con programa almacenado debido a su diseño del EDVAC, otros antes que él, como Konrad Zuse, habían propuesto y aplicado ideas similares. La denominada arquitectura Harvard del Harvard Mark I, que se completó antes de EDVAC, también utilizó un diseño de programa almacenado usando cinta de papel perforada en vez de memoria electrónica. La diferencia clave entre las arquitecturas de von Neumann y la de Harvard es que la última separa, dentro del almacenamiento, el tratamiento de instrucciones de la CPU y los datos, mientras que el primero utiliza el mismo espacio de memoria para ambos. La mayoría de los CPU modernos son de diseño von Neumann, pero las CPU con arquitectura Harvard se ven, sobre todo, en aplicaciones embebidas; por ejemplo, los microcontroladores Atmel AVR son procesadores de arquitectura Harvard.\nLos relés eléctricos y los tubos de vacío (válvulas termoiónicas) se usaban comúnmente como elementos de conmutación; un ordenador útil requería miles o decenas de miles de dispositivos de conmutación. La velocidad global de un sistema depende de la velocidad de los conmutadores. Los ordenadores de tubo, como el EDVAC, solían tener un promedio de ocho horas entre fallos, mientras que los ordenadores de relés (anteriores y más lentos), como el Harvard Mark I, fallaban muy raramente.[4]​ Al final, las CPU basadas en tubo llegaron a ser dominantes porque las significativas ventajas de velocidad producidas generalmente pesaban más que los problemas de fiabilidad. La mayor parte de estas tempranas CPU síncronas corrían en frecuencias de reloj bajas comparadas con los modernos diseños microelectrónicos. Eran muy comunes en este tiempo las frecuencias de la señal del reloj con un rango desde 100 kHz hasta 4 MHz, limitado en gran parte por la velocidad de los dispositivos de conmutación con los que se construyeron.", "subsections": [{"name": "CPU de transistores y de circuitos integrados discretos", "text": "La complejidad del diseño de las CPU aumentó junto con la facilidad de la construcción de dispositivos electrónicos más pequeños y fiables. La primera de esas mejoras vino con el advenimiento del transistor. Las CPU transistorizadas durante los años 1950 y los años 1960 no tuvieron que construirse con elementos de conmutación abultados, no fiables y frágiles, como los tubos de vacío y los relés eléctricos. Con esta mejora, se construyeron CPU más complejas y más fiables sobre una o varias tarjetas de circuito impreso que contenían componentes discretos (individuales).\nDurante este período, ganó popularidad un método de fabricar muchos transistores en un espacio reducido. El circuito integrado (IC) permitió fabricar una gran cantidad de transistores en una simple oblea basada en semiconductor o «chip». Al principio, solamente se miniaturizaron en IC circuitos digitales muy básicos, no especializados, como las puertas NOR. Las CPU basadas en estos IC de \"bloques de construcción\" generalmente denominan dispositivos de pequeña escala de integración \"small-scale integration\" (SSI). Normalmente los circuitos integrados SSI, como los usados en el computador guía del Apolo (Apollo Guidance Computer), contenían transistores que se contaban en números de múltiplos de diez. Construir una CPU completa usando IC SSI requería miles de chips individuales, pero aún consumía mucho menos espacio y energía que los diseños anteriores de transistores discretos. A medida que la tecnología microelectrónica avanzó, en los circuitos integrados se fue colocando un número creciente de transistores, disminuyendo así la cantidad de circuitos integrados individuales necesarios para una CPU completa. Los circuitos integrados MSI y LSI (de mediana y gran escala de integración) aumentaron el número de transistores a cientos y luego a miles.\nEn 1964, IBM introdujo su arquitectura de computador System/360, que se usó en una serie de ordenadores que podían ejecutar los mismos programas con velocidades y desempeños diferentes. Esto fue significativo en un tiempo en el que la mayoría de los ordenadores electrónicos eran incompatibles entre sí, incluso los hechas por un mismo fabricante. Para facilitar esta mejora, IBM utilizó el concepto de microprograma, a menudo llamado «microcódigo», ampliamente usado aún en las CPU modernas.[5]​ La arquitectura System/360 era tan popular que dominó el mercado del mainframe durante las siguientes décadas y dejó una herencia que todavía perdura en los ordenadores modernos, como el IBM zSeries. En el mismo año 1964, Digital Equipment Corporation (DEC) introdujo otro ordenador que fue muy influyente, dirigido a los mercados científicos y de investigación: el PDP-8. DEC introdujo más adelante la muy popular línea del PDP-11, que originalmente se construyó con IC SSI pero se implementó con componentes LSI cuando se convirtieron en prácticos. En fuerte contraste con sus precursores hechos con tecnologías SSI y MSI, la primera implementación LSI del PDP-11 contenía una CPU compuesta solamente por cuatro circuitos integrados LSI.[6]​\nLos ordenadores basados en transistores tenían varias ventajas frente a sus predecesores. Aparte de una creciente fiabilidad y un menor consumo de energía, los transistores también permitían que la CPU operara a velocidades mucho más altas debido al corto tiempo de conmutación de un transistor en comparación con un tubo o un relé. Gracias tanto a esta creciente fiabilidad como al enorme incremento de velocidad de los elementos de conmutación, que por este tiempo eran casi exclusivamente transistores, se fueron alcanzando frecuencias de reloj de la CPU de decenas de megahercios. Además, mientras se usaban comúnmente las CPU de transistores discretos y de circuitos integrados, comenzaron a aparecer nuevos diseños de alto rendimiento, como procesadores vectoriales SIMD (single instruction multiple data – instrucción única, datos múltiples). Estos primeros diseños experimentales dieron lugar más adelante a la era de los superordenadores especializados, como los hechos por la Cray Inc."}, {"name": "Microprocesadores", "text": "En la década de 1970 los inventos fundamentales de Federico Faggin (ICs Silicon Gate MOS con puertas autoalineadas junto con su nueva metodología de diseño de lógica aleatoria) cambió el diseño y la implementación de las CPU para siempre. Desde la introducción del primer microprocesador comercialmente disponible, el Intel 4004, en 1970 y del primer microprocesador ampliamente usado, el Intel 8080, en 1974 esta clase de CPU ha desplazado casi totalmente el resto de los métodos de implementación de la Unidad Central de Procesamiento. Los fabricantes de mainframes y de miniordenadores de ese tiempo lanzaron programas de desarrollo de IC propietarios para actualizar sus arquitecturas de ordenadores más viejas y producir microprocesadores con conjuntos de instrucciones que eran retrocompatibles con sus hardwares y sus softwares más viejos. Combinado con el advenimiento y el vasto éxito del ahora ubicuo ordenador personal, el término \"CPU\" se aplica ahora casi exclusivamente a los microprocesadores.\nLas generaciones previas de CPU se implementaron como componentes discretos y numerosos circuitos integrados de pequeña escala de integración en una o más tarjetas de circuitos. Por otro lado, los microprocesadores son CPU fabricadas con un número muy pequeño de IC; normalmente solo uno. El tamaño más pequeño de la CPU, como resultado de estar implementado en una simple pastilla, significa tiempos de conmutación más pequeños debido a factores físicos como la reducción de la capacitancia parásita de las puertas. Esto ha permitido que los microprocesadores síncronos tengan tiempos de reloj con un rango de decenas de megahercios a varios gigahercios. Adicionalmente, como ha aumentado la capacidad de construir transistores muy pequeños en un circuito integrado, la complejidad y el número de transistores en una simple CPU también se ha incrementado enormemente. Esta tendencia ampliamente observada se describe por la ley de Moore, que ha venido demostrando ser una predicción bastante exacta del crecimiento de la complejidad de los CPUs y otros IC.[7]​ Mientras que, en los pasados sesenta años, la complejidad, el tamaño, la construcción y la forma general de las CPUs han cambiado drásticamente, es notable que el diseño y el funcionamiento básico no ha cambiado demasiado. Casi todas las CPU comunes de hoy en día se pueden describir con precisión como máquinas de programa almacenado de von Neumann. A medida que la ya mencionada ley del Moore continúa cumpliéndose,[7]​ se han presentado preocupaciones sobre los límites de la tecnología de transistor del circuito integrado. La miniaturización extrema de puertas electrónicas está causando los efectos de fenómenos que se vuelven mucho más significativos, como la electromigración y el subumbral de pérdida. Estas nuevas preocupaciones están entre los muchos factores que hacen a los investigadores estudiar nuevos métodos de computación, como la computación cuántica, y ampliar el uso del paralelismo y de otros métodos que extienden la utilidad del modelo clásico de von Neumann."}]}, {"name": "Funcionamiento", "text": "La función fundamental de la mayoría de las CPU es ejecutar una secuencia de instrucciones almacenadas llamadas «programa». El programa está representado por una serie de números que se mantienen en una cierta clase de memoria de ordenador. Hay cuatro pasos que casi todas las CPU de arquitectura de von Neumann usan en su operación: fetch, decode, execute, y writeback, (leer, decodificar, ejecutar y escribir).", "subsections": [{"name": "Fetch", "text": "El primer paso, leer, implica recuperar una instrucción (que está representada por un número o una secuencia de números) de la memoria de programa. La localización en la memoria del programa queda determinada por un contador de programa (PC), que almacena un número que identifica la dirección de la siguiente instrucción que se debe buscar. Después de que se lee una instrucción, el PC se incrementa en la longitud de la instrucción en términos de unidades de memoria, de modo que contendrá la dirección de la siguiente instrucción en la secuencia. Frecuentemente, la instrucción a leerse debe recuperarse de la memoria, relativamente lenta, lo cual detiene la CPU mientras espera a que se devuelva la instrucción. Este problema se trata en gran medida en los procesadores modernos por los cachés y las arquitecturas pipeline (ver abajo)."}, {"name": "Decode", "text": "En el paso de decodificación, la instrucción se divide en partes que tienen significado para otras unidades de la CPU. La manera en que el valor de la instrucción numérica se interpreta está definida por la arquitectura del conjunto de instrucciones (el ISA) de la CPU. A menudo, un grupo de números en la instrucción, llamados opcode, indica qué operación realizar. Las partes restantes del número normalmente proporcionan información requerida para esa instrucción como, por ejemplo, los operandos para una operación de adición. Tales operandos se pueden dar como un valor constante (llamado valor inmediato) o como un lugar para localizar un valor, que, según lo determinado por algún modo de dirección, puede ser un registro o una dirección de memoria. En diseños más viejos las unidades del CPU responsables de decodificar la instrucción eran dispositivos de hardware fijos. Sin embargo, en CPUs e ISAs más abstractos y complicados, frecuentemente se usa un microprograma para ayudar a traducir instrucciones en varias señales de configuración para la CPU. Este microprograma a veces se puede reescribir de tal manera que puede modificarse para cambiar la manera en que la CPU decodifica instrucciones incluso después de que se haya fabricado."}, {"name": "Execute", "text": "Después de los pasos de lectura y decodificación, se lleva a cabo el paso de la ejecución de la instrucción. Durante este paso, varias unidades de la CPU se conectan de tal manera que pueden realizar la operación deseada. Si, por ejemplo, se solicitó una operación de adición, una unidad aritmético lógica (ALU) se conectará a un conjunto de entradas y un conjunto de salidas. Las entradas proporcionan los números a ser sumados, y las salidas contendrán la suma final. La ALU contiene la circuitería para realizar operaciones simples de aritmética y de lógica en las entradas, como adición y operaciones de bits (bitwise). Si la operación de adición produce un resultado demasiado grande para poder que pueda manejarlo la CPU, también puede ajustarse una bandera (flag) de desbordamiento aritmético localizada en un registro de banderas (ver abajo la sección sobre rango de números enteros)."}, {"name": "Writeback", "text": "El paso final, la escritura, simplemente «escribe» los resultados del paso de ejecución a una cierta dirección de memoria. Muy a menudo, los resultados se escriben en algún registro interno del CPU para acceso rápido por las instrucciones siguientes. En otros casos los resultados pueden escribirse en una memoria principal más lenta pero más barata y más grande. Algunos tipos de instrucciones manipulan el contador de programa en lugar de directamente producir datos de resultado. Estas se llaman generalmente «saltos» (jumps) y facilitan comportamientos como bucles, la ejecución condicional de programas (con el uso de saltos condicionales) y funciones en programas. Muchas instrucciones también cambian el estado de dígitos en un registro de «banderas». Estas banderas pueden usarse para influenciar cómo se comporta un programa, puesto que a menudo indican el resultado de varias operaciones. Por ejemplo, un tipo de instrucción de \"comparación\" considera dos valores y fija un número, en el registro de banderas, de acuerdo a cuál es el mayor. Entonces, una instrucción de salto posterior puede usar esta bandera para determinar el flujo del programa.\nDespués de la ejecución de la instrucción y de la escritura de los datos resultantes, el proceso entero se repite con el siguiente ciclo de instrucción, normalmente leyendo la siguiente instrucción en secuencia debido al valor incrementado en el contador de programa. Si la instrucción completada era un salto, se modifica el contador de programa para contener la dirección de la instrucción a la cual se saltó, y la ejecución del programa continúa normalmente. En CPUs más complejas que la descrita aquí, pueden leerse, decodificarse y ejecutarse simultáneamente múltiples instrucciones. Esta sección describe normalmente se llama \"entubado RISC clásico\" (Classic RISC pipeline), que de hecho es bastante común entre las CPU simples usadas en muchos dispositivos electrónicos, a menudo llamadas microcontroladores."}]}, {"name": "Diseño e implementación", "text": "Véanse también:\n y ", "subsections": [{"name": "Rango de enteros", "text": "La manera en la que una CPU representa los números es una opción de diseño que afecta a las más básicas formas en que el dispositivo funciona. Algunas de las primeras calculadoras digitales usaron, para representar números internamente, un modelo eléctrico del sistema de numeración decimal común (base diez). Otros ordenadores han usado sistemas de numeración más exóticos como el ternario (base tres). Casi todas las CPU modernas representan los números en forma binaria: cada dígito se representa por una cierta cantidad física de dos valores, como un voltaje \"alto\" o \"bajo\".\nCon la representación numérica están relacionados el tamaño y la precisión de los números que una CPU puede representar. En el caso de una CPU binaria, un bit se refiere a una posición significativa en los números con los que trabaja una CPU. El número de bits (o de posiciones numéricas, o dígitos) que una CPU usa para representar los números a menudo se llama \"tamaño de la palabra\", \"ancho de bits\", \"ancho de ruta de datos\", o \"precisión del número entero\" cuando se ocupa estrictamente de números enteros (en oposición a números de coma flotante). Este número difiere entre las arquitecturas y, a menudo, dentro de diferentes unidades de la misma CPU. Por ejemplo, una CPU de 8 bits maneja un rango de números que pueden representarse con ocho dígitos binarios, cada uno de los cuales tiene dos valores posibles, y en combinación los 8 bits tienen 28 o 256 números discretos. En efecto, el tamaño del número entero fija un límite de hardware en el rango de números enteros que el software \"corre\" y que la CPU puede usar directamente.\nEl rango del número entero también puede afectar al número de posiciones en memoria que la CPU puede direccionar (localizar). Por ejemplo, si una CPU binaria utiliza 32 bits para representar una dirección de memoria y cada dirección de memoria representa a un octeto (8 bits), la cantidad máxima de memoria que la CPU puede direccionar es 232 octetos, es decir, 4 GB. Esta es una vista muy simple del espacio de dirección del CPU y muchos diseños modernos usan métodos de dirección mucho más complejos como paginación para localizar más memoria que su rango entero permitiría con un espacio de dirección plano.\nNiveles más altos del rango de números enteros requieren más estructuras para manejar los dígitos adicionales y, por lo tanto, más complejidad, tamaño, uso de energía y, generalmente, coste. Por ello, no es del todo infrecuente, ver microcontroladores de 4 y 8 bits usados en aplicaciones modernas, aun cuando están disponibles CPU con un rango mucho más alto (de 16, 32, 64, e incluso 128 bits). Los microcontroladores más simples son generalmente más baratos, usan menos energía y, por lo tanto, disipan menos calor. Todo esto pueden ser consideraciones de diseño importantes para los dispositivos electrónicos. Sin embargo, en aplicaciones del extremo alto, los beneficios producidos por el rango adicional (más a menudo el espacio de dirección adicional) son más significativos y con frecuencia afectan las opciones del diseño. Para ganar algunas de las ventajas proporcionadas por las longitudes de bits tanto más bajas, como más altas, muchas CPUs están diseñadas con anchos de bit diferentes para diferentes unidades del dispositivo. Por ejemplo, el IBM System/370 usó una CPU que fue sobre todo de 32 bits, pero usó precisión de 128 bits dentro de sus unidades de coma flotante para facilitar mayor exactitud y rango de números de coma flotante.[5]​ Muchos diseños posteriores de CPU usan una mezcla de ancho de bits similar, especialmente cuando el procesador está diseñado para usos de propósito general donde se requiere un equilibrio razonable entre la capacidad de números enteros y de coma flotante."}, {"name": "Frecuencia de reloj", "text": "La mayoría de las CPU y, de hecho, la mayoría de los dispositivos de lógica secuencial, son de naturaleza síncrona. Es decir, están diseñados y operan en función de una señal de sincronización. Esta señal, conocida como señal de reloj, usualmente toma la forma de una onda cuadrada periódica. Calculando el tiempo máximo en que las señales eléctricas pueden moverse en las varias bifurcaciones de los muchos circuitos de una CPU, los diseñadores pueden seleccionar un período apropiado para la señal del reloj.\nEste período debe ser más largo que la cantidad de tiempo que necesita una señal para moverse, o propagarse en el peor de los casos. Al fijar el período del reloj a un valor bastante mayor sobre el retardo de la propagación del peor caso, es posible diseñar toda la CPU y la manera en la que mueve los datos alrededor de los \"bordes\" de la subida y bajada de la señal del reloj. Esto tiene la ventaja de simplificar la CPU significativamente, tanto en una perspectiva de diseño como en una perspectiva de cantidad de componentes. Sin embargo, esto también tiene la desventaja que toda la CPU debe esperar a sus elementos más lentos, aun cuando algunas unidades de la misma son mucho más rápidas. Esta limitación se ha compensado en gran parte por varios métodos de aumentar el paralelismo de la CPU (ver abajo).\nSin embargo, las mejoras arquitectónicas por sí solas, no solucionan todas las desventajas de CPUs globalmente síncronas. Por ejemplo, una señal de reloj está sujeta a los retardos de cualquier otra señal eléctrica. Velocidades de reloj más altas en CPUs cada vez más complejas hacen más difícil de mantener la señal del reloj en fase (sincronizada) a través de toda la unidad. Esto ha llevado a que muchas CPUs modernas requieran que se les proporcione múltiples señales de reloj idénticas, para evitar retardar una sola señal lo suficiente como para hacer a la CPU funcionar incorrectamente. Otro importante problema cuando la velocidad del reloj aumenta dramáticamente, es la cantidad de calor que es disipada por la CPU. La señal del reloj cambia constantemente, provocando la conmutación de muchos componentes (cambio de estado) sin importar si están siendo usados en ese momento. En general, un componente que está cambiando de estado, usa más energía que un elemento en un estado estático. Por lo tanto, a medida que la velocidad del reloj aumenta, así lo hace también la disipación de calor, causando que la CPU requiera soluciones de enfriamiento más efectivas.\nUn método de tratar la conmutación de componentes innecesarios se llama el clock gating, que implica apagar la señal del reloj a los componentes innecesarios, efectivamente desactivándolos. Sin embargo, esto es frecuentemente considerado como difícil de implementar y por lo tanto no ve uso común fuera de diseños de muy baja potencia. Un notable diseño de CPU tardío que utiliza una amplia compuerta del reloj para reducir los requisitos de potencia de la consola de videojuegos es la de la Xbox 360 basada en la PowerPC de IBM.[8]​ Otro método de tratar algunos de los problemas de una señal global de reloj es la completa remoción de la misma. Mientras que quitar la señal global del reloj hace, de muchas maneras, considerablemente más complejo el proceso del diseño, en comparación con diseños síncronos similares, los diseños asincrónicos (o sin reloj) tienen marcadas ventajas en el consumo de energía y la disipación de calor. Aunque se trate de algo infrecuente, las CPUs completas se han construido sin utilizar una señal global de reloj. Dos notables ejemplos de esto son el AMULET, que implementa la arquitectura del ARM, y el MiniMIPS, compatible con el MIPS R3000. En lugar de remover totalmente la señal del reloj, algunos diseños de CPU permiten que ciertas unidades del dispositivo sean asincrónicas, como por ejemplo, usando ALU en conjunción con pipelining superescalar para alcanzar algunas ganancias en el desempeño aritmético. Mientras que no esté completamente claro si los diseños totalmente asincrónicos pueden desempeñarse a un nivel comparable o mejor que sus contrapartes síncronas, es evidente que por lo menos sobresalen en las operaciones matemáticas más simples. Esto, combinado con sus excelentes características de consumo de energía y disipación de calor, los hace muy adecuados para sistemas \"embebidos\".[9]​"}, {"name": "Paralelismo", "text": "La descripción de la operación básica de un CPU ofrecida en la sección anterior describe la forma más simple que puede tomar una CPU. Este tipo de CPU, comúnmente denominado \"subescalar\", opera sobre y ejecuta una sola instrucción con uno o dos datos a la vez.\nEste proceso da lugar a una ineficacia inherente en CPU subescalares. Puesto que solamente una instrucción es ejecutada a la vez, toda la CPU debe esperar a que esa instrucción se complete antes de proceder a la siguiente instrucción. Como resultado, la CPU subescalar queda \"paralizada\" en instrucciones que toman más de un ciclo de reloj para completar su ejecución. Incluso la adición de una segunda unidad de ejecución (ver abajo) no mejora mucho el desempeño. En lugar de un camino quedando congelado, ahora dos caminos se paralizan y aumenta el número de transistores no usados. Este diseño, en el que los recursos de ejecución de la CPU pueden operar con solamente una instrucción a la vez, sólo puede, posiblemente, alcanzar el desempeño escalar (una instrucción por ciclo de reloj). Sin embargo, el desempeño casi siempre es subescalar (menos de una instrucción por ciclo).\nLas tentativas de alcanzar un desempeño escalar y mejor han resultado en una variedad de metodologías de diseño que hacen comportarse a la CPU menos linealmente y más en paralelo. Cuando se refiere al paralelismo en las CPUs, generalmente son usados dos términos para clasificar estas técnicas de diseño.\nEl paralelismo a nivel de instrucción, en inglés instruction level parallelism (ILP), busca aumentar la tasa en la cual las instrucciones son ejecutadas dentro de una CPU, es decir, aumentar la utilización de los recursos de ejecución en la pastilla.\nEl paralelismo a nivel de hilo de ejecución, en inglés thread level parallelism (TLP), que se propone incrementar el número de hilos (efectivamente programas individuales) que una CPU pueda ejecutar simultáneamente.\nCada metodología se diferencia tanto en las maneras en las que están implementadas, como en la efectividad relativa que producen en el aumento del desempeño de la CPU para una aplicación.\nILP: Segmentación y arquitectura superescalar\nArtículos principales:\nUno de los métodos más simples para lograr incrementar al paralelismo es comenzar los primeros pasos de leer y decodificar la instrucción antes de que la instrucción anterior haya terminado de ejecutarse. Esta es la forma más simple de una técnica conocida como segmentación (instruction pipelining en inglés), y es utilizada en casi todas las CPU de propósito general modernos. Al dividir la ruta de ejecución en etapas discretas, la tubería permite que más de una instrucción sea ejecutada en cualquier tiempo. Esta separación puede ser comparada a una línea de ensamblaje, en la cual una instrucción es hecha más completa en cada etapa hasta que sale de la tubería de ejecución y es retirada del mismo.\nSin embargo, la tubería introduce la posibilidad de una situación donde es necesario terminar el resultado de la operación anterior para completar la operación siguiente; una condición llamada a menudo como conflicto de dependencia de datos. Para hacer frente a esto, debe ser tomado un cuidado adicional para comprobar estas clases de condiciones, y si esto ocurre, se debe retrasar una porción de la tubería de instrucción. Naturalmente, lograr esto requiere circuitería adicional, los procesadores entubados son más complejos que los subescalares, pero no mucho. Un procesador entubado puede llegar a ser casi completamente escalar, solamente inhibido por las abruptas paradas de la tubería (una instrucción durando más de un ciclo de reloj en una etapa).\nUna mejora adicional sobre la idea del entubado de instrucción (instruction pipelining) condujo al desarrollo de un método que disminuye incluso más el tiempo ocioso de los componentes de la CPU. Diseños que se dice que son superescalares incluyen una larga tubería de instrucción y múltiples unidades de ejecución idénticas.[10]​ En una tubería superescalar, múltiples instrucciones son leídas y pasadas a un despachador, que decide si las instrucciones se pueden o no ejecutar en paralelo (simultáneamente). De ser así, son despachadas a las unidades de ejecución disponibles, dando por resultado la capacidad para que varias instrucciones sean ejecutadas simultáneamente. En general, cuanto más instrucciones una CPU superescalar es capaz de despachar simultáneamente a las unidades de ejecución en espera, más instrucciones serán completadas en un ciclo dado.\nLa mayor parte de la dificultad en el diseño de una arquitectura superescalar de CPU descansa en crear un despachador eficaz. El despachador necesita poder determinar rápida y correctamente si las instrucciones pueden ejecutarse en paralelo, tan bien como despacharlas de una manera que mantenga ocupadas tantas unidades de ejecución como sea posible. Esto requiere que la tubería de instrucción sea llenada tan a menudo como sea posible y se incrementa la necesidad, en las arquitecturas superescalares, de cantidades significativas de caché de CPU. Esto también crea técnicas para evitar peligros como la predicción de bifurcación, ejecución especulativa, y la ejecución fuera de orden, cruciales para mantener altos niveles de desempeño. Tratando de predecir qué rama (o trayectoria) tomará una instrucción condicional, la CPU puede minimizar el número de veces que todo el canal debe esperar hasta que se complete una instrucción condicional. Frecuentemente, la ejecución especulativa proporciona aumentos modestos del desempeño al ejecutar porciones de código que no puede ser necesario después de completarse una operación condicional. Fuera de la orden de ejecución cambia de algún modo el orden en que se ejecutan las instrucciones para reducir retardos debido a las dependencias de datos. También en el caso de instrucciones individuales de datos múltiples — los procesadores modernos, en caso de que se hayan procesado una gran cantidad de datos del mismo tipo, pueden desactivar partes de la tubería de manera que cuando se ejecuta una sola sentencia muchas veces, la CPU salta la captación y decodifica fases y por lo tanto aumenta considerablemente el rendimiento en ciertas ocasiones, sobre todo en los motores de programas altamente monótonos como el software de creación de video y procesamiento de fotografías.\nEn el caso donde una porción de la CPU es superescalar y una parte no lo es, la parte que no es superescalar sufre en el desempeño debido a las paradas de horario. El Intel Pentium original (P5) tenía dos ALUs superescalares que podían aceptar, cada una, una instrucción por ciclo de reloj, pero su FPU no podía aceptar una instrucción por ciclo de reloj. Así el P5 era superescalar en la parte de números enteros pero no era superescalar de números de coma (o punto [decimal]) flotante. El sucesor a la arquitectura del Pentium de Intel, el P6, agregó capacidades superescalares a sus funciones de coma flotante, y por lo tanto produjo un significativo aumento en el desempeño de este tipo de instrucciones.\nTanto el diseño superescalar como el entubado simple aumentan el ILP de una CPU al permitir a un solo procesador completar la ejecución de instrucciones en ratios que sobrepasan una instrucción por ciclo (IPC). La mayoría de los modernos diseños de CPU son por lo menos algo superescalares, y en la última década, casi todos los diseños de CPU de propósito general son superescalares. En los últimos años algo del énfasis en el diseño de computadores de alto ILP se ha movido del hardware de la CPU hacia su interfaz de software, o ISA. La estrategia very long instruction word o VLIW, causa a algún ILP a ser implícito directamente por el software, reduciendo la cantidad de trabajo que la CPU debe realizar para darle un empuje significativo al ILP y por lo tanto reducir la complejidad del diseño.\nParalelismo a nivel de hilos\nOtra estrategia para lograr el rendimiento es ejecutar varios programas o hilos en paralelo. Esta área de investigación se conoce como computación paralela. En la taxonomía de Flynn, esta estrategia se conoce como múltiples instrucciones de varios datos o MIMD.\nUna tecnología utilizada para este propósito fue el multiprocesamiento (MP). El puntapié inicial de esta tecnología se conoce como multiprocesamiento simétrico (SMP), donde un pequeño número de CPU comparten una visión coherente de su sistema de memoria. En este esquema, cada CPU tiene un hardware adicional para mantener una visión constantemente actualizada de la memoria. Para evitar visitas rancias de la memoria, las CPU pueden cooperar en el mismo programa y los programas pueden migrar desde una CPU a otra. Para aumentar el número de CPUs que cooperan más allá de unas pocas, se introdujeron en 1990, los esquemas tales como el non-uniform memory Access (acceso no uniforme a memoria) (NUMA) y los protocolos de coherencia basados en directorios. Los sistemas SMP se limitan a un pequeño número de CPU mientras que los sistemas NUMA se han construido con miles de procesadores. Inicialmente, el multiprocesamiento se construyó usando múltiples CPUs discretas y tableros para implementar la interconexión entre los procesadores. Cuando los procesadores y su interconexión hayan sido implementadas en un único chip de silicio, la tecnología se conoce como un procesador multinúcleo.\nPosteriormente, se reconoció que existía un paralelismo muy estrecho con un único programa. Un único programa podría tener varios hilos (o funciones) que podrían ser ejecutadas por separado o en paralelo. Algunos de los primeros ejemplos de esta tecnología implementaba procesamiento de entrada/salida tales como el acceso directo a memoria como un hilo separado del hilo computado. En la década de 1970, se introdujo un enfoque más general a esta tecnología, cuando se diseñaron sistemas para ejecutar múltiples hilos de computación en paralelo. Esta tecnología se conoce como multihilo (MT).\nEste enfoque se considera más rentable que la del multiprocesamiento, ya que solo se replica un pequeño número de componentes dentro de una CPU para soportar MT en oposición a la totalidad de la CPU en el caso de MP. En MT, las unidades de ejecución y el sistema de memoria incluyendo los cachés son compartidos entre varios hilos. La desventaja de MT es que el soporte de hardware para multihilo es más visible para el software que la de MP y por lo tanto el software supervisor como el de los sistemas operativos tienen que someterse a los cambios más grandes para apoyar MT. Un tipo de MT que se implementó es conocido como bloque multihilo, donde se ejecuta un hilo hasta que se paralice esperando que regresen los datos desde la memoria externa. En este esquema, la CPU tendría luego que cambiar rápidamente a otro hilo que está listo para funcionar, el interruptor muchas veces realiza un ciclo de reloj de la CPU, como la tecnología UltraSPARC. Otro tipo de MT se denomina multihilo simultáneo, en donde las instrucciones de múltiples hilos se ejecutan en paralelo dentro de un ciclo de reloj de la CPU.\nParalelismo de datos\nUn menos común pero cada vez más importante paradigma de CPU (y de hecho, de computación en general) trata con vectores. Los procesadores de los que se ha hablado anteriormente son todos referidos como cierto tipo de dispositivo escalar. Como implica su nombre, los procesadores vectoriales se ocupan de múltiples piezas de datos en el contexto de una instrucción, esto contrasta con los procesadores escalares, que tratan una pieza de dato por cada instrucción. Estos dos esquemas de ocuparse de los datos son generalmente referidos respectivamente como SISD (single instruction, single data) y SIMD (single instruction, multiple data). La gran utilidad en crear CPUs que se ocupen de vectores de datos radica en la optimización de tareas que tienden a requerir la misma operación, por ejemplo, una suma, o un producto escalar, a ser realizado en un gran conjunto de datos. Algunos ejemplos clásicos de este tipo de tareas son las aplicaciones multimedia (imágenes, vídeo, y sonido), así como muchos tipos de tareas científicas y de ingeniería. Mientras que una CPU escalar debe completar todo el proceso de leer, decodificar, y ejecutar cada instrucción y valor en un conjunto de datos, una CPU vectorial puede realizar una simple operación en un comparativamente grande conjunto de datos con una sola instrucción. Por supuesto, esto es solamente posible cuando la aplicación tiende a requerir muchos pasos que apliquen una operación a un conjunto grande de datos.\nLa mayoría de las primeras CPU vectoriales, como el Cray-1, se asociaron casi exclusivamente a aplicaciones de investigación científica y criptografía. Sin embargo, a medida que la multimedia se desplazó en gran parte a medios digitales, ha llegado a ser significativa la necesidad de una cierta forma de SIMD en CPUs de propósito general. Poco después de que comenzara a ser común incluir unidades de coma flotante en procesadores de uso general, también comenzaron a aparecer especificaciones e implementaciones de unidades de ejecución SIMD para las CPU de uso general. Algunas de estas primeras especificaciones SIMD, como el MMX de Intel, fueron solamente para números enteros. Esto demostró ser un impedimento significativo para algunos desarrolladores de software, ya que muchas de las aplicaciones que se beneficiaban del SIMD trataban sobre todo con números de coma flotante. Progresivamente, estos primeros diseños fueron refinados y rehechos en alguna de las comunes, modernas especificaciones SIMD, que generalmente están asociadas a un ISA. Algunos ejemplos modernos notables son el SSE de Intel y el AltiVec relacionado con el PowerPC (también conocido como VMX)."}]}, {"name": "Desempeño", "text": "Véase también:\nEl \"rendimiento\" (performance) o la velocidad de un procesador depende de, entre muchos otros factores, la velocidad del reloj (generalmente dada en múltiplos de hertz) y las instrucciones por ciclo de reloj (IPC), que juntos son los factores para las instrucciones por segundo (IPS) que la CPU puede rendir.[11]​\nMuchos reportes de valores IPS han representado tasas de ejecución \"pico\" en secuencias de instrucciones artificiales con pocas ramas, mientras que las cargas de trabajo realistas consisten en una combinación de instrucciones y de aplicaciones, algunas de las cuales requieren más tiempo para ejecutar que otras. El rendimiento de la jerarquía de memoria también afecta en gran medida al rendimiento del procesador, un tema muy poco tenido en cuenta en los cálculos de MIPS. Debido a estos problemas, para este fin, se han desarrollado varios exámenes estandarizados, tales como SPECint muchas veces llamados \"puntos de referencia\" - para tratar de medir el rendimiento real efectivo en aplicaciones de uso cotidiano.\nEl desempeño de procesamiento de los ordenadores se incrementa utilizando procesadores multinúcleo, que en esencia es conectar dos o más procesadores individuales (llamados núcleos en este sentido) en un solo circuito integrado.[12]​ Idealmente, un procesador de doble núcleo sería casi dos veces tan potente como un procesador de núcleo único. En la práctica, la ganancia de desempeño es mucho menor, solo alrededor del 50%,[13]​ debido a la implementación de algoritmos imperfectos de software.[14]​ El aumento del número de núcleos en un procesador (es decir, dual-core, quad-core, etc) aumenta la carga de trabajo que se puede manejar. Esto significa que el procesador ahora puede manejar numerosos eventos asíncronos, interrupciones, etc que pueden tomar un \"peaje\" en la CPU (Central Processing Unit) cuando se abruma. Estos núcleos pueden considerarse como diferentes plantas en una planta de procesamiento, con el manejo de cada piso una tarea diferente. En ocasiones, estos núcleos se manejan las mismas tareas que los núcleos adyacentes a ellos si un solo núcleo no es suficiente para manejar la información.\nDebido a las capacidades específicas de las CPU modernas, como HyperThreading y Uncore, que implican el intercambio de recursos reales de la CPU mientras que el objetivo de una mayor utilización, supervisar los niveles de rendimiento y la utilización del hardware se fue convirtiendo gradualmente en una tarea más compleja. Como respuesta, algunas CPUs implementan lógica de hardware adicional que controla la utilización real de las diversas partes de una CPU y proporciona varios contadores accesibles a software; un ejemplo es la tecnología Performance Counter Monitor (\"Monitor de contador de rendimiento\") de Intel.[15]​", "subsections": []}, {"name": "Véase también", "text": "Accelerated processing unit\nModos de direccionamiento\nComplex instruction set computing (CISC)\nBus (informática)\nIngeniería en computación\nVoltaje del núcleo de la CPU\nZócalo de CPU\nRefrigeración líquida (informática)\nProcesador digital de señal\nHyperThreading\nMicroprocesador\nProcesador multinúcleo\nAnillo de seguridad\nReduced instruction set computing (RISC)", "subsections": []}, {"name": "Referencias", "text": "↑ «¿Qué es la unidad central de procesamiento (CPU)?». IONOS Digital Guide. Consultado el 11 de noviembre de 2022. \n↑ First Draft of a Report on the EDVAC (en inglés). Moore School of Electrical Engineering, Universidad de Pennsylvania. 1945. Archivado desde el original el 23 de abril de 2004. \n↑ Enticknap, Nicholas (Verano de 1998), «Computing's Golden Jubilee» [Jubileo de Oro de la computación], Resurrection (en inglés) (The Computer Conservation Society) 20, ISSN 0958-7403, archivado desde el original el 9 de enero de 2012, consultado el 19 de abril de 2008 .\n↑ Weik, Martin H. (1961). A Third Survey of Domestic Electronic Digital Computing Systems (en inglés). Ballistic Research Laboratories. \n↑ a b Amdahl, G. M., Blaauw, G. A., & Brooks, F. P. Jr. (1964). Architecture of the IBM System/360 (en inglés). IBM Research. Archivado desde el original el 5 de febrero de 2007. \n↑ Digital Equipment Corporation (noviembre de 1975). «LSI-11 Module Descriptions». LSI-11, PDP-11/03 user's manual (en inglés) (2da edición). Maynard, Massachusetts: Digital Equipment Corporation. pp. 4-3. Archivado desde el original el 24 de mayo de 2006. \n↑ a b Excerpts from A Conversation with Gordon Moore: Moore's Law (PDF) (en inglés). Intel. 2005. Archivado desde el original el 29 de octubre de 2012. Consultado el 25 de julio de 2012. \n↑ Brown, Jeffery (2005). «Application-customized CPU design» (en inglés). IBM developerWorks. Consultado el 17 de diciembre de 2005. \n↑ Garside, J. D., Furber, S. B., & Chung, S-H (1999). AMULET3 Revealed (en inglés). University of Manchester Computer Science Department. Archivado desde el original el 10 de diciembre de 2005. \n↑ Huynh, Jack (2003). «The AMD Athlon XP Processor with 512KB L2 Cache» (en inglés). University of Illinois — Urbana-Champaign. pp. 6-11. Archivado desde el original el 28 de noviembre de 2007. Consultado el 6 de octubre de 2007. \n↑ «CPU Frequency». CPU World Glossary (en inglés). CPU World. 25 de marzo de 2008. Consultado el 1 de enero de 2010. \n↑ «What is (a) multi-core processor?». Data Center Definitions (en inglés). SearchDataCenter.com. 27 de marzo de 2007. Consultado el 1 de enero de 2010. \n↑ «Guía para configurar y montar un PC Gaming por piezas». Consultado el 9 de mayo de 2018. \n↑ «Quad Core Vs. Dual Core». http://www.buzzle.com/. Archivado desde el original el 25 de julio de 2015. Consultado el 26 de noviembre de 2014. \n↑ Thomas Willhalm; Roman Dementiev; Patrick Fay (18 de diciembre de 2014). «Intel Performance Counter Monitor A better way to measure CPU utilization» (en inglés). Consultado el 17 de febrero de 2015. ", "subsections": []}, {"name": "Bibliografía", "text": "Amdahl, G. M., Blaauw, G. A., & Brooks, F. P. Jr. (1964). Architecture of the IBM System/360. IBM Research. \nBrown, Jeffery (2005). «Application-customized CPU design». IBM developerWorks. Consultado el 17 de diciembre de 2005. \nDigital Equipment Corporation (noviembre de 1975). «LSI-11 Module Descriptions». LSI-11, PDP-11/03 user's manual (2da edición edición). Maynard, Massachusetts: Digital Equipment Corporation. pp. 4-3.  La referencia utiliza el parámetro obsoleto |mes= (ayuda)\nGarside, J. D., Furber, S. B., & Chung, S-H (1999). AMULET3 Revealed. University of Manchester Computer Science Department. \nHennessy, John A.; Goldberg, David (1996). Computer Architecture: A Quantitative Approach. Morgan Kaufmann Publishers. ISBN 1-55860-329-8. \nMIPS Technologies, Inc. (2005). MIPS32® Architecture For Programmers Volume II: The MIPS32® Instruction Set. MIPS Technologies, Inc. Archivado desde el original el 18 de marzo de 2006. \nSmotherman, Mark (2005). «History of Multithreading». Consultado el 19 de diciembre de 2005. \nvon Neumann, John (1945). First Draft of a Report on the EDVAC. Moore School of Electrical Engineering, University of Pennsylvania. Archivado desde el original el 23 de abril de 2004. \nWeik, Martin H. (1961). A Third Survey of Domestic Electronic Digital Computing Systems. Ballistic Research Laboratories. ", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una categoría multimedia sobre Unidad central de procesamiento.", "subsections": [{"name": "Diseños de microprocesador", "text": " Wikiversidad alberga proyectos de aprendizaje sobre Unidad central de procesamiento. (en inglés)\nComo trabajan los microprocesadores en HowStuffWorks. (en inglés)\n25 Microchips que sacudieron al mundo – un artículo del Instituto de Ingeniería Eléctrica y Electrónica. (en inglés)\nAdvanced Micro Devices - Advanced Micro Devices, un diseñador de principalmente CPUs de ordenador personal compatible con x86. (en inglés)\nARM Ltd - ARM Ltd, uno de los pocos diseñadores de CPU que se benefician únicamente por licenciar sus diseños en lugar de fabricarlos. Los microprocesadores de arquitectura ARM se encuentran entre los más populares en el mundo para aplicaciones embebidas. (en inglés)\nFreescale Semiconductor (antes de Motorola) - Freescale Semiconductor, diseñador de varios procesadores embebidos basados en PowerPC y SoC. (en inglés)\nIBM Microelectronics - División de Microelectrónica de IBM, que es responsable de mucho en diseños basados en POWER y PowerPC, incluyendo muchas de las CPU utilizadas en las últimas consolas de videojuegos de 2012. (en inglés)\nIntel Corp - un fabricante de varias líneas de CPU notables, incluyendo IA-32, IA-64, y XScale. También es un fabricante de chips de diferentes periféricos para su uso con su CPU. (en inglés)\nMIPS Technologies - MIPS Technologies, desarrolladores de la arquitectura MIPS, pionero en diseños RISC. (en inglés)\nSun Microsystems - Sun Microsystems, desarrolladores de la arquitectura SPARC, un diseño RISC. (en inglés)\nTexas Instruments (enlace roto disponible en Internet Archive; véase el historial, la primera versión y la última). - Texas Instruments, división de semiconductores. Diseña y fabrica varios tipos de microcontroladores de bajo consumo entre sus muchos otros productos semiconductores. (en inglés)\nTransmeta - Transmeta Corporation. Creadores de x86 de baja potencia compatibles, como Crusoe y Efficeon. (en inglés)"}, {"name": "Lectura adicional", "text": "Diseño del procesador: Una introducción - Introducción detallada al diseño de microprocesadores. (en inglés)\nCómo trabajan los microprocesadores. (en inglés)\nPipelining: An Overview - Buena introducción y visión general acerca de las técnicas de tuberías de CPU por el personal de Ars Technica. (en inglés)\nSIMD Architectures - Introducción y explicación de SIMD, sobre todo cómo se relaciona con los ordenadores personales. También por Ars Technica. (en inglés)\nListado de procesadores - Nombres de CPUs y principales características. (en inglés)\nEsta obra contiene una traducción total derivada de «Central processing unit» de Wikipedia en inglés, concretamente de esta versión, publicada por sus editores bajo la Licencia de documentación libre de GNU y la Licencia Creative Commons Atribución-CompartirIgual 4.0 Internacional.\n[1] - cyber security software, software developer. (en inglés)"}]}]}
{"url": "https://es.wikipedia.org/wiki/Casete", "title": "Casete", "summary": "El casete[1]​ o caset,[2]​ también conocido como casete compacto o cassette («cajita» en francés), es un formato de grabación de sonido o video en cinta magnética que fue ampliamente utilizado entre principios de la década de 1970 y fines de la década de 1990. Es también mencionado a menudo como casete de audio o cinta casete. Aunque estuvieron previstos originalmente como medio para el dictado, las mejoras en la fidelidad del sonido condujeron a que el casete suplantara la grabación en magnetófono de bobina abierta en la mayoría de sus usos domésticos.[3]​ Sus aplicaciones se extendieron desde el audio portátil de grabación casera al almacenamiento de datos para computadoras. En la etapa de su vigencia, era uno de los dos formatos más comunes para la música pregrabada, junto a los discos de vinilo. Fueron reemplazados más adelante por el disco compacto.\n[4]​\nConstan de dos carretes en miniatura, entre los cuales se pasa una cinta magnética. Estos carretes y sus otras piezas se encuentran dentro de una carcasa protectora de plástico. En la cinta están disponibles dos pares de pistas estereofónicas, uno por cada cara (una cara se reproduce cuando el casete se inserta con sus revestimientos laterales de cara A o lado A para arriba y la otra cuando se le da la vuelta, cara B o lado B).[5]​\nEl casete es un soporte analógico, aunque también se desarrollaron formatos de cinta digitales, como la cinta de audio digital (DAT) y el casete compacto digital (DCC).", "sections": [{"name": "Historia", "text": "Fue introducido en Europa por la empresa Philips en 1962, y en los Estados Unidos en 1964, bajo marca registrada con el nombre de Compact Cassette. Aunque había otros sistemas de cartucho de cinta magnética en ese entonces, llegó a ser dominante como resultado de la decisión de Philips (en respuesta a la presión de Sony) de licenciar el formato gratuitamente. Se convirtió entonces en una alternativa popular y regrabable al disco de vinilo durante los años setenta.[4]​", "subsections": [{"name": "Introducción de los casetes de música", "text": "La producción en masa de Audio Casetes Compactos comenzó en 1964, en Hannover, Alemania. También conocidos como Musicasetes (abreviado M.C.), fueron lanzados en Europa a finales de 1965. Fueron introducidos en Estados Unidos en septiembre de 1966 con una oferta inicial de cuarenta y nueve títulos por The Mercury Record Company, una filial estadounidense de Philips.[6]​\nSin embargo, había sido inicialmente diseñado para dictado y uso portátil; la calidad de los primeros reproductores no era adecuada para la música, y además los primeros modelos tenían fallos de diseño mecánico. En 1971, Advent Corporation introdujo su modelo 201 que combinó la reducción de ruidos Dolby tipo B con una cinta de dióxido de cromo (CrO2). El resultado fue un formato apto para el uso musical y el comienzo de la era de casetes y reproductores de alta fidelidad.\nDurante los años 1980, su popularidad creció más, como resultado de las grabadoras portátiles de bolsillo y los reproductores de alta fidelidad como el walkman de Sony, cuyo tamaño no era mucho mayor que el del propio casete.\nAparte de los avances puramente técnicos, también sirvieron como catalizadores para el cambio social. Su durabilidad y facilidad de copiado ayudaron a traer música rock underground y punk detrás del telón de acero, creando un equilibrio para la cultura occidental entre las generaciones más jóvenes. Por razones similares, llegaron a ser populares en países en desarrollo. En los años 1970 en la India, fueron culpados de traer influencias indeseadas en áreas tradicionalmente religiosas.[cita requerida] La tecnología del casete creó un mercado en crecimiento para la música popular en la India, criticado por conservadores mientras que creaba un mercado enorme para las compañías legítimas de la grabación y las cintas pirateadas."}, {"name": "Auge", "text": "Cuando se introdujo, era un medio para la reproducción de la música pregrabada portátil, pero con la llegada de las versiones estereofónicas, se convirtió en el medio de grabación doméstica por excelencia durante más de veinte años. Pioneer creó los grabadores domésticos de alta fidelidad CTF 6060, CTF 7070, etc. y Sony sus grabadores o pletinas (equipos modulares) TCK5, TCK6, TCK7 etc. entre otros fabricantes.[cita requerida]\nLa calidad del sonido evolucionó con los cabezales de permaloy y ferrita sólida que emplearon Akai, Pioneer, Technics y Sony[cita requerida] y sobre todo con las mejoras en las cintas. TDK ofreció cintas de media gama (como AD-C60) que permitían una respuesta en frecuencia máxima entre 60 Hz y 12 kHz.\nLas cintas con formulación de dióxido de cromo (CrO2) surgieron para ofrecer en las grabaciones mejor respuesta en los sonidos agudos gracias al uso de partículas magnéticas más pequeñas, [cita requerida] pero las primeras que salieron al mercado solían ser más abrasivas para el cabezal magnético. Después se introducirían cintas con material magnético que combinaba el óxido férrico con alguna otra sustancia que daba mejores resultados que el dióxido de cromo, como en el caso del fabricante TDK, con la introducción de las cintas con recubrimiento de partículas de la línea Super Avilyn, que es un ion de cobalto adsorbido en óxido férrico.[cita requerida] Esta formulación permitió grabar frecuencias agudas casi en el extremo audible sin mayores problemas, y un ruido de polarización de unos –77 decibelios. Estas nuevas partículas extendían la banda de audio y reducían la distorsión, pero requerían nuevas grabadoras para aprovechar su calidad. Esencialmente, para que las cintas no distorsionasen al ser magnetizadas, una señal de polarización se introducía junto con la señal musical, permitiendo que el proceso de magnetización se llevara a cabo con distorsión mínima y alta linealidad. El circuito de filtrado tenía una constante de tiempo de 120 microsegundos (polarización normal) para las cintas de Fe2O3 y FeCr, y de 70 microsegundos (polarización alta) para los de CrO2-SA.\nSony, Basf, y Maxell también ofrecieron cintas de calidad mejorada para aprovechar el casete como medio semiprofesional. A tal efecto, todas en mayor o menor medida ofrecieron cintas con formulaciones derivadas del concepto del Super-Avilyn, como la Maxell UD-XL2.\nHacia 1978 comenzó la introducción de la cinta de partícula metálica pura.[cita requerida] Con una respuesta a frecuencia plana de 20 Hz a 20 kHz a 0 dB, con esta cinta se podía llegar a grabar señales de frecuencias de hasta 50 000 Hz en –20 dB, y al ser un recubrimiento puramente metálico sobre la cinta plástica, la corriente para borrar la cinta era más elevada que en el resto de las formulaciones, pero esto a su vez daba una elevada duración al registro magnético. Se puede escuchar una grabación realizada en este tipo de cinta después de más de veinte años prácticamente sin pérdida alguna de calidad. Para poder aprovechar al máximo esta posibilidad, los fabricantes de reproductores de casete introdujeron cabezales magnéticos tallados con suma precisión, y recubiertos con una pastilla de carburo de tungsteno (widia) que retardaba el desgaste. El fabricante japonés Canon fue un reconocido proveedor de esta pieza.[cita requerida]\nEl desarrollo del video hogareño, como el formato Beta de Sony y el VHS de JVC, llevaron a empresas como TDK a diseñar cintas de partículas aptas para grabar señales de hasta 8 MHz (Super Finavynx Metal Particle), y a ofrecer en formato de casete de audio algunas cintas con formulación derivada de estas, como el TDK-MA-X. Maxell presentó a principios de los años ochenta el producto Maxell Metal Vertex, considerado por muchos como el ápice de la tecnología de casete compacto de audio, con una carcasa de material cerámico que era prácticamente indeformable y aseguraba la correcta posición del casete dentro del equipo reproductor.\nDurante este periodo, se fabricaron grabadoras con mecanismos de gran refinamiento que reducían el lloro (wow and flutter), sistemas de reducción de ruido, calibración independiente de todos los parámetros y entradas múltiples como si fuesen pequeñas consolas. Los mejores modelos provinieron de la firma japonesa Nakamichi, de Pioneer con su línea Elite, y de TASCAM (TEAC Professional) con su serie de equipos para uso profesional y de radiodifusión. La firma alemana Dual también había introducido mecanismos especiales para los equipos que permitían que el usuario pudiese cambiar el casete en pleno funcionamiento del aparato, sensores de proximidad hacían bascular instantáneamente los cabezales y cabrestantes al percibir la mano del operador, con lo cual se aseguraba un cambio de casete en 2 segundos. La firma Studer-Revox también contribuyó mucho a la aceptación del casete como medio de alta fidelidad.\nLos sistemas reductores de ruido, en especial los concebidos por la firma estadounidense Dolby Laboratories fueron también factores de éxito para el formato.[cita requerida]"}, {"name": "Declive", "text": "En los países occidentales, el mercado para los casetes comenzó un declive desde su pico al final de la década de 1990. Esto se ha notado particularmente con los casetes pregrabados, cuyas ventas fueron alcanzadas por las de los CD al principio de esos años.[cita requerida] En 1993, solo los envíos de CD alcanzaron 5 millones, un aumento del 21 %, mientras que los envíos de casete disminuyeron un 7 % (a aproximadamente 3,4 millones).\nEn 2001, los casetes constituyeron solamente el 4 % de toda la música vendida en los Estados Unidos[cita requerida]. Sin embargo, los casetes en blanco se siguen produciendo y las instalaciones para la duplicación del casete siguen disponibles.\nMientras que las grabadoras de voz digitales son campo común, las grabadoras de casete (o con frecuencia microcasete) tienden a ser más baratas y de calidad suficiente como para tomar notas en situaciones de oficina o educativas. Se venden en casete audiolibros, servicios de iglesia y otros materiales hablados[cita requerida], pues una fidelidad más baja no suele ser una desventaja para tal contenido. Mientras que la mayoría de los editores venden audiolibros en CD, generalmente también ofrecen una versión en casete en un precio bajo. En el uso de los audiolibros, donde las grabaciones pueden durar varias horas, los casetes también tienen la ventaja del soporte de 120 minutos de diálogo mientras que el CD medio sostiene menos de 80.\nMientras que los casetes y el equipo relacionado se han marginado cada vez más en el campo de las ventas comerciales de música, la grabación en cinta analógica sigue siendo una opción deseable[cita requerida] para algunos. En 2002, Imation recibió una concesión de 11,9 millones de dólares del Instituto Nacional de Estándares y Tecnología para realizar una investigación con el fin de aumentar la capacidad de datos de la cinta magnética.\nAlgunos músicos prefieren registrar sus másteres en cinta magnética por razones artísticas[cita requerida], y algunos consumidores prefieren comprar casetes debido a la mayor riqueza del sonido analógico.[cita requerida]\nEs utilizado también para grabar declaraciones policiales debido a su versatilidad y durabilidad. En 2010 existían 43 fuerzas policiales en Inglaterra y Gales que lo utilizaban, y según el cálculo para 2011 de la Agencia Nacional de Mejoramiento Policial, cada una usaría más de 200 000 cintas al año. Según Neil Carlton, inspector de la policía de Cumbria, en el noroeste de Inglaterra: «Las cintas son un sistema muy simple, muy bueno. Se sella en presencia de la persona, quien lo firma junto a su abogado, si está presente. En el caso de que el sello haya sido abierto, resulta bastante obvio».[7]​\nA finales de diciembre de 2008, las compañías fabricantes del casete han dejado de producirlo y abandonaron el mercado definitivamente [cita requerida], ya que este ha sido fuertemente desplazado por los medios digitales como el MP3 y el MPEG-4, así como los soportes físicos digitales más recientes, como el disco Blu-ray, equivalente a más de 80 casetes.\nNo obstante, a pesar de su aparente obsolescencia, el formato continua vigente gracias a una compañía estadounidense llamada National Audio Company de Springfield (Misuri). La cual se considera popularmente como la última fábrica de casetes del mundo. Esta empresa ha sostenido acuerdos recientes con discográficas que lanzan material en este mismo formato (Ej. algunas de las canciones que se escuchan en la película Guardianes de la Galaxia se editaron en este mismo soporte) para tiempos recientes tienen ventas superiores a lo que en años anteriores se había logrado gracias a que la compañía compró gran parte de la maquinaria que dejó la competencia al abandonar la producción.[8]​"}]}, {"name": "Características", "text": "Para grabar las cintas magnéticas se utiliza el sistema de grabación mecánica analógica.\nEl casete se compone de una tira de plástico de grosor fino para que sea flexible y alargada, que puede llegar a tener varios metros de longitud. Esta tira de plástico lleva una fina capa de material magnético que guarda los datos al orientarse los polos magnéticos gracias a la acción de un cabezal lector/escritor. Esta cinta está protegida por una caja rectangular y plana de plástico que tiene dos bobinas con capacidad de giro que están unidas a ambos extremos de la cinta (la tira de plástico).\nEl casete fue un paso adelante en conveniencia desde los magnetófonos, aunque debido a sus limitaciones de tamaño y velocidad, la calidad fue inicialmente pobre en comparación con estos. El ancho de la cinta es de 3,81 mm, ocupando cada pista estéreo 0,79 mm. La velocidad de reproducción es de 47,6 mm/s (milímetros por segundo), de derecha a izquierda.[7]​ En comparación, el típico magnetófono para uso de consumidor tenía un ancho de cinta de 6,35 mm (con cada pista estéreo ocupando 1,59 mm) y una velocidad de 95 o 190 mm/s.\nEl reproductor de cintas magnéticas o casetes se llama pletina (deck) y, si es compacto y portátil, walkman.\nWalkman (caminando por Manhattan) es una marca registrada por la corporación Sony de Japón para sus reproductores de casetes portátiles, originalmente se llamaba Sound About en su primer modelo el Sony TP LS 2.[cita requerida]\nEl casete de audio ofrecía originalmente un registro monofónico de 60 minutos con una gama de 60a 8000 Hz (±3 dB) con una relación señal a ruido de 40 dB que era apropiado para grabar dictados, llegando a los 50 a 10 000 Hz con la TC-150 de Sony, posteriormente se mejoró para ofrecer estereofonía con dos canales separados 30 dB una gama de frecuencias de 50 a 12 000 Hz (±3 dB) y una relación señal a ruido de 45dB que es apropiada para oír música, así se incluyó en los radiograbadores portátiles estereofónico (boombox) como el Panasonic RX-CT 840.\nLos reproductores modulares (pletina) básicos provistos de reducción de ruido Dolby B tienen una respuesta en frecuencia de 40 Hz a 13 kHz (±3 dB) con cinta normal y 40 Hz a 15 kHz (±3 dB) con cinta de dióxido de cromo una relación señal ruido de 53 db y 61 dB con el sistema Dolby activado, distorsiones por debajo del 1% y un gimoteo o trémolo menor que 0,1%, como la Yamaha TC-511S. \nLas grabadoras de gama media tienen cabezales de ferrita, con una respuesta en frecuencia de 30 Hz a 17 kHz (±3 dB), una relación señal sobre ruido s/n de 52 dB y 62 dB con el Dolby B, una distorsión menor que 0,8 % y una fluctuación de la velocidad de arrastre (wow and flutter) de solo 0,07 %, como la Pioneer CT-F707.\nExisten por supuesto los decks de casete o pletinas de gama alta, que pasaron de poseer dos a tres cabezales y a utilizar cabezales amorfos, bajo trémolo y lloro ente el 0,032 y el 0,022 % introdujeron refinamientos como contadores electrónicos de cinta, Dolby C , Servosistema Dolby HX Pro, y posteriormente en 1990 el Dolby S. Se destacan equipos como Nakamichi Dragon o Pioneer CT 91,93,95, esta última con tecnología Wide Range, que le permitía alcanzar 15/30 000 Hz con cinta de metal y relación señal ruido de 86 dB con Dolby S. Sony TC/K3ES, 6 ES, 7 ES, SONY TC/K808ES, TECHNICS RS/B965, RS/Z6 Y 7, YAMAHA KX682SE, JVC TD/662BK, DENON DRM/800, AKAI GX/95 Y 65, SANSUI DM990, entre otras. \nEl empleo de cinta magnética como soporte de datos ha sido continuo desde hace más de 50 años. Como medio de almacenamiento digital tiene la ventaja de ser muy barata respecto a otros soportes informáticos, y el inconveniente de que las cargas requieren de un largo tiempo de espera, además de que de producirse un error durante la carga, según el formato de grabación de los datos hay que rebobinar la cinta y comenzar desde el principio. Con la popularización de los microordenadores como el ZX Spectrum, Amstrad CPC, Commodore 64 o MSX entre otros, se empleó el casete compacto convencional como medio de almacenamiento, además de otros formatos de casete. Tras la aparición del IBM PC (cuya primera versión también incluía un puerto para conectar una unidad de casete que funcionaba solo para programas en BASIC) y posteriormente los compatibles PC en el mercado doméstico el uso como soporte principal de datos del casete prácticamente desapareció a este nivel, aunque sí se mantuvo como soporte para copias de seguridad, ya con formatos específicos distintos del compacto de audio.", "subsections": []}, {"name": "Tipo de cintas de casete", "text": "", "subsections": [{"name": "Longitud", "text": "El casete, dependiendo de la longitud de la cinta, permite diversas duraciones de grabación. Precisamente el nombre de la cinta ya indica la duración de la misma. La más pequeña, la C5, permite 5 minutos, dos minutos y medio por cara. La más larga, C120, permite dos horas de grabación (60 minutos por cara).\nA mayor longitud, más delgadas son las cintas, con el fin de que quepan en el mismo cartucho que las de menor longitud. Cuando más delgadas sean las cintas peor se adaptan a las guías del propio cartucho, lo que puede provocar un mal contacto cabeza-cinta que puede originar que la cinta se desenrolle y se enganche pudiendo estropearse o estropear el reproductor.\nLos fabricantes desaconsejan enérgicamente el uso de C120 y, en menor medida, de C90. Además, a mayor longitud, la cinta pesa más con lo que se acorta la vida útil del cabezal. El deficiente contacto cabeza-cinta también puede provocar pérdidas en respuesta de frecuencia y otros problemas."}, {"name": "Material magnético", "text": "Se utilizan diversos tipos de material magnético para los casetes. Cada uno de ellos tiene diferentes requerimientos de polarización (bias) y ecualización. Según este material se puede distinguir cuatro tipos de cintas:\nCintas IEC tipo I o de tipo normal. Están basadas en óxido férrico gamma (Fe2O3) y fue el tipo original de cintas. Usan una ecualización de 120 µs.\nCintas IEC tipo II. Alrededor de 1970, 3M desarrolló un proceso de cobalto combinado con una técnica de double-coating con el objetivo de incrementar el volumen promedio de salida de la cinta. Al mismo tiempo, BASF introdujo el dióxido de cromo (CrO2).[9]​ Este tipo de cintas requiere una ecualización de 70 µs.\nCintas IEC tipo III. Sony experimentó con una cinta de doble capa utilizando a la vez óxido férrico y dióxido de cromo. Se llamó ferricromo (FeCr). Estas cintas solo estuvieron disponibles por un período corto de tiempo en los años '70.\nCintas IEC tipo IV o de metal (casetes de metal). También usan ecualización de 70 µs, y proporcionan nuevos avances y mejoras en la calidad de sonido así como más resistencia al desgaste.[10]​\nLa calidad se refleja normalmente en el precio, siendo las más baratas las cintas tipo I y las tipo IV las más caras. Las cintas tipo II se consideran como de calidad de CD y las cintas tipo IV como de más calidad que el CD, para niveles de volumen más elevados y los Super Audio CD.\nEl tipo de cinta se indica con muescas en la parte superior de la cubierta. Las cintas tipo I solo tienen un par de muescas (una a cada extremo) para protección de escritura. Las cintas tipo II tienen un par adicional junto a las de protección de escritura. Las cintas tipo IV tienen un tercer par, pero en el medio de la cubierta. Estas muescas permiten que las pletinas reconozcan automáticamente el tipo de cinta y escojan los parámetros de polarización (bias) y ecualización de forma automática. Aun así, la mayor parte de los modelos actuales carecen de esta característica, y algunos solo permiten la utilización de cintas tipo I.\nSi se utilizan cintas tipo II y tipo IV en una pletina diseñada exclusivamente para cintas tipo I, se producirán distorsiones de sonido y una calidad pobre."}]}, {"name": "Evolución histórica", "text": "En 1963, la casa Philips lanzó al mercado los primeros grabadores para cintas de casete.[cita requerida]\nEl casete compacto (como se llamó originalmente) fue patentado en 1964, por la división de los Países Bajos de la Philips Company[cita requerida], pero el nuevo invento no adquirió relevancia hasta un tiempo después.\nEn 1965, apareció la cinta magnética virgen,[cita requerida] que se comercializó con distintos formatos.\nEl casete tenía sentido porque el magnetófono no era un equipo de fácil transporte ni portátil. El casete, de mucho menor tamaño y compacto, quería solventar estos problemas y buscar esa franja de mercado que no estaba siendo cubierta.\nLa viabilidad comercial del nuevo invento se fue introduciendo lentamente. Al principio, finales de los años sesenta y principios de los setenta, era tan pobre la demanda, que incluso se lanzaban los álbumes de música en casete después de que se hubieran puesto a la venta los LP. (Como ocurre hoy con las películas, que primero se estrenan en cine y tras un periodo se pone a la venta el DVD). La poca demanda se explica porque los primeros casetes tenían inhabilitada la función de grabar, eran solo reproductores, no grabadores.[cita requerida]\nLa calidad del sonido del casete mejoró notablemente con la introducción de los sistemas de reducción de ruidos Dolby, lo que atrajo a nuevos consumidores y las firmas Ampex, Sony y TDK empezaron a producirlos en masa.\nLa cinta virgen fue introducida por la casa japonesa Maxell, a mediados de los años setenta. A finales de esa década, Maxell y TDK se repartían el mercado de las cintas vírgenes.[cita requerida]\nEn 1980, apareció la cinta de metal de mayor calidad y las compañías discográficas empezaron a lanzar simultáneamente los LP y las cintas de casete.\nParalelamente empezaron a aparecer los walkmans (pequeños reproductores de casete portátiles con auriculares) que permitían al usuario escuchar su música en cualquier momento y en cualquier lugar. Los modelos de walkman además empezaron a incorporar sintonizadores de radio AM-FM, agregando aún más diversidad a lo que un usuario podía programar. Estos pequeños reproductores protagonizaron en aquella época la misma revolución social que provocaron después los reproductores de mp3. El usuario podía grabar en una cinta la selección de música que creyera oportuna y llevarla allí donde quisiera.", "subsections": []}, {"name": "Sucesores", "text": "El desarrollo técnico efectivo del casete cesó cuando los medios digitales de grabación tales como el DAT y el MiniDisc fueron introducidos al final de los años ochenta e inicios de los noventa. Anticipando el cambio de formato analógico a digital, muchas compañías importantes tales como Sony cambiaron su enfoque hacia los nuevos medios.\n[11]​\nEn 1992, Philips introdujo el DCC (casete compacto digital), las cintas DAT son parecidas en algunos factores al casete de audio compacto. Estuvo dirigido sobre todo al mercado del consumidor. Una pletina o aparato grabador de DCC podía reproducir ambos tipos de casetes (pero no grabar casetes analógicos, solo digitales DCC). Al contrario que el DAT, que fue aceptado en uso profesional porque podría grabar sin pérdidas, el DCC no tuvo éxito en los ambientes caseros o móviles, y se dejó de fabricar en 1996.\nEn 1992 Sony lanzó el minidisc sin demasiado éxito. La idea era ser una alternativa al casete y al CD, con una capacidad de almacenamiento mayor al casete y un tamaño menor al CD.\nEl microcasete en muchos casos ha suplantado el casete audio del mismo tamaño en situaciones donde proporciona la fidelidad de voz que se requiere. Por ejemplo, en las máquinas de dictado y en los contestadores automáticos. Pero incluso estos, cada vez más, utilizan ya registradores digitales de varios tipos. Dado el aumento de uso de los CD-R, MP3 almacenado en memoria flash y iPod como reproductores, el fenómeno de la grabación casera se ha transformado notablemente, al poder obtenerse ahora mismo, los datos, ya sean de audio o de cualquier otro tipo, de internet, con unas calidades estándares.\nDebido a la demanda de los consumidores, el casete ha seguido siendo influyente casi dos décadas después de su declinación. Mientras que el disco compacto (o CD) creció en renombre, los adaptadores audio CD-casete fueron desarrollados para proporcionar una manera económica y clara de obtener funcionalidad del CD en los vehículos equipados con pletinas de casete. Un reproductor de CD portable hacía posible que su funcionamiento, además de digital, fuera analógico, al poder conectar con el adaptador el reproductor de CD a la pletina de casetes. Estos adaptadores también continúan funcionando con los reproductores MP3, y son generalmente más fiables que los transmisores de FM diseñados para conectar los lectores de CD o MP3 a los radiocasetes. Los reproductores MP3, mediante los citados adaptadores, también pueden ser insertados en cualquier reproductor de casete audio y comunicarse con el cabezal como si fueran casetes normales.", "subsections": []}, {"name": "Reparación, cuidados y mantenimiento", "text": "Muchos de los problemas de los casetes se deben a mantenimiento defectuoso o insuficiente de los grabadores y reproductores.\nLas cintas contienen partes móviles como rodamientos que pueden deteriorarse, haciendo que se atasque o rompa la cinta magnética. Esto no significa el fin de lo que allí está grabado: se puede sacar la cinta de la carcasa y trasplantarla a otra carcasa. Las cintas que se ha \"comido\" el aparato reproductor, tal y como se describe a continuación, pueden ser recuperadas en muchos casos, por ejemplo, enrollándolas de nuevo sobre una superficie circular, como puede ser un bolígrafo, y dejando la superficie lo más lisa posible.\nOtra reparación más consistente puede ser llevada a cabo sobre una cinta cortada por medio de alinear cuidadosamente las dos partes y pegando los dos extremos con un empalme de cinta especial de unir (la cinta adhesiva normal se puede utilizar, pero no es lo más indicado), para después recortar el sobrante con unas tijeras o un cuchillo de precisión, haciendo posible una reproducción básica para su copia a un medio externo como una grabadora digital o un ordenador personal. Otro método consiste en unir los dos extremos cortados con unas gotas de esmalte para uñas superponiendo un extremo de la cinta sobre el otro.\nLos casetes de mejor calidad vienen fabricados con tornillos en la carcasa, de forma que la cinta puede ser desmontada y montada sin ningún problema. Puede ser muy útil practicar primero con casetes vacíos. Hay que tener cuidado y asegurarse de que la bobina y la cinta están en el orden correcto del casete antes del montaje y de que todas las partes de las que consta, encajen. Si las partes de la carcasa están pegadas con pegamento, se pueden separar poco a poco usando una hoja fina de metal (como un destornillador o un cuchillo fino) en el borde de ambas mitades de la carcasa, mientras se tiene cuidado de no dañar la bobina.\nA menudo los carretes se dañan en la operación, de forma que hay que reemplazar la carcasa por otra nueva. Uno de los mayores problemas del casete son los equipos grabadores, en donde si el embrague del eje que mueve el carrete de toma se desgasta o daña, dicho carrete se frena haciendo que por el movimiento de arrastre la cinta se salga y se enrolle en el grabador, atascándose. En los grabadores de los años 1990 aparecieron mecanismos y sensores que impiden que ante un problema así el casete se arruine. Si ocurría una falla en la carrete de toma, el grabador simplemente se detenía.\nOtro fallo frecuente es el atascamiento debido a rodillos de presión (pinch roller) defectuosos, que hacen que la cinta se salga de sus guías y se arrugue. Para evitar esto, los pinch roller deben limpiarse con alcohol isopropílico y cada cierto tiempo deben reemplazarse. El problema es originado por el desgaste del pinch roller.\nOtro problema son los cabezales magnetizados. Con cada reproducción, el magnetismo remanente de la cinta polariza las cabezas con una carga de magnetismo que las imanta. Si no se elimina este magnetismo, la propia cabeza imantada borra progresivamente las cintas, manifestándose esto como deterioro de la relación señal/ruido (mayor soplido) y pérdida progresiva de agudos. Para evitar esto, los fabricantes de los equipos recomiendan una desmagnetización cada 20 a 50 horas de uso. Para esto, se utilizan dispositivos llamados desmagnetizadores, que mediante una corriente alterna que sube y disminuye progresivamente de amplitud, elimina la carga de magnetismo residual de las cabezas.", "subsections": []}, {"name": "Véase también", "text": "Cinta de audio digital\nCasete compacto digital\nElcaset\nMixtape\nMicrocasete\nHistoria del registro del sonido", "subsections": []}, {"name": "Referencias", "text": "↑ Real Academia Española. «casete». Diccionario de la lengua española (23.ª edición). Consultado el 28 de julio de 2011. \n↑ Asociación de Academias de la Lengua Española (2010). «caset». Diccionario de americanismos (1.ª edición). Madrid: Taurus. ISBN 978-8-430-61751-7. Consultado el 1 de mayo de 2024. \n↑ \nCamras, Marvin (1985). Magnetic Tape Recording. New York: Van Nostrand Reinhold. ISBN 0-442-21774-9. \n↑ a b \nEric D. Daniel, C. Dennis Mee, Mark H. Clark (1998). Magnetic Recording: The First 100 Years. New York: McGraw-Hill Professional. ISBN 0-07-041275-8. \n↑ \nComisión Electrotécnica Internacional (1994). «Parte 7: Cassette for commercial tape records and domestic use». Estandar International IEC 60094-7: Magnetic tape sound recording and reproducing systems. Ginebra: Comisión Electrotécnica Internacional. ISBN 0-580-22909-2. \n↑ \nLeonard Copland, Robert Johns (noviembre de 1966). «The tape cartridge comes of age». Electronics World magazine. \n↑ a b «La irreemplazable seguridad del viejo casete». Consultado el 22 de marzo de 2014. \n↑ http://www.elmundo.es/papel/historias/2016/06/08/5756b014e5fdeab1428b4665.html\n↑ Werner Abelshauser, Wolfgang von Hippel, Jeffrey Allan Johnson, Raymond G. Stokes (2003). German Industry and Global Enterprise: BASF: The History of a Company. Cambridge University Press. p. 585. ISBN 0-521-82726-4. \n↑ «The blank tape gallery». Archivado desde el original el 16 de febrero de 2007. Consultado el 13 de septiembre de 2006. \n↑ Al, Fasoldt (1991). «Sony unveils the minidisc» (The Syracuse Newspapers edición). Nueva York: The Syracuse Newspapers. Archivado desde el original el 23 de agosto de 2009. Consultado el 22 de octubre de 2006.. ", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una categoría multimedia sobre Casete.\nHistoria de la música portátil Archivado el 8 de marzo de 2021 en Wayback Machine., por Matías Aizpurúa\nTape Deck: Recopilatorio de imágenes de cientos de cintas de casete", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Commodore_64", "title": "Commodore 64", "summary": "US$595\nCommodore 64 (C64, CBM 64/CBM64, C=64,C-64, VIC-64[1]​) es una computadora doméstica de 8 bits desarrollada por Commodore International en agosto de 1982 a un precio inicial de 595 dólares. Sucede a la Commodore VIC-20 y a la Commodore MAX Machine, con 64 kilobytes (65 536 bytes) de RAM, con gráficos y sonido muy por encima de otros equipos contemporáneos.\nUtilizaba una unidad de casete (Datasette) además de una disquetera de 5 1/4 pulgadas (Commodore 1541). Disponía de un teclado profesional muy robusto, distintas tomas de conexión y poseía infinidad de videojuegos, aplicaciones y gráficos. Contaba con una paleta de 16 colores y un intérprete BASIC (el Commodore BASIC v2.0). Aceptaba la conexión directa de periféricos sin necesidad de una interfaz de conexión, (como alguno de sus más directos competidores) incorporando dos puertos de conexión de mandos de juego (joysticks), puertos serie IEC, RS232 y C2N, salida a televisión, salidas de vídeo compuesto y audio mediante conector DIN de alta fidelidad y un puerto de expansión para cartuchos. Algunos cartuchos incorporaban lenguajes de programación como COBOL, o un BASIC más avanzado, o expansión de RAM, más algunas utilidades para congelar los juegos y poder copiarlos. Su reloj funcionaba a menos de 1 Megahercio, pero sus excelentes capacidades gráficas y sonoras, hicieron de ella la computadora personal favorita de millones de usuarios caseros. Hoy en día existen programas que emulan su funcionamiento al completo, para GNU/Linux, Windows y otros sistemas operativos.\nEl Commodore 64 sigue siendo el modelo de computadora doméstica más vendida en el mundo. Se estiman sus ventas entre 22,5 y 17 millones de unidades[2]​", "sections": [{"name": "Orígenes", "text": "En enero de 1981, MOS Technology, Inc., diseñadora de circuitos integrados subsidiaria de Commodore, inició un proyecto para diseñar los circuitos gráfico y de audio para la nueva generación de videoconsolas. El diseño de los circuitos, llamados VIC-II (gráficos) y SID (audio) fue completado en noviembre de 1981.\nEntonces se comenzó un proyecto para una videoconsola de Commodore que usara ambos circuitos, llamada Ultimax o Commodore MAX Machine, creada por Yashi Terakura de Commodore Japón. Este proyecto fue cancelado después de fabricarse algunas unidades para el mercado japonés.\nAl mismo tiempo, Robert \"Bob\" Russell, programador de sistemas y arquitecto del VIC-20, y Robert \"Bob\" Yannes, ingeniero del SID, eran críticos para la línea de productos de Commodore, la cual era una continuación de la línea PET, dirigida a usuarios de negocios. Con el apoyo de Al Charpentier, ingeniero del VIC-II, y de Charles Winterble, gestor de MOS Technology, propusieron a Jack Tramiel, oficial ejecutivo en jefe de Commodore, una verdadera secuela de bajo coste del VIC-20. Tramiel dictaminó que la máquina debía tener 64 KB de RAM. Aunque 64 KB de DRAM costaban más de 100 dólares en ese momento, Tramiel sabía que los precios caían y que muy pronto tendrían un precio aceptable antes de iniciarse la producción. En noviembre, Tramiel fijó como fecha de entrega el primer fin de semana de enero, para coincidir con el Consumer Electronics Show de 1982.\nEl producto tenía el nombre en clave de VIC-40, al ser el sucesor del popular VIC-20. El equipo que lo construyó fue formado por Robert Russell, Robert Yannes y David A. Ziembicki. El diseño, los prototipos y algún software de prueba fue acabado a tiempo para el show, después de haber estado el equipo trabajando sin descanso incluso en los fines de semana del día de Acción de Gracias y Navidad.\nCuando el producto iba a ser presentado, el VIC-40 fue renombrado a C64 para ajustarse a las líneas actuales de negocios de Commodore, las cuales incluían el P128 y el B256, ambos nombrados con una letra y su respectivo tamaño de memoria.\nEl C64 tuvo una presentación impresionante, tal y como recuerda el ingeniero de producción David A. Ziembicki: \"Todo lo que veíamos en nuestro pabellón era gente de Atari con la boca abierta, diciendo '¿Cómo pueden hacer esto por 595$?'\". La respuesta era, según se vio, la integración vertical: gracias a ser Commodore la dueña de las plantas de fabricación de semiconductores de MOS Technology, cada C64 tenía un costo estimado de producción de solo 135 dólares.", "subsections": []}, {"name": "Los diferentes modelos de Commodore 64", "text": "Además del C64 con su diseño característico heredado del VIC-20, Commodore y otros fabricantes pusieron a la venta unos modelos derivados del C64 de base.", "subsections": [{"name": "Max Machine", "text": "En 1982, Commodore desarrolló el Commodore MAX Machine en Japón, llamado Ultimax en los EE. UU., y VC-10 en Alemania. El MAX fue pensado para ser una consola de juegos y se basó en una versión muy reducida del hardware del C64. El MAX se suspendió meses después de su introducción, a causa de las malas ventas en Japón."}, {"name": "Educador 64", "text": "En 1983, para competir con Apple II en el sector de la educación en Estados Unidos, Commodore ponía en el mercado el Educator 64 que consistía esencialmente en un C64 y un monitor monocromático verde, dentro de una caja de un Commodore PET serie 4000. Las escuelas prefirieron las versiones todo-en-uno en metal de este modelo al estándar C64 con sus componentes separados, ya que podían ser fácilmente dañados, ser sometidos a actos de vandalismo y/o robo."}, {"name": "SX-64", "text": "En 1984, Commodore proponía el primer ordenador portable con pantalla color, el Commodore SX-64, una versión portable del C64. Tenía una pantalla CRT color de 5\" (127 mm) e incluía solo una unidad de disquete 1541, no incluía la unidad de casete (Datasette)."}, {"name": "128", "text": "En 1985 aparece el Commodore 128 (y más tarde el 128D) que es retro-compatible con el C64. Es una versión mejorada del C64 con el doble de memoria (RAM), con posibilidad de mostrar en pantalla 80 columnas en modo texto, además de un diseño nuevo de la caja y del teclado. También incluya un procesador Zilog Z80 para usarlo en modo CP/M en alternancia con el Commodore BASIC 7.0."}, {"name": "64C", "text": "En 1986, Commodore lanzó el Commodore 64C (C64C) que era funcionalmente idéntico al original, pero con un diseño más parecido al Commodore 128. Las modificaciones fueron más allá del simple cambio de look, ya que el C64C incorporaba nuevas versiones del chip de sonido SID, del chip vídeo Vic y del chip de entrada/salida (I/O), adaptados a un nuevo voltaje en el núcleo (Vcore) de 9V (en vez de 12V). A menudo, el C64C fue vendido con el sistema operativo GEOS. En paralelo, la nueva unidad de disco Commodore 1541C cambió su look para adaptarse al nuevo C64C, además de ser más silenciosa y más fiable."}, {"name": "64GS", "text": "En 1990, el C64 fue re-editado en forma de una consola de juegos, llamado Commodore 64 Games System (C64GS). Se hizo una modificación simple de la placa base del C64C para orientar el conector del cartucho en posición vertical. Solo tenía las conexiones mínimas para conectar el audio, el vídeo, los mandos de juegos y el cartucho. Su ROM fue modificada para simplificar el arranque del sistema con una pantalla de inicio al estilo \"Inserte el cartucho de juego\". Fue diseñado para competir con la Nintendo Entertainment System y el Sega Master System, pero sus malas ventas comparadas con sus rivales fue un fracaso comercial para Commodore y nunca fue lanzado fuera de Europa."}, {"name": "Otros", "text": "En 2000, el fabricante Tulip Computers propone un producto basado en el C64, el C64 Direct-to-TV. Este peculiar modelo del C64 está contenido dentro de un mando de juego, de tipo Joystick. A la base, es un sistema cerrado ya que solo propone 30 juegos clásicos del C64, 2 conectores RCA (audio/vídeo) y en su interior, un ASIC funcionando a 32 MHz emulando al procesador 6510, al VIC-II, al SID, al CIA y al PLA. Existen modificaciones para extender sus capacidades y mejorar su conectividad con lectores externos por ejemplo.\nOtros modelos del C64, muy específico al mercado alemán, aparecieron durante esos años, como el Commodore 64 \"Aldi\", el Commodore 64 Golden Edition y el Commodore 64G"}]}, {"name": "Características varias", "text": "La Commodore 64 fue la computadora que inspiró a muchos músicos y programadores y es posiblemente el ordenador de 8 bits de culto más importante. A día de hoy existe una comunidad de usuarios muy activa que siguen programando para el C64, haciendo auténticas filigranas. También existe una subcultura musical dentro del Commodore 64.\nTambién inspiró a otros empresarios como por ejemplo, la tecla Commodore, esta era una tecla especial que daba muchas funciones al presionarla combinada con otras teclas, al igual que los teclados compatibles con Windows tienen el logotipo del sistema operativo de Microsoft, y los teclados para Apple Macintosh, el logotipo de Apple Inc..\nLa interfaz gráfica GEOS se podía hacer arrancar desde una memoria EPROM en los cartuchos de expansión, con lo cual al encender la Commodore 64, esta iniciaba la interfaz gráfica vía hardware dándole una velocidad insuperable contra el Datasette y la disquetera. Con esto quedaba una computadora óptima para trabajo directo, incluso se logró mantener un reloj en la interfaz GEOS con lo cual mejoraba mucho sus capacidades.\nVale la pena hacer notar que la Commodore 64 tenía una excelente arquitectura de hardware dada su capacidad de expansión mediante cartuchos y una gran versatilidad.\nTambién tenía periféricos como mouse, impresora, disquetera, discos duros, módem telefónico, joysticks, lápiz óptico, teclado de música, monitores, casetes, etc.\nEn el año 2005 la compañía Creative Micro Designs lanzó al mercado la CMD SuperCPU, que se conectaba en el puerto de expansión proporcionado una CPU de 16 bits WDC 65C816 a 20 MHz, que además soporta expansión de 16 MB de memoria RAM y la conexión de un disco duro.\nActualmente se pueden descargar juegos de la Commodore 64 en la Consola Virtual de la Wii", "subsections": []}, {"name": "Especificaciones técnicas", "text": "Microprocesador:\nMOS Technology 6510/8500 (un MOS 6502 con un puerto integrado de entrada/salida de 6 bits)\nVelocidad de reloj: 0,985 MHz (PAL) / 1,023 MHz (NTSC)\nVideo: MOS Technology VIC-II 6567/8567 (NTSC), 6569/8569 (PAL)\n16 colores\nModo texto: 40×25 caracteres; 256 caracteres definibles (8×8 píxeles, o 4×8 en modo multicolor); fondo definido por 4-bit\nModo mapa de bits: 320×200 (2 colores únicos en cada bloque de 8×8 píxeles),[3]​ 160×200 (3 colores únicos más un color común en cada bloque de 4x8)[4]​\n8 sprites por hardware de 24×21 píxeles, (12×21 en modo multicolor)\nSonido: MOS Technology 6581/8580 SID\nSintetizador de 3 voces con ADSR controlable\n8 Octavas\n4 Formas de onda: triángulo, sierra, pulso variable, ruido\nSincronización de osciladores, Modulación en anillo\nFiltros programables: paso alto, paso bajo, paso banda, elimina banda\nRAM:\n64 Kilobytes (65 536 bytes), de los cuales 38 KB menos 1 byte (38911 bytes) está disponible para programas en BASIC\n512 bytes de RAM para color\nROM:\n20 Kilobytes (9 KB BASIC 2.0, 7 KB KERNEL, 4 KB caracteres: dos juegos de 2 KB cada uno)\nEntrada/Salida:\nPuerto serie RS232C (para módem, consola, etc.)\nPuerto serie IEC (para unidades de disco, impresoras, etc.)\nPuerto serie C2N (para datasette)\nSalida de video compuesto y audio\nSalida modulada para TV\nConector de expansión para cartuchos (al BUS interno del C64)\n2 conectores para mando de juego (joystick u otros dispositivos como ratón, paddle, lápiz óptico, tableta gráfica).", "subsections": []}, {"name": "Clones de Commodore 64", "text": "Muchos países fabricaron clones de este modelo no siempre bajo licencia Commodore.\nEn Argentina la firma Drean, un fabricante de electrodomésticos argentino, compró en 1982 la licencia para fabricar localmente la C64, comenzando la producción en su planta en la provincia de San Luis en 1983. Luego, ante el éxito de ventas, fabricaría los modelos 16 en 1985 (con poco éxito de ventas), 64C a fines de 1986 (con la mayoría de sus partes fabricadas localmente) y 128 a inicios de 1986 (con unos pocos cientos de unidades producidas).[5]​\nEl modelo 64 se asemejaba a su par estadounidense, diferenciándose exteriormente en las siglas de encendido y en el anexo de la palabra Drean anteponiéndose a Commodore 64 en la carcasa de la máquina. Las mismas diferían de color en sus años de fabricación, algunas respetaban a las de Estados Unidos y otras no, ya que los plásticos se fabricaban localmente. Internamente la versión Argentina tenía salida de video PAL-N en lugar de NTSC; además, por este motivo, tenía una frecuencia de reloj mayor, lo que se podía notar en algunos juegos ya que estos fueron diseñados en su mayoría para la versión estadounidense. Otra diferencia destacable era la fuente de alimentación adaptada para 220V en lugar de los 110V originales. Estos clones legítimos eran de excelente calidad, aunque algunos usuarios se quejaban de la dureza del teclado, y 8 de cada 10 \"Commodores\" vendidas llegaron a ser de Drean. La Drean Commodore 64C era internamente igual al modelo 64. La diferencia radicaba en el formato de la carcasa, que era más ergonómica, similar al teclado del modelo 128. A diferencia de los otros modelos, incluía el disquete de GEOS. Drean también importó software, que era distribuido en forma de cartuchos, casetes y disquetes, con su marca o bajo la marca Peek.\nLa producción finalizó a mediados de 1988, cuando Commodore International le retiró la licencia a Drean, luego de haber producido unas 300 000 unidades.[6]​", "subsections": []}, {"name": "Véase también", "text": "Listado de emuladores de Commodore 64\nCommodore BASIC\nCommodore PET\nCommodore VIC-20\nCommodore 16\nCommodore 128\nCommodore Amiga\nCommodore International\nCommodore Educator 64\nCommodore serie MPS\nJack Tramiel (Fundador de la Compañía)\nHistoria de los computadores personales\nContiki (Sistema operativo)", "subsections": []}, {"name": "Referencias", "text": "↑ VIC 64 Användarmanual. Imagen de la edición sueca del manual del usuario del VIC 64.\n↑ [1] Archivado el 6 de marzo de 2016 en Wayback Machine. How many Commodore 64 computers were sold? (ing.)\n↑ Rautiainen, Sami. «Programmers_Reference». Consultado el 13 de septiembre de 2008. \n↑ Rautiainen, Sami. «Programmers_Reference». Consultado el 13 de septiembre de 2008. \n↑ http://www.compuclasico.com/argentinos.php?model=dreancommodore.html\n↑ http://www.retrocomputacion.com/e107_plugins/content/content.php?content.12", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una galería multimedia sobre Commodore 64.\nJuegos y Emuladores descargables de Commodore 64", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Conector_DIN", "title": "Conector DIN", "summary": "Véase también:\nEl conector DIN es un tipo de conector, originariamente estandarizado por el Deutsches Institut für Normung,'DIN', organización encargada de la estandarización en Alemania.\nExisten estándares del DIN para una gran cantidad de diferentes conectores, por lo tanto el término “conector DIN” por sí mismo no identifica un conector particular a menos que se le añada el número que ilustre el tipo de conector en particular (por ejemplo, \"conector DIN 41524\").\nEn el contexto de electrónica de consumo, por regla general, conector DIN se refiere a los conectores con extremo circular que fueron los primeros normalizados por el DIN, para ser empleados en las señales analógicas de audio. Algunos de estos conectores fueron usados posteriormente en la transmisión analógica de vídeo y en interfaces digitales, por ejemplo: MIDI y PS/2 de IBM para teclados y mouses de computadoras personales. Los sezrches DIN para estos conectores no estuvieron mucho tiempo en prensa y fueron pronto reemplazados por los equivalentes internacionales IEC 60130-9\nTodos los conectores macho (plugs) de la familia de conectores tienen extremo de metal con 13,2 mm de diámetro con bordes especiales para limitar la orientación al ser insertados en las ranuras. Existe un rango de conectores de la misma forma que difieren solo en la configuración de los pines y que fue estandarizado originariamente en la DIN 41524 (de 3 o 5 pines), la DIN 45322 (de 5 pines a 60°), la DIN 45326 (8 pines), la DIN 45329 (7 pines), y otros estándares para un rango de diferentes aplicaciones.\nLos conectores consisten en una lámina metálica circular para proteger los pines que sobresalen. La lámina metálica está dentada para que sea insertada con la orientación correcta en su enchufe y prevenir de esta forma el daño en los aparatos eléctricos.\nExisten siete patrones comunes y cualquier número de pines desde tres hasta ocho. Existen dos conectores de cinco pines diferentes, conocidos en la industria como 180° y 240° (a veces denominado de 270°) intentando mencionar la disposición de los pines. Existe alguna ligera compatibilidad, por ejemplo un conector de tres pines puede ajustarse en cualquier enchufe de cinco pines de 180°, permitiendo que tres de los pines del conector queden sin conexión, pero uno de cinco pines no se enchufará en uno de tres pines. Al igual que uno de cinco pines encaja en un enchufe de siete o de ocho.", "sections": [{"name": "Ejemplos de conector de audio (macho)", "text": "", "subsections": []}, {"name": "Referencias", "text": "IEC 60130-9: Connectors for frequencies below 3 MHz — Part 9: Circular connectors for radio and associated sound equipment. International Electrotechnical Commission, Geneva.\nIEC 60574-3: Audiovisual, video and television equipment and systems — Part 3: Specification for connectors for the interconnection of equipment in audiovisual systems.", "subsections": []}, {"name": "Enlaces externos", "text": "www.hardwarebook.net/connector/index.html Distribución de los pines en un conector (en inglés)", "subsections": []}]}
