{"url": "https://es.wikipedia.org/wiki/oric_1", "title": "Oric 1", "summary": "El Oric 1 fue un ordenador doméstico fabricado por Tangerine Computer Systems mediante la creación de la compañía Oric Products International Ltd para competir con el Sinclair ZX Spectrum con un procesador 6502.", "sections": [{"name": "Datos técnicos", "text": "CPU Synertek SY6502A o Rockwell R6502AP (versiones licenciadas del MOS Technology 6502)[1]​ a 1 MHz\nROM 16 Kilobytes con un BASIC derivado del de Microsoft que incluye comandos de sonido. Puede ampliarse mediante ROMs externas, como la de la unidad de disco (con hardware capaz de conmutar su ROM con la del equipo)\nRAM 16 Kilobytes el modelo básico, 64 Kilobytes el resto. Aunque se anuncia de 48 Kb esto se debe a que la ROM oculta la parte alta de la memoria, pero al igual que en el Commodore 64 se puede acceder a todos los bancos de memoria mediante lenguaje ensamblador\nVRAM no tiene. La pantalla se direcciona en la RAM alta :\nTexto: 3B80-3FE0 en los 16 Kb, BB80-BFE0 en los 64 Kb\nHires: 2000-4000 en los 16 Kb, A000-BFE0 en los 64 Kb\nCarcasa pequeña, de 280 x 178 x 150 mm, en plástico blanco con fondo de teclado negro. Inclinada para facilitar la escritura. Hueco de altavoz en la parte inferior (los Oric, al revés que el resto, tienen la cara principal de la placa madre boca abajo). En la esquina superior derecha luce el logotipo que en los últimos modelos pasa a ser arco iris\nTeclado teclado tipo chiclet QWERTY de 57 teclas pero en lugar de las gomas del Spectrum usa barras de plástico más parecidas a las de una calculadora. No presentan TAB o CAPS LOCK (esta se ha asignado a CTRL-T). Teclas de cursor a ambos lados de la barra espaciadora.\nPantalla usa una ULA con 2 modos:\nModo texto de 40 x 28 con 8 colores. Set ASCII de 128 caracteres en matriz de 6 x 8 pixeles, redefinibles por soft. Fila superior no utilizada (normalmente usada por la ROM como línea de status). El atributo Serial de los caracteres de Teletexto se usa para seleccionar colores, parpadeo, caracteres de doble ancho, insertar fragmentos de gráficos modo texto, y seleccionar entre el set de caracteres estándar (ASCII), y el alternativo (caracteres semigráficos de Teletexto), en el que cada carácter representa una cadena de 2 x 3 PELs (bloques gráficos). Cada atributo serial ocupa el espacio de un carácter que no puede ser utilizado para nada más. Por ello, para cambiar a tinta amarilla sobre fondo azul, necesitamos 2 espacios. Esta es la mayor desventaja del ordenador.\nModo gráfico de 240 x 200 píxeles. 6 bits por pixel. Los atributos serial se utilizan también aquí (cada atributo ocupa hasta 6 por 1 píxeles). Tres líneas de texto en la zona inferior de la pantalla.\nSonido General Instrument AY-3-8912 con 3 canales de 8 octavas de sonido más uno de ruido blanco. Sonido Mono, con 16 niveles de volumen por el altavoz interno.\nSoporte interfaz de casete a 300 y 2400 baudios. Se planeó una unidad de disquete, pero la heredó su sucesor el Oric Atmos (puede usarse también).\nEntrada/Salida Visto por detrás, de izquierda a derecha\nConector de TV PAL (modulador de RF UHF)\nConector DIN 5 de Monitor RGB\nConector DIN 7 de Interfaz de casete a 300 baudios y 2400 baudios\nPuerto paralelo de impresora de 20 pines\nConector de BUS de 34 pines\nConector de alimentación DC 9 Voltios 600 mA (negativo fuera, positivo centro)\nAmpliaciones\nPlotter de 4 colores y 40 columnas\nUnidad de disco Oric de 3 pulgadas\nJasmin (una controladora alternativa de floppy para 1/Atmos)\nCumana Disk Interface\nPort MIDI\nInterfaz RS-232C (de MCP): se distribuye con el módem Telemod y soft para Prestel (Videotex en Inglaterra)\nInterfaz serie a 300 baudios de Kenema Associates\nOric V23 módem (V22/V23)\nVarias Interfaz de Joystick (por el puerto paralelo o el BUS)\nSintetizadores de voz", "subsections": []}, {"name": "Historia", "text": "Tangerine produjo uno de los primeros ordenadores en kit basado en el 6502, el Tangerine Microtan 65, que tuvo bastante éxito. Tenía planes de producir un equipo de sobremesa orientado al mercado profesional, pero la empresa a quien lo encargó nunca lo acabó.\nCon el éxito del ZX Spectrum decide fabricar en su lugar un ordenador para competir en el incipiente mercado, pero escarmentada de la anterior, decide crear una subsidiaria, Oric Products International Ltd para desarrollar y comercializar el Oric-1 en 1983. Hereda bastantes cosas del Microtan, como el método de lectura del teclado y varias rutinas de la ROM\nSale a la venta a 129£ el modelo de 16 Kb y 169 £ el de 64 Kb, siendo este último más barato que el Spectrum por unas pocas libras. Aunque presenta el mismo problema de atributos (llamado colour clash en Inglaterra) que el Spectrum, al poder direccionar un color por línea en lugar de por matriz de 8x8 se ve menos afectado. Al incorporar una salida de monitor RGB, un chip de sonido y un mejor teclado sobrepasaba a aquél, pero su ROM era un hervidero de Bugs que dificultaban la programación de juegos comerciales, y sin ellos un ordenador doméstico estaba sentenciado. No obstante, se estima en unos 160.000 los Oric-1 vendidos en Gran Bretaña y 50.000 en Francia en 1983. Además se comercializó por toda Europa, con buenas ventas en España. No se llegó a los 350.000 previstos, pero fue suficiente para que Oric International fuera comprada por Edenspring con 4 millones de libras esterlinas.", "subsections": []}, {"name": "Referencias", "text": "↑ Defence-Force tiene imágenes de las placas madre de los Oric/Pravetz", "subsections": []}, {"name": "Fuente", "text": "La mayor parte de este artículo procede de El Museo de los 8 Bits bajo licencia Creative Commons Atribución 2.5", "subsections": []}, {"name": "Enlaces externos", "text": "Oric.org Principal portal de los usuarios de Oric\nThe Oric FAQ sobre los Microtan 65, Oric 1, Oric Atmos & Stratos IQ164/Telestrat; website de James Groom\nDefence-Force: Oric Forums – The main Oric discussion forum\nLe monde Oric con un libro en línea sobre Oric\nOric Webring", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/%C2%A3", "title": "£", "summary": "El símbolo de la libra (\" £ \", más común en el Reino Unido) es el símbolo de la libra británica (pound), la moneda del Reino Unido. El mismo símbolo se utiliza (o se ha utilizado) en otros países y territorios para monedas del mismo nombre. Sin embargo, también hay países cuya moneda se llama pound, pero que no utilizan oficialmente el símbolo £.", "sections": [{"name": "Origen", "text": "El símbolo deriva de la palabra latina libra ( libra ), la unidad de masa romana básica (aprox. 0,329 kg), que a su vez deriva de la palabra latina para balanza. La libra se convirtió en una unidad de masa británica y la moneda se llamó libra porque originalmente valía tanto como una libra Tower (326 g) de plata fina (pura). Por cierto, el penique anterior a la decimalización (240 de los cuales constituían £1) tomó el símbolo d de la palabra latina denarius, la palabra romana \"penny\".[1]​", "subsections": []}, {"name": "Uso", "text": "El signo de libra, al igual que el signo de dólar (\"$\"), limitado a inglés, irlandés y maltés, normalmente se coloca delante del número (es decir, \"£120\" y no \"120£\"), y no suele estar separado del número que le sigue[2]​o bien por un espacio.\nEl símbolo \"₤\" también se conoce como símbolo de la libra esterlina, siendo Sterling Pound el nombre oficial de la moneda.[3]​\nEn Italia, antes de la adopción del euro, el símbolo se utilizaba, a menudo con las dos líneas horizontales, para indicar los precios en liras italianas (como alternativa a la más frecuente L ). De hecho, se pudieron encontrar varios símbolos, ya que no existe un símbolo oficial único: en las monedas estaba escrito L. 100, pero en otros contextos era posible encontrar £100, £. 100, ₤ 100, ₤. 100, L 100, Lit 100 o Lit. 100. Con menos frecuencia, el símbolo también se puede encontrar después de la cantidad.", "subsections": []}, {"name": "Ordenador", "text": "", "subsections": [{"name": "Códigos", "text": "El símbolo \"£\" tiene el código Unicode U+00A3 (heredado del latín-1 ). [4]​  El código HTML es \" & pound;\" en XML se identifica con \" & #163;\".\nEl símbolo \" ₤ \" tiene el código Unicode U+20A4, mientras que el código decimal es \" & #8356;\"."}, {"name": "Modo de inserción", "text": "Se puede acceder al carácter \"£\" usando Mayúsc + 3 en un teclado de diseño italiano moderno.\nUn teclado con distribución en inglés (Reino Unido) tiene el carácter \"£\" en la tecla 3 como los teclados italianos, mientras que en los teclados de EE. UU. debes usar la combinación AltGr + Mayúsc + 4 para insertar el símbolo de libra.\nEl símbolo \"£\" está presente en la tabla de caracteres Mac OS Roman y, por lo tanto, se puede utilizar en la mayoría de los teclados de Mac OS, generalmente mediante la combinación Opción + 3 .\nEn Microsoft Windows, el símbolo \"£\" se puede insertar con la combinación Alt + 0 1 6 3, mientras que el símbolo \"₤\" se puede insertar con la combinación Alt + 8 3 5 6 ."}]}, {"name": "Véase también", "text": "Símbolo del dólar", "subsections": []}, {"name": "Referencias", "text": "↑ «Origen e historia de la libra esterlina». British Council. Consultado el 21 de octubre de 2023. \n↑ Unione europea (2011). Manuale interistituzionale di convenzioni redazionali. Lussemburgo: Ufficio delle pubblicazioni dell'Unione europea. p. 125. ISBN 978-92-78-40704-9. doi:10.2380/37101. Archivado desde el original el 12 aprile 2019. \n↑ Per inciso, anche lira deriva dalla libra romana.\n↑ «C1 Controls and Latin-1 supplements - Range: 0080-00FF» (en inglés). Unicode.org. ", "subsections": []}, {"name": "Enlaces externos", "text": "Officer, L.H. (2007). Between the Dollar-Sterling Gold Points: Exchange Rates, Parity and Market Behavior. Studies in Macroeconomic History. Cambridge University Press. ISBN 978-0-521-03821-8. Consultado el 21 de octubre de 2023. }", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Amperio", "title": "Amperio", "summary": "[\n]\nEl amperio,[3]​ ampere[4]​ o ampère (símbolo A) es la unidad de intensidad de corriente eléctrica. Forma parte de las unidades básicas en el sistema internacional de unidades y recibió ese nombre en honor al matemático y físico francés André-Marie Ampère (1775-1836).\nSe define al fijar el valor numérico de la carga elemental, e, en 1.602 176 634 × 10-19, cuando se expresa en la unidad C, igual a A·s, donde el segundo se define en función de ΔνCs. El efecto de esta definición es que el amperio es la corriente eléctrica correspondiente al flujo de 1/(1.602 176 634 × 10−19) = 6.241 509 074 × 1018 cargas elementales por segundo.\nEsta definición se adoptó el 16 de noviembre de 2018 en la 26ª Conferencia General de Pesas y Medidas acordándose su entrada en vigor el 20 de mayo de 2019.\nEl amperio y el culombio se relacionan mediante: \n1\nA\n=\n1\nC\ns\n{\\displaystyle \\mathrm {1\\,A=1{\\frac {\\,C}{s}}} \\,}\n Si bien el amperio es unidad básica y el culombio no lo es, en la práctica, la actual definición de amperio depende de la de culombio.", "sections": [{"name": "Definiciones históricas", "text": "Desde mediados del siglo XIX, con el desarrollo del electromagnetismo y la electrotecnia, comenzó a usarse el amperio como unidad de corriente eléctrica. La definición y cuantificación no era uniforme, sino que cada país desarrolló sus propios estándares. El primer estándar internacional que definió el amperio, así como otras unidades eléctricas, fue establecido en el Congreso Eléctrico Internacional de Chicago en 1893, y confirmada en la Conferencia Internacional de Londres de 1908. El \"amperio internacional\" se definió en términos de la corriente eléctrica que provoca la deposición electrolítica de la plata de una solución de nitrato de plata a un promedio de 0.001118 g/s.[5]​[6]​\nSu valor, expresado en términos del amperio absoluto, equivalía a 0,99985 A.\nLa unidad de carga eléctrica, el culombio, se deriva del amperio: un culombio es la cantidad de carga eléctrica desplazada por una corriente de un amperio fluyendo durante un segundo.[7]​\nPor tanto, la corriente eléctrica (I), puede expresarse como el promedio de carga (Q) que fluye por unidad de tiempo (t):\nI\n=\nQ\nt\n{\\displaystyle {\\rm {I={\\frac {Q}{t}}}}}\nAunque conceptualmente parecería más lógico tomar la carga como unidad básica, se optó por la corriente porque, por razones operativas, resultaba más fácil de medir experimentalmente. Así se llegó a la anterior definición de amperio, la establecida en la 9ª Conferencia General de Pesas y Medidas de 1948, de la siguiente manera: Un amperio es la corriente constante que, mantenida en dos conductores rectos paralelos de longitud infinita, de sección circular despreciable, y colocados a un metro de distancia en el vacío, produciría entre estos conductores una fuerza igual a 2 x 10−7 newton por metro de longitud.[8]​\nEl proceso de redefinición que condujo a la definición de amperio adoptada en el año 2018 fue iniciado formalmente en el 2010 cuando el Comité del BIPM propuso sustituir las definiciones entonces vigentes de varias unidades del sistema internacional, por otras basadas en constantes de la naturaleza, como la constante de Planck, la de Boltzmann, la carga elemental y el número de Avogadro. \nArtículo principal:", "subsections": []}, {"name": "Valor de la permeabilidad del vacío", "text": "De la definición de amperio de 1948 se seguía un valor exacto para la permeabilidad magnética del vacío. La fuerza ejercida sobre dos conductores paralelos rectilíneos por los que circula una intensidad de corriente viene dada por la ley de Biot-Savart:\nF\nl\n=\nμ\n0\n⋅\nI\n2\n2\nπ\n⋅\nr\n{\\displaystyle {\\frac {F}{l}}={\\frac {\\mu _{0}\\cdot I^{2}}{2\\pi \\cdot r}}}\ndonde:\nF\n{\\displaystyle F}\nl\n{\\displaystyle l}\nμ\n0\n{\\displaystyle \\mu _{0}}\nI\n{\\displaystyle I}\nr\n{\\displaystyle r}\nDespejando de la anterior ecuación se tiene que:\nμ\n0\n=\n2\nπ\n⋅\nf\n⋅\nr\nI\n2\n⋅\nl\n=\n2\nπ\n⋅\n2\n⋅\n10\n−\n7\nN\n⋅\n1\nm\n(\n1\nA\n)\n2\n⋅\n1\nm\n=\n4\nπ\n×\n10\n−\n7\nN\n/\nA\n2\n=\n1\n,\n2566370614\n…\n×\n10\n−\n6\nH\n/\nm\n{\\displaystyle \\mathbf {\\mu _{0}} ={\\frac {2\\pi \\cdot f\\cdot r}{I^{2}\\cdot l}}={\\frac {2\\pi \\cdot 2\\cdot 10^{-7}N\\cdot 1m}{(1A)^{2}\\cdot 1m}}=4\\pi \\times 10^{-7}\\mathrm {N/A^{2}} =1,2566370614\\ldots \\times 10^{-6}\\mathrm {H/m} }\nera el valor exacto para la permeabilidad del vacío.[8]​\nAdemás, dado que la permitividad y la impedancia característica del vacío están relacionadas con la permeabilidad y la velocidad de la luz en el vacío se obtenían otros valores definidos exactos:\nLa permitividad del vacío \nε\n0\n=\n1\nc\n2\nμ\n0\n=\n8\n,\n8541878176\n…\n×\n10\n−\n12\nF\n/\nm\n,\n{\\displaystyle \\mathbf {\\varepsilon _{0}} ={\\frac {1}{c^{2}\\mu _{0}}}=8,8541878176\\ldots \\times 10^{-12}\\ \\mathrm {F/m} ,}\nla impedancia característica del vacío \nZ\n0\n=\nμ\n0\n⋅\nc\n=\n119\n,\n9169832\nπ\nΩ\n{\\displaystyle Z_{0}=\\mu _{0}\\cdot c=119,9169832\\;\\pi \\ \\Omega }\ndonde \nc\n{\\displaystyle c}\n es la velocidad de la luz en el vacío.\nCon la definición de amperio del año 2018 esas tres magnitudes: permeabilidad magnética, permitividad e impedancia característica ya no tienen valores exactos definidos en el Sistema Internacional de Unidades y han de ser objeto de determinación experimental.", "subsections": []}, {"name": "Múltiplos del amperio", "text": "A continuación se muestra una tabla de los múltiplos y submúltiplos del amperio conforme a la nomenclatura del Sistema Internacional de Unidades:", "subsections": []}, {"name": "Véase también", "text": "Corriente eléctrica.\nAmperímetro.\nCarga eléctrica.\nResistencia eléctrica.\nLey de Ohm.\nOhmio.\nVoltio.\nVoltaje.\nVatio.", "subsections": []}, {"name": "Notas", "text": "↑ Calculado como 1/e, donde e es el valor de la carga elemental.", "subsections": []}, {"name": "Referencias", "text": "↑ Lista símbolos alfabetizables en el diccionario panhispánico de dudas, apéndice 3\n↑ «The NIST Reference on Constants, Units, and Uncertainty: elementary charge». NIST. 2006. Consultado el 28 de febrero de 2008. \n↑ Real Academia Española. «amperio». Diccionario de la lengua española (23.ª edición). Consultado el 21 de marzo de 2015. \n↑ Real Academia Española. «ampere». Diccionario de la lengua española (23.ª edición). Consultado el 21 de marzo de 2015. \n↑ Northrop, Robert B. (1997). Introducción a Instrumentación y las Medidas. CRC Press. \n↑ «The Ampere and Electrical Standards» (pdf). Journal of Research of the National Institute of Standards and Technology 106 (1): 65-103. 2001. \n↑ Kuzman Ražnjević, Cantidades físicas y las Unidades del sistema internacional (Si), Begell House Publishers, 1995 online\n↑ a b «Unit of electric current (ampere).». Oficina Internacional de Pesas y Medidas. Consultado el 19 de agosto de 2013. «The ampere is that constant current which, if maintained in two straight parallel conductors of infinite length, of negligible circular cross-section, and placed 1 metre apart in vacuum, would produce between these conductors a force equal to 2 x 10–7 newton per metre of length.» ", "subsections": []}, {"name": "Enlaces externos", "text": "Bureau International des Poids et Mesures (en inglés).\nLa Referencia de la NIST en Constantes, Unidades, e Incertidumbre (en inglés).\nUna corta historia de las unidades SI en la electricidad (en inglés).", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Arco_iris", "title": "Arcoíris", "summary": "Un arcoíris[1]​[2]​ o arco iris es un fenómeno óptico y meteorológico que causa la aparición en la atmósfera terrestre de un arco multicolor, a veces, doble, por la descomposición de la luz solar en el espectro visible. Se produce por refracción, cuando la luz atraviesa gotas de agua. Está formado por arcos concéntricos de colores, sin solución de continuidad entre ellos, con el rojo hacia la parte exterior y el violeta hacia el interior. A altitud suficiente, por ejemplo cuando se viaja en avión, el arcoíris se puede observar en forma de círculo completo. \nCuando se observa un arcoíris doble, el arco secundario rodea al primario. Su intensidad es más tenue y el orden de los colores está invertido.\nPara los colores vistos por el ojo humano, la secuencia más comúnmente citada y recordada es la de Isaac Newton, definida por siete colores fundamentales: rojo, naranja, amarillo, verde, azul, índigo y violeta. Una lectura cuidadosa del trabajo de Newton indica que el color que llamó azul es lo que actualmente llamaríamos cian.[3]​", "sections": [{"name": "Historia de la ciencia del arcoíris", "text": "El erudito filósofo griego clásico Aristóteles (384-322 a. C.) fue el primero en dedicar una atención seria al arcoíris.[4]​ En Meteorológicos, Aristóteles explicó el fenómeno como un reflejo, aunque no es la luz, sino el \"rayo visual\" (ópsis).[5]​ Según Raymond L. Lee y Alistair B. Fraser, «A pesar de sus muchas fallas y su atractivo para la numerología pitagórica, la explicación cualitativa de Aristóteles mostró una inventiva y una coherencia relativa que no tuvo parangón durante siglos. Después de la muerte de Aristóteles, gran parte de las teorías sobre el arcoíris consistieron en reacciones a su trabajo, aunque no todas ellas fueron acríticas».[6]​\nEl filósofo griego helenista Epicuro escribió en su Carta a Pítocles varias explicaciones atomistas de fenómenos astronómicos así como a los meteorológicos, entre ellos el arcoíris: «El arco iris surge cuando el sol brilla sobre el aire húmedo; o también por una cierta mezcla peculiar de la luz con el aire, que causará todas las cualidades distintivas de estos colores o algunos de ellos pertenecientes a un solo tipo, y por el reflejo de esta luz el aire alrededor se coloreará como nosotros. Véalo como es, como el sol brilla sobre sus partes. La forma circular que adopta se debe a que nuestra vista percibe que la distancia de cada punto es igual; o puede ser que, una vez unidos los átomos del aire o de las nubes y los que proceden del sol, el conjunto de ellos presenta una especie de redondez».[7]​\nEn el Libro I de Naturales Quaestiones  (c. 65 d. C.), el filósofo romano Séneca el Joven analiza ampliamente varias teorías sobre la formación del arcoíris, incluidas las de Aristóteles. Observa que los arcoíris aparecen siempre opuestos al sol, que aparecen en el agua rociada por un remero, en el agua escupida por un batidor sobre la ropa estirada por pinzas o en el agua pulverizada través de un pequeño orificio en una tubería reventada. Incluso hablaba de arcoíris producidos por pequeñas varillas (virgulae) de vidrio, anticipándose a las experiencias de Newton con los prismas. Tenía en cuenta dos teorías: una, que el arcoíris era producido por el sol reflejándose en cada gota de agua; y la otra, que era producido por el sol reflejándose en una nube con forma de espejo cóncavo; favorecía la segunda. También analizaba otros fenómenos relacionados con el arcoíris: las misteriosas \"virgas\" (varillas), los halos y la parhelia.[8]​\nSegún Hüseyin Gazi Topdemir, el físico árabe y polimata Alhazen (965-1039), intentó proporcionar una explicación científica del fenómeno del arcoíris. En su Maqala fi al-Hala wa Qaws Quzah (‘sobre el arcoíris y el halo’), Alhazen «explicó la formación del arcoíris como una imagen, que se forma en un espejo cóncavo. Si los rayos de luz provenientes de una fuente de luz más lejana reflejan a cualquier punto en el eje del espejo cóncavo, forman círculos concéntricos en ese punto. Cuando se supone que el sol como una fuente de luz más lejana, el ojo del espectador como un punto en el eje del espejo y una nube como una superficie reflectante , entonces se puede observar que los círculos concéntricos se están formando en el eje».[9]​ No pudo verificar esto porque su teoría de que «la luz del sol es reflejada por una nube antes de llegar al ojo» no permitía una posible verificación experimental.[10]​\nEsta explicación fue repetida por Averroes,[cita requerida] y, aunque incorrecta, proporcionó la base para las explicaciones correctas dadas más tarde por Kamāl al-Dīn al-Fārisī en 1309 e, independientemente, por Teodorico de Freiberg (ca. 1250 - ca. 1311)[cita requerida] —ambos habían estudiado el Libro de Óptica de al-Haytham.[11]​\nUn contemporáneo de Ibn al-Haytham, el filósofo y erudito persa Ibn Sīnā (Avicena, 980-1037), proporcionó una explicación alternativa: «que el arco no se forma en la nube oscura sino más bien en la niebla muy fina que se encuentra entre la nube y el sol o el observador. La nube, pensaba, sirve simplemente como fondo de esta sustancia delgada, al igual que cuando se coloca un revestimiento de mercurio sobre la superficie posterior del vidrio en un espejo. Ibn Sīnā cambiaría el lugar no solo del arco, sino también de la formación del color, sosteniendo que la iridiscencia es simplemente una sensación subjetiva en el ojo».[12]​ Esta explicación, sin embargo, también era incorrecta.[cita requerida] El relato de Ibn Sīnā aceptaba muchos de los argumentos de Aristóteles sobre el arcoíris.[13]​\nEn la China de la dinastía Song (960-1279), un polimata y funcionario erudito llamado Shen Kuo (1031-1095) planteó la hipótesis —como había hecho antes un tal Sun Sikong (1015-1076)— de que los arcoíris se formaban por un fenómeno de la luz solar al encontrarse gotas de lluvia en el aire.[14]​ Paul Dong señala que la explicación de Shen del arcoíris como un fenómeno de refracción atmosférica «está básicamente de acuerdo con los principios científicos modernos».[15]​\nSegún Nader El-Bizri, el astrónomo persa Qutb al-Din al-Shirazi (1236-1311), dio una explicación bastante precisa del fenómeno del arcoíris. Esta fue elaborada por su alumno, Al-Farisi  (1267-1319), quien dio una explicación más satisfactoria matemáticamente del arcoíris. «Propuso un modelo en el que el rayo de luz del sol era refractado dos veces por una gota de agua, ocurriendo uno o más reflejos entre las dos refracciones». Se realizó un experimento con una esfera de vidrio llena de agua y Al-Farisi mostró que las refracciones adicionales debidas al vidrio podían ignorarse en su modelo.[10]​ [16]​\nComo señaló en su  Kitab Tanqih al-Manazir  [La revisión de la Óptica], al-Farisi usó un gran recipiente de vidrio transparente en forma de esfera, que se llenó con agua, para tener un modelo experimental a gran escala de una gota de lluvia. Luego colocó ese modelo en una cámara oscura que tenía una apertura controlada para dejar pasar la luz. Proyectó luz en la esfera y finalmente dedujo a través de varios ensayos y observaciones detalladas de los reflejos y las refracciones de la luz que los colores del arcoíris eran fenómenos de descomposición de la luz.\nEn Europa, el Libro de óptica de Alhazen fue traducido al latín y estudiado por Robert Grosseteste. Su trabajo sobre la luz fue continuado por Roger Bacon, quien escribió en su  Opus majus  de 1268 sobre experimentos con luz brillando a través de cristales y gotas de agua que mostraban los colores del arcoíris.[17]​ Además, Bacon fue el primero en calcular el tamaño angular del arcoíris. Afirmó que la cima del arcoíris no puede aparecer a más de 42° sobre el horizonte.[18]​ Se sabe que Teodorico de Freiberg dio una explicación teórica precisa tanto del arcoíris primario como del secundario en 1307 (que luego fue desarrollada por Antonius de Demini en 1611[cita requerida]). Explicó el arcoíris primario, señalando que «cuando la luz del sol cae sobre gotas individuales de humedad, los rayos experimentan dos refracciones (al entrar y salir) y un reflejo (en la parte posterior de la gota) antes de la transmisión al ojo del observador».[19]​[20]​ Explicó el arcoíris secundario a través de un análisis similar que involucraba dos refracciones y dos reflejos.  \nRené Descartes, en su tratado de 1637, Discurso del método, avanzó aún más en esta explicación. Sabiendo que el tamaño de las gotas de lluvia no parecía afectar el arcoíris observado, experimentó con el paso de rayos de luz a través de una gran esfera de vidrio llena de agua. Al medir los ángulos en los que emergían los rayos, concluyó que el arco primario era causado por un único reflejo interno dentro de la gota de lluvia y que el arco secundario podría ser causado por dos reflejos internos. Apoyó esta conclusión con una derivación de la ley de refracción (posterior a, pero independientemente de la ley de Snell) y calculó correctamente los ángulos para ambos arcos. Sin embargo, su explicación de los colores se basó en una versión mecánica de la teoría tradicional de que los colores se producían mediante una modificación de la luz blanca.[21]​[22]​\nIsaac Newton demostró que la luz blanca estaba compuesta por la luz de todos los colores del arcoíris, que un prisma de vidrio podía separar en el espectro completo de colores — descomposición de la luz blanca—, rechazando la teoría de que los colores se producían mediante una modificación de la luz blanca. También mostró que la luz roja se refractaba menos que la luz azul, lo que llevó a la primera explicación científica de las principales características del arcoíris.[23]​ La teoría corpuscular de la luz de Newton fue incapaz de explicar los arcoíris supernumerarios, para los que no se encontró una explicación satisfactoria hasta que Thomas Young se dio cuenta de que la luz se comportaba como una onda bajo ciertas condiciones y que podía interferir consigo misma.\nEl trabajo de Young, más tarde elaborada en detalle por Richard Potter,  fue refinado en la década de 1820 por George Biddell Airy, que explicó que había una dependencia entre fuerza de los colores del arcoíris y el tamaño de las gotas de agua..[24]​ Las descripciones físicas modernas del arcoíris se basan en la dispersión de Mie, obra publicada por Gustav Mie en 1908.[25]​ Los avances en los métodos computacionales y en la teoría óptica continúan conduciendo a una comprensión más completa de los arcoíris. Por ejemplo, Nussenzveig ofrece una visión general moderna.[26]​", "subsections": []}, {"name": "Explicaciones sobre el fenómeno", "text": "Busca fuentes: «Arcoíris» – noticias · libros · académico · imágenes\nCuando la luz solar incide sobre las gotas de lluvia, estas se encargan de producir el efecto, pero en algunas mucho más que en otras. Los rayos del Sol involucrados con la formación del arcoíris salen de las gotas de lluvia con un ángulo de aproximadamente 138 grados respecto de la dirección que llevaban antes de entrar en ellas. Este es el «ángulo del arcoíris», descubierto por René Descartes en el año de 1637. Como el ángulo de salida es de solo 138 grados, la luz no se refleja exactamente hacia su origen. Esto hace posible que el arcoíris sea visible para el observador, que no se suele encontrar exactamente entre el Sol y la lluvia. De manera que siempre, si se  está frente a un arcoíris, el Sol estará detrás.\nPara ser más precisos, es la luz amarilla la que es dispersada a 138° de su trayectoria original. La luz de otros colores es dispersada en ángulos algo distintos. La luz roja del arcoíris se dispersa en una dirección ligeramente menor que 138°, mientras que la luz violeta sale de las gotas de lluvia en un ángulo un poco mayor.\nUn rayo de luz solar, de los que forman un arcoíris, cambia su dirección tres veces mientras se mueve a través de una gota de lluvia: Primero entra en la gota, lo cual ocasiona que se refracte ligeramente. Entonces se mueve hacia el extremo opuesto de la gota, y se refleja en la cara interna de la misma. Finalmente, vuelve a refractarse cuando sale de la gota de lluvia en forma de luz dispersa. La descomposición en colores es posible porque cada longitud de onda se refracta con un ángulo diferente, generando cada color del arcoíris.\nLa luz solar emerge de muchas gotas de lluvia a un tiempo. El efecto combinado es un mosaico de pequeños destellos de luz dispersados por muchas gotas de lluvia, distribuido como un arco en el cielo. Los diversos tamaños y formas de las gotas afectan la intensidad de los colores del arcoíris. Gotas pequeñas hacen un arcoíris pálido y de colores con tonalidades pastel; gotas grandes producen colores muy vivos. Además, las gotas grandes son aplastadas por la resistencia del aire mientras caen. Esta distorsión ocasiona que el \"final\" del arcoíris tenga colores más intensos. Quizás sea esta la causa de la leyenda que sugiere la existencia de una olla que contiene oro resplandeciente en el final del arcoíris.\nA veces, es posible ver también lo que se conoce como arcoíris secundario. El arcoíris primario, que se ha dado en llamar simplemente «arcoíris», es siempre un arco interior y más próximo al observador que el arcoíris secundario. Si la luz que incide sobre la gota de agua realiza al menos dos refracciones y tres reflexiones internas se puede deducir su trayectoria. El resultado es la formación de un arcoíris secundario de colores invertidos, más débil y que queda por encima del primario. Su debilitamiento se debe a la luz que se refracta y sale al exterior en cada reflexión interna.\nLos ángulos que forman los rayos incidente y refractado hacia el ojo son mayores en el rayo secundario: 50° para la luz roja y 54° para la violeta. Ya se vio  que en la formación del primario ese ángulo era de 138° para la luz roja, esto es, 42° respecto al observador.\nEl orden de los colores en el arco secundario está invertido debido a la doble reflexión interna. Teóricamente puede haber más de tres reflexiones internas, que darían lugar a cuatro y cinco arcoíris. El tercero y cuarto estarían entre el observador y el sol y quizás nunca se puedan ver. El quinto se produce en la misma zona del primero y del segundo y no es perceptible porque es muy tenue. Es posible, en un experimento de laboratorio, demostrar que se pueden conseguir hasta 13 arcoíris visibles, aunque, lógicamente su luminosidad se reduce considerablemente.\nEs interesante señalar que ninguna luz emerge en la región entre los arcoíris primario y secundario. Esto coincide con algunas observaciones, que señalan que la región entre los dos arcos es muy oscura, mientras que en la parte exterior del arco secundario y en la parte interior del arco primario es visible una considerable cantidad de luz, lo cual se debe al reflejo de la luz blanca concentrada justo antes de su refracción para formar el arcoíris. Esta zona oscura intermedia se debe a la intensidad de la cortina de agua, que absorbe toda la luz posible hacia el interior de la misma, por lo que el arco secundario es simplemente un reflejo del primario en dirección hacia el observador y es conocida como banda de Alejandro.[27]​\nEn algunas ocasiones, cuando los arcoíris primario y secundario son muy brillantes, se puede observar un tercero dentro del primario y un cuarto fuera del secundario. A estos arcos se les llama arcos supernumerarios y se deben a efectos especiales de interferencia luminosa.\nCuando alguien mira un arcoíris, lo que está viendo en realidad es luz dispersada por ciertas gotas de lluvia. Otra persona que se encuentre al lado del primer observador verá luz dispersada por otras gotas. De manera que puede decirse que cada quien ve su propio arcoíris, distinto (hablando en un sentido estricto) del que ven todos los demás.\nEs común pretender estimar la posición del arco, especialmente sus \"extremos\", es decir, allí donde desaparece por no existir gotas que descompongan la luz. Pero el arcoíris es, en realidad, un cono iris: todas las gotas situadas en la misma posición respecto del espectador y del sol descomponen la luz de igual manera. Si existen solamente gotas lejanas, el espectador tendrá la percepción de que el arco se encuentra en una posición determinada. En cambio, si unas gotas se encuentran próximas y otras alejadas, el espectador percibirá que la situación del arco es indeterminada. \nSi las condiciones atmosféricas y el sitio de observación son perfectos, entonces la lluvia y el Sol trabajan juntos para crear un anillo de luz completo, denominado arcoíris circular, como el que se vio el 6 de agosto de 2007 en la isla de Langkawi, Malasia.[cita requerida] En los arcoíris normales el rojo es el color exterior, y el violeta el interior, pero en los circulares la variación es la contraria.\nRespecto de las condiciones para ver un arcoíris se reducen a que el observador tiene que estar localizado entre el sol y una lluvia de gotas esféricas (una lluvia uniforme). Es posible que el observador crea que la lluvia no es uniforme donde él se encuentra, pero sí debe serlo desde donde localizaría el arcoíris. ¿Y cuándo son las gotas esféricas? Las gotas son esféricas cuando caen a una velocidad uniforme, constante. Esto es posible en condiciones de aceleración gravitatoria contando con las fuerzas viscosas de oposición del aire. Cuando se cumple que la velocidad de las gotas es uniforme, la gota adquiere un volumen máximo con la mínima superficie (esfera). Únicamente en estas condiciones es posible la dispersión luminosa dentro de la gota y por tanto el arcoíris, aunque ligeras variaciones de la esfera puedan dar diversas variaciones en un arcoíris. Por lo tanto, la lluvia no debe ser torrencial, ni estar afectada por el viento. Es por ello que no siempre se contempla el arcoíris cuando hay lluvia y sol.\nEs importante notar la altura del Sol cuando uno observa un arcoíris, pues es algo que ayuda a determinar qué tanto alcanza uno a ver de él: cuanto más bajo se encuentre el Sol, más alta será la cresta del arcoíris y viceversa. Alguien que pueda elevarse un poco sobre la superficie de la Tierra, se daría cuenta de que ciertos arcoíris continúan por debajo del horizonte. Quienes escalan montañas altas han logrado ver en ocasiones una buena parte de arcoíris circulares completos. Pero ni siquiera las montañas poseen la suficiente altura como para poder llegar a observar un arcoíris circular en su totalidad.\nLos aviadores han informado algunas veces haber visto genuinos arcoíris circulares completos, los cuales curiosamente han pasado inadvertidos para los pasajeros de sus aeronaves. Esto puede deberse a que las ventanas de los viajeros son muy estrechas y ofrecen un campo de visión muy reducido, a diferencia del impresionante campo visual que tiene el piloto.", "subsections": []}, {"name": "Religión y mitología", "text": "", "subsections": [{"name": "Leyenda de Gilgamesh", "text": "Otra antigua representación del arcoíris se da en la epopeya de Gilgamesh (entre el 2500 y el 2000 a. C.), donde el arcoíris es el «collar de pedrería de la gran madre Ishtar» que levanta hacia el cielo como una promesa de que «nunca olvidará estos días de la gran inundación» que destruyó a sus hijos."}, {"name": "Biblia hebrea", "text": "Según el Antiguo Testamento (hacia el siglo VII a. C.), el arcoíris fue creado por Dios tras el Diluvio universal. En el relato bíblico, este aparecería como muestra de la voluntad divina y para recordar a los hombres la promesa hecha por el propio Dios a Noé de que jamás volvería a destruir la tierra con un diluvio."}, {"name": "Mitología griega", "text": "Para los griegos, el arcoíris era una diosa mensajera entre el cielo y la tierra llamada Iris, hija de Taumante y la oceánide Electra."}, {"name": "Mitología nórdica", "text": "Para los nórdicos, el arcoíris o «Bifröst» era un puente que unía Midgard (el mundo de los hombres) y Asgard (el mundo de los dioses) custodiado por el dios Heimdall."}, {"name": "Mitología incaica", "text": "Para los incas, el arcoíris era considerado la personificación del dios Kuychi. La figura de esta deidad se asociaba con el advenimiento de eventos benéficos y nefastos."}]}, {"name": "Símbolo activista", "text": "Véase también:\nEn torno al símbolo pacifista:\nLa extensión de la preocupación por la paz en el mundo, ha llevado a la búsqueda de símbolos de carácter universal y ajenos a las principales culturas. En Italia en 1961 se empezó a utilizar, la bandera con los colores del arcoíris y la palabra «pace» (paz en italiano). El movimiento «Pace da tutti i balconi» (Paz desde todos los balcones) promueve colgar dichas banderas en los balcones como forma de adherirse al deseo de paz. Se calcula que en Milán se colgaron más de un millón de dichas banderas contra la Guerra de Irak.\nEn torno al símbolo de la bandera multicolor LGBT:\nCon el progreso de movimientos sociales reivindicacionistas en el mundo, en la actualidad destacan los movimientos por los derechos de gais, lesbianas, bisexuales y transexuales (LGBT) que escogieron como símbolo la bandera del arcoíris, y eliminando el celeste. Fue promovido por el artista Gilbert Baker y nació de la identificación inicial de tales luchas sociales LGBT con el movimiento hippie en la década de 1960, que usaba ese símbolo. Más recientemente el arcoíris invertido de seis colores se afirmó con la utilización de la canción de la cantante y actriz Judy Garland denominada «Over the Rainbow» (Sobre el arcoíris) como tema de las movilizaciones LGBT —particularmente en los Estados Unidos y el mundo occidental— por iniciativa del cantautor Rufus Wainwright'.", "subsections": []}, {"name": "Véase también", "text": "Espectro visible\nDifracción (física)\nHalo (fenómeno meteorológico)\nCielo\nArcoíris lunar\nBanda de Alejandro\nArco circunhorizontal\nAurora polar\nBandera arcoíris\nBandera LGBT\nSerpiente Arco Iris\nBifrost", "subsections": []}, {"name": "Referencias", "text": "↑ Real Academia Española. «arcoíris». Diccionario de la lengua española (23.ª edición). \n↑ «arcoíris (arco de colores que se forma cuando los rayos del sol se reflejan en las gotas de lluvia), mejor que arco iris. La preferencia por la grafía univerbal se debe a que normalmente se hace átono el primer componente: [arkoíris], más que [árko íris].». Citado en RAE y ASALE (2010). «La representación gráfica de las unidades léxicas: secuencias que se escriben en una o más palabras con idéntico valor». Ortografía de la lengua española. Madrid: Espasa Calpe. p. 547. ISBN 978-6-070-70653-0. Consultado el 3 de junio de 2017. \n↑ Waldman, Gary (1 de enero de 2002). Introduction to Light: The Physics of Light, Vision, and Color (en inglés). Courier Corporation. ISBN 978-0-486-42118-6. Consultado el 6 de noviembre de 2022. \n↑ «The Internet Classics Archive – Meteorology by Aristotle». classics.mit.edu. Archivado desde el original el 18 de febrero de 2014. \n↑ Aristóteles. Problemas. Sección 906b, referencia 321: Biblioteca Clásica Gredos. \n↑ Raymond L. Lee; Alistair B. Fraser (2001). The rainbow bridge: rainbows in art, myth, and science. Penn State Press. p. 109. ISBN 978-0-271-01977-2. «Despite its many flaws and its appeal to Pythagorean numerology, Aristotle's qualitative explanation showed an inventiveness and relative consistency that was unmatched for centuries. After Aristotle's death, much rainbow theory consisted of reaction to his work, although not all of this was uncritical.» \n↑ «Epicurus - Letter to Pythocles». www.informationphilosopher.com. Consultado el 24 de julio de 2024. \n↑ Seneca, Lucius Anneus (1 de abril de 2014). Delphi Complete Works of Seneca the Younger (Illustrated). Book I (Delphi Ancient Classics Book 27 edición). Delphi Classics. \n↑  \"explained the formation of rainbow as an image, which forms at a concave mirror. If the rays of light coming from a farther light source reflect to any point on axis of the concave mirror, they form concentric circles in that point. When it is supposed that the sun as a farther light source, the eye of viewer as a point on the axis of mirror and a cloud as a reflecting surface, then it can be observed the concentric circles are forming on the axis.\" [cita requerida]\n↑ a b c O'Connor, J.J.; Robertson, E.F. (November 1999). «Kamal al-Din Abu'l Hasan Muhammad Al-Farisi». MacTutor History of Mathematics archive, University of St Andrews. Archivado desde el original el 25 de marzo de 2007. Consultado el 7 de junio de 2007. \n↑ Nader El-Bizri 'Ibn al-Haytham et le problème de la couleur', Oriens-Occidens: Cahiers du centre d'histoire des sciences et des philosophies arabes et médiévales, C.N.R.S. 7 (2009), pp. 201–226.\n↑ Carl Benjamin Boyer (1954). «Robert Grosseteste on the Rainbow». Osiris 11: 247-258. ISSN 0369-7827. doi:10.1086/368581. «that the bow is not formed in the dark cloud but rather in the very thin mist lying between the cloud and the sun or observer. The cloud, he thought, serves simply as the background of this thin substance, much as a quicksilver lining is placed upon the rear surface of the glass in a mirror. Ibn Sīnā would change the place not only of the bow, but also of the colour formation, holding the iridescence to be merely a subjective sensation in the eye.» \n↑ Raymond L. Lee; Alistair B. Fraser (2001). The rainbow bridge: rainbows in art, myth, and science. Penn State Press. pp. 141-144. ISBN 978-0-271-01977-2. \n↑ Sivin, Nathan (1995). Science in Ancient China: Researches and Reflections Brookfield, Vermont: VARIORUM. III: Ashgate Publishing. p. 24. \n↑ Dong, Paul (2000). China's Major Mysteries: Paranormal Phenomena and the Unexplained in the People's Republic. San Francisco: China Books and Periodicals, Inc. p. 72. ISBN 978-0-8351-2676-2. \n↑ \"approximation obtained by his model was good enough to allow him to ignore the effects of the glass container.\"[10]​\n↑ Davidson, Michael W. (1 de agosto de 2003). «Roger Bacon (1214–1294)». Florida State University. Archivado desde el original el 30 de agosto de 2006. Consultado el 10 de agosto de 2006. \n↑ Raymond L. Lee; Alistair B. Fraser (2001). The rainbow bridge: rainbows in art, myth, and science. p. 156. ISBN 978-0-271-01977-2. \n↑ Lindberg, David C (Summer 1966). «Roger Bacon's Theory of the Rainbow: Progress or Regress?». Isis 57 (2): 235. doi:10.1086/350116. «when sunlight falls on individual drops of moisture, the rays undergo two refractions (upon ingress and egress) and one reflection (at the back of the drop) before transmission into the eye of the observer.» \n↑ Theodoric of Freiberg (c. 1304–1310) De iride et radialibus impressionibus (On the rainbow and the impressions of radiance).\n↑ Boyer, Carl B. (1952). «Descartes and the Radius of the Rainbow». Isis 43 (2): 95-98. doi:10.1086/349399. \n↑ Gedzelman, Stanley David (1989). «Did Kepler's Supplement to Witelo Inspire Descartes' Theory of the Rainbow?». Bulletin of the American Meteorological Society 70 (7): 750-751. Bibcode:1989BAMS...70..750G. ISSN 1520-0477. doi:10.1175/1520-0477(1989)070<0750:DKSTWI>2.0.CO;2. \n↑ O'Connor, J.J.; Robertson, E.F. (January 2000). «Sir Isaac Newton». University of St. Andrews. Archivado desde el original el 10 de junio de 2007. Consultado el 19 de junio de 2007. \n↑ Véase: *  Airy, G. B. (1838). «On the intensity of light in the neighbourhood of a caustic». Transactions of the Cambridge Philosophical Society 6 (3): 379-403. Bibcode:1838TCaPS...6..379A. \nG. B. Airy (1849) \"Supplement to a paper, \"On the intensity of light in the neighbourhood of a caustic,\" \" Transactions of the Cambridge Philosophical Society 8: 595–600.\n↑ G. Mie (1908) \"Beiträge zur Optik trüber Medien, speziell kolloidaler Metallösungen\" Archivado el 2 de marzo de 2012 en Wayback Machine. (Contributions to the optics of turbid media, especially of colloidal metal solutions), Annalen der Physik, 4th series, 25 (3): 377–445.\n↑ Nussenzveig, H. Moyses (1977). «The Theory of the Rainbow». Scientific American 236 (4): 116. Bibcode:1977SciAm.236d.116N. doi:10.1038/scientificamerican0477-116. \n↑ «El arco iris». www.sc.ehu.es. Consultado el 7 de julio de 2024. ", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una galería multimedia sobre Arcoíris.\n Wikiquote alberga frases célebres de o sobre Arcoíris.\n Wikcionario  tiene definiciones y otra información sobre arcoíris.\nArcoíris según Descartes. Archivado el 4 de diciembre de 2008 en Wayback Machine.\nFenómenos físicos de la meteorología.\nPreguntas y respuestas sobre el arcoíris. Archivado el 29 de diciembre de 2009 en Wayback Machine.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/BASIC", "title": "BASIC", "summary": "Busca fuentes: «BASIC» – noticias · libros · académico · imágenes\nBASIC, siglas de Beginners' All-purpose Symbolic Instruction Code[1]​ (en castellano: ‘Código simbólico de instrucciones de propósito general para principiantes’), es una familia de lenguajes de programación de alto nivel. \nEl BASIC original, el Dartmouth BASIC, fue diseñado en 1964 por John George Kemeny, Thomas Eugene Kurtz y Mary Kenneth Keller en el Dartmouth College en New Hampshire, Estados Unidos, como un medio para facilitar la programación en ordenadores a estudiantes (y profesores) que no fueran de ciencias. \nEn aquella época, casi todo el uso de los computadores requería codificar software hecho a medida, con lo cual quedaba restringido a personas con formación como científicos y matemáticos. \nBASIC originalmente fue desarrollado como una herramienta de enseñanza. El lenguaje y sus variantes llegaron a estar ampliamente disponibles en las microcomputadoras a finales de los años 1970 y en los años 1980. \nBASIC sigue siendo popular a día de hoy en un puñado de dialectos altamente modificados, y en nuevos lenguajes, influenciados por BASIC tales como Microsoft Visual Basic o Gambas en GNU/Linux. \nEn el año 2006, el 59 % de los desarrolladores para la plataforma .NET usaban Visual Basic .NET como su único lenguaje.[2]​", "sections": [{"name": "Historia", "text": "", "subsections": [{"name": "Antecedentes", "text": "A principios de la década de 1960, las computadoras eran sumamente caras y se utilizaban únicamente para propósitos especiales, ejecutando «una única tarea» a la vez. Sin embargo, durante el transcurso de esa década, los precios bajaron al punto que incluso algunas pequeñas empresas ya podían costearlas. La velocidad de proceso de las máquinas se incrementó al grado que a menudo quedaban demasiado tiempo ociosas, porque no había suficientes tareas para ellas. Todo ello fue debido a la rápida evolución del hardware.\nLos lenguajes de programación de aquellos tiempos estaban diseñados para propósitos específicos, como las máquinas en las que eran ejecutados; por ejemplo para desarrollar aplicaciones cálculo o procesamiento de fórmulas se diseñó el lenguaje FORTRAN, en tanto que para la programación en administración o gestión de información se desarrolló específicamente el COBOL.\nA fin de incrementar el rendimiento y amortizar mejor los costos (por reducción del tiempo ocioso del procesador), y siendo que ya la velocidad de las máquinas comenzó a permitirlo, se propuso la idea de ejecutar más de una tarea «simultáneamente», fue así que surgió el concepto de sistema de tiempo compartido, que comenzó a ganar mucha popularidad. En sistemas de ese tipo, el tiempo de procesamiento del procesador central se dividía, y a cada usuario se le otorgaba secuencialmente y cíclicamente una pequeña porción o «cuota» de tiempo de proceso. Las máquinas eran lo suficientemente rápidas como para provocar en los usuarios la ilusión de que disponían de la funcionalidad de la máquina todo el tiempo para ellos («seudo-simultaneidad» de procesos). Esa distribución del tiempo de cómputo entre los usuarios redujo considerablemente el costo de la computación, ya que una sola máquina podía ser compartida por numerosos usuarios."}, {"name": "Nacimiento y primeros años", "text": "El lenguaje BASIC fue inventado en 1964 por John George Kemeny (1926-1992) y Thomas Eugene Kurtz (1928-) en el Dartmouth College, con la ayuda de otros como la programadora Mary Kenneth Keller. En años subsiguientes, mientras que otros dialectos de BASIC aparecían, el BASIC original de Kemeny y Kurtz fue conocido como Dartmouth BASIC.\nBASIC fue diseñado para permitir a los estudiantes escribir programas usando terminales de un computador en tiempo compartido. Estaba pensado para reducir notablemente la complejidad de los otros lenguajes del momento, con uno diseñado específicamente para la clase de usuarios que los sistemas de tiempo compartido permitían: un usuario más sencillo, fuera del área de las ciencias de la computación, a quien no le interesaba tanto la velocidad, solo el hecho de ser capaz de programar y usar la máquina sin demasiadas complicaciones. Los diseñadores del lenguaje también querían que permaneciera en el dominio público, lo cual contribuyó a que se diseminara rápidamente.\nLos ocho principios que rigieron el diseño de BASIC fueron:\nSer fácil de usar para los principiantes.\nSer un lenguaje de propósito general (no orientado).\nPermitir a los expertos añadir características avanzadas, conservando simple el lenguaje para los principiantes.\nSer interactivo en todos los casos.\nProveer mensajes de errores claros y amigables.\nResponder rápido en los programas pequeños en general.\nNo requerir un conocimiento del hardware de la computadora.\nProteger al usuario del sistema operativo.\nEl lenguaje fue en parte basado en FORTRAN II y otra parte en Algol 60, con adiciones para hacerlo apropiado en sistemas de tiempo compartido y con elementos que facilitaran la operación aritmética de matrices. BASIC fue implementado por primera vez para la mainframe GE-265, máquina que soportaba múltiples terminales.\nEn 1968 Edsger Dijkstra publicó una carta con una famosa crítica en la que consideraba que los lenguajes de programación que usaban sentencias GOTO para estructurar un programa eran nocivos para la productividad del programador, y para la calidad del código resultante. En este artículo no se menciona a ningún lenguaje de programación en particular; únicamente se indica que el uso excesivo de GOTO en lenguajes de alto nivel es algo no recomendable, y proporciona las razones técnicas por las que esto es así. Pero sí se observó, desde sus inicios, una marcada tendencia de los programadores a utilizar excesivamente el GOTO en BASIC, máxime en los noveles; hecho este que fue decreciendo con la incorporación al lenguaje de otros recursos, tales como subrutinas parametradas, y posteriormente con la aparición de técnicas de programación estructurada.\nContrario a la creencia popular, BASIC inicialmente no era un lenguaje interpretado sino compilado. Casi inmediatamente después de su lanzamiento, los profesionales de computación comenzaron a alegar que BASIC era muy lento y simple. Tal argumento, hasta no hace mucho, fue un tema recurrente en la industria de las computadoras.\nAun así, BASIC se extendió hacia muchas máquinas y plataformas, y se popularizó moderadamente en las minicomputadoras como las de la serie DEC PDP y la Data General Nova. En estos casos, el lenguaje era implementado como  intérprete, en vez de un compilador, o alternativamente, en ambas formas de funcionamiento."}, {"name": "Crecimiento explosivo", "text": "Sin embargo, fue con la introducción de la microcomputadora Altair 8800 en 1975 que BASIC se extendió ampliamente. La mayoría de los lenguajes de programación eran demasiado grandes para ser albergados por las pequeñas memorias de que disponían la mayor parte de las máquinas en esa época; y con el lento almacenamiento que permitía la cinta de papel, y más tarde la cinta de audiocasete (los discos magnéticos aún no existían), y la falta de editores de texto adecuados, un lenguaje pequeño como BASIC resultaba una buena opción. \nUno de los primeros en aparecer fue Tiny BASIC, una implementación simple de BASIC escrita originalmente por el Dr. Li-Chen Wang, y portada más tarde a la máquina Altair por Dennis Allison, a petición de Bob Albrecht (quien después fundó Dr. Dobb's Journal (DDJ)). El diseño de Tiny BASIC y el código fuente completo fue publicado en DDJ en 1976.\nEn 1975 Microsoft (entonces formado por dos personas: Bill Gates y Paul Allen) lanzó el Altair BASIC. Luego comenzaron a aparecer bajo licencia versiones para otras plataformas, y millones de copias y variantes pronto estarían en uso. MS BASIC se convirtió en uno de los lenguajes estándar en el Apple II. \nEn 1979 Microsoft estaba negociando con varios vendedores de microcomputadores, incluyendo IBM, para licenciar un intérprete BASIC para sus ordenadores. Se incluyó una versión en las memorias ROM de los PC IBM para los equipos sin discos. \nEn los equipos que disponían de una unidad de disquete, el BASIC era iniciado automáticamente siempre que no se colocara ningún disquete de arranque como sistema operativo.\nLas nuevas compañías intentaban seguir los pasos del éxito de Altair: IMSAI, North Star, y Apple, creando la revolución de la computadora casera. BASIC se convirtió en una característica estándar para casi todas las computadoras hogareñas; la mayoría venía con un sistema operativo básico e intérprete de BASIC, todo alojado en una ROM (algo hecho por primera vez en la Commodore PET en 1977). \nPronto habría muchos millones de computadores alrededor del mundo ejecutando BASIC, un número mucho más grande que el de todos los usuarios de otros lenguajes juntos. Muchos programas, especialmente los de la Apple II e IBM PC, dependían de la presencia del intérprete de BASIC de Microsoft y no podían ejecutarse sin este; por lo que Microsoft usó la licencia de copyright en los intérpretes de BASIC para influir en las negociaciones con los vendedores de computadores.\nEl BASIC fue también el lenguaje preinstalado en los computadores hogareños europeos de la década de los 80 como el ZX Spectrum (Sinclair BASIC), Amstrad CPC (Locomotive BASIC), MSX (MSX BASIC), el Commodore 64 y 128 (Basic 2.0, Basic 7.0, Simons' Basic), los Commodore Amiga (AmigaBASIC) o la familia Atari de 8 bits (Atari BASIC) y en los computadores hogareños japoneses NEC PC-8801 y NEC PC-9801 (N88-BASIC), haciendo muchas veces la función de intérprete y sistema operativo primitivo, ya que venían implementados ambos en ROM. Texas Instruments incorporó su propia versión en sus microcomputadoras, tal como la TI99/4A, y también con una versión extendida en una ROM externa o cartuchos (TI-Basic y TI Extended"}, {"name": "Madurez", "text": "En este período se crearon versiones de BASIC nuevas y más poderosas. Microsoft vendió varias versiones de BASIC para MS-DOS/PC-DOS, incluyendo BASICA, GW-BASIC (una versión compatible con BASICA que no necesitaba la ROM de IBM), y Quick BASIC. El fabricante de Turbo Pascal, Borland, publicó Turbo BASIC 1.0 en 1985 (versiones sucesoras aún se venden bajo el nombre de PowerBASIC por otra compañía). Aparecieron varias extensiones de BASIC para computadores caseros, típicamente con capacidad para gráficos, sonido, y comandos DOS, así como facilidades para Programación estructurada. Hubo lenguajes que usaron la sintaxis de BASIC como base para otros sistemas totalmente diferentes, por ejemplo GRASS.\nSin embargo a finales de la década de 1980 las computadoras nuevas eran mucho más complejas, e incluían características (como la Interfaz gráfica de usuario) que hacían a BASIC menos apropiado para programarlas. Al mismo tiempo las computadoras progresaban de ser interés para aficionados a herramientas usadas principalmente para ejecutar aplicaciones escritas por otros, y la programación en sí se fue haciendo menos importante para una creciente mayoría de usuarios. BASIC comenzó a desvanecerse, aunque numerosas versiones aún estaban disponibles.\nUna de las más poderosas fue el denominado Locomotive BASIC 2 diseñado para el entorno gráfico GEM. Esta nueva versión del lenguaje permitía crear aplicaciones con interfaces gráficas dotadas de ventanas, menús y diferentes tipos de gráficos estadísticos.\nLa suerte de BASIC dio un giro nuevamente con la introducción de Visual Basic de Microsoft. Si bien este lenguaje utiliza prácticamente todas las palabras clave (sentencias, estructuras de control y funciones intrínsecas) y forma de manejo y tipo de datos que versiones BASIC anteriores (DOS); VB es abismalmente más potente y evolucionado; y se ha convertido en uno de los lenguajes más utilizados en la plataforma Windows;  se estima [cita requerida] que entre el 70 y el 80% del total de aplicaciones comerciales son programadas en VB. A partir de 2002, y con la introducción de la plataforma .NET Framework de Microsoft, Visual Basic comienza a utilizar el paradigma «orientado a objetos», aumentando la potencia del lenguaje y haciéndolo multiplataforma. Visual Basic for Applications (VBA) fue añadido a Microsoft Excel 5.0 en 1993 y al resto de la línea de productos de Microsoft Office en 1997. Windows 98 incluyó un intérprete de VBScript. La versión más reciente de Visual Basic es llamada VB.NET. Por otra parte, también existe la variante OpenOffice.org Basic menos poderosa pero similar a VBA de Microsoft."}]}, {"name": "El lenguaje", "text": "", "subsections": [{"name": "Sintaxis", "text": "La sintaxis mínima de BASIC solo necesita los comandos LET, INPUT, PRINT, IF y GOTO. Un intérprete que ejecuta programas con esta sintaxis mínima no necesita una pila. Algunas de las primeras implementaciones eran así de simples. Si se le agrega una pila, se pueden agregar también ciclos FOR anidados y el comando GOSUB. Un intérprete BASIC con estas características necesita que el código tenga números de línea.\nLos números de línea fueron un aspecto muy distintivo del BASIC clásico. Sin embargo, el uso de números de línea tiene la desventaja de requerir que el programador estime cuántas líneas ocupará la parte del programa que escribe. Este requerimiento se cumple generalmente incrementando los números de línea en un intervalo regular, como 10, pero esto lleva a problemas a la hora que el código después agregado exceda el espacio disponible entre las líneas originales. Para aliviar este problema de los primeros intérpretes de BASIC, los usuarios expertos pronto escribieron sus propios programas utilitarios para renumerar sus programas, después del ingreso inicial. Más tarde aparecieron intérpretes de BASIC que incluían un comando específico RENUMBER, el que permitía renumerar rápidamente (y las veces que se quisiera) todo el código nuevamente, con cualquier intervalo entre líneas indicado y a partir de un número entero dado; eliminando así el principal problema de la numeración de líneas obligatoria.\nEn los dialectos modernos de BASIC MIUN ya no es necesario incluir números de línea (aunque son permitidos), y la mayoría (o todos) han añadido control de flujo estructurado y los constructores de declaración de datos similares a los de otros lenguajes, tales como C y Pascal:\ndo\nloop\nwhile\nuntil\nexit\non... goto\ngosub\nselect ... case\nCasi todos los dialectos de BASIC incluyen el comando REM (remark), que posteriormente fue sustituido por el símbolo ´ (apóstrofo o comilla simple).  Es un comando no ejecutable, se utiliza a los fines de incluir líneas y notas aclaratorias en el código fuente, para la mejor comprensión (y documentación) del programa.\nVariantes recientes como Visual Basic han introducido algunas características orientadas a objetos, y hasta herencia en la última versión. La administración de memoria es más fácil que con muchos otros lenguajes de programación procedurales por el uso de un Recolector de basura (y a costas de la velocidad de ejecución)."}, {"name": "Procedimientos y Control de Flujo", "text": "BASIC no tiene una biblioteca externa estándar como otros lenguajes como C. En cambio, el intérprete (o compilador) contiene una biblioteca incorporada de procedimientos intrínsecos. Estos procedimientos incluyen la mayoría de las herramientas que un programador necesita para aprender a programar y escribir aplicaciones sencillas, así como funciones para realizar cálculos matemáticos, manejar cadenas, entrada desde la consola, gráficos y manipulación de archivos.\nViejos dialectos de BASIC no permitían a los programadores escribir sus propios procedimientos. Los programadores en cambio debían escribir sus programas con un gran número de enunciados GOTO para hacer las derivaciones de flujo y retorno del programa. Esto podía producir un código fuente muy confuso (la mayoría de las veces era así), comúnmente conocido como Código espagueti; el cual era sumamente difícil de mantener, mucho menos por programadores ajenos al desarrollo del software.\nCon la inclusión posterior de enunciados GOSUB (Go-Subroutine) se ramificaba el programa a especies de subrutinas, sin parámetros o variables locales. Ellas proveen una forma de implementar una suerte de procedimientos (realmente no lo son, sencillamente es un «salto y retorno») y estructurar más el programa, evitando bastante la utilización de la dañina sentencia GOTO.\nLa mayoría de las versiones de BASIC más modernas, como Microsoft QuickBASIC (1985-1988) y BASIC PDS (Profesional Developmen System - 1990) añadieron soporte completo para subrutinas, funciones y programación estructurada. Esta es otra área donde BASIC difiere de muchos lenguajes de programación.\nSin embargo la primitiva GOSUB se ha mantenido hasta las versiones actuales, por razones compatibilidad.\nBASIC, como Pascal, hace una distinción entre un procedimiento que no devuelve un valor (llamado subrutina) y un procedimiento que lo hace (llamado función). Muchos otros lenguajes (como C) no hacen esa distinción y consideran todo como una función (algunas que devuelven un valor «void», ‘vacío’).\nMientras que las funciones que devuelven un valor son una adición relativamente reciente a los dialectos de BASIC, muchos de los primeros sistemas soportaban la definición de funciones matemáticas en línea, con DEF FN («DEFine FunctioN» [DEFinir FuncióN]). El Dartmouth BASIC original también soportaba funciones al estilo de Algol, así como subrutinas desde sus primeros tiempos."}, {"name": "Tipos de Datos", "text": "BASIC es reconocido por tener muy buenas funciones para manipular cadenas de caracteres. Los primeros dialectos ya tenían un juego de funciones fundamentales (LEFT$, MID$, RIGHT$) para extraer y/o reemplazar subcadenas fácilmente. Como las cadenas son utilizadas en aplicaciones diarias, esta era una ventaja considerable sobre otros lenguajes al momento de su introducción.\nEl Dartmouth BASIC original soportaba únicamente datos de tipo numérico y cadenas. No había un tipo entero. Todas las variables numéricas eran de coma flotante. Las cadenas eran de tamaño dinámico. Soportaba arreglos de ambos, números y cadenas, en una o dos dimensiones.\nCada dialecto moderno de BASIC posee al menos los tipos de datos numérico y cadena. Estos tipos de datos se pueden distinguir usando un posfijo: los identificadores de cadenas terminan con $ (signo dólar, ejemplo la variable NOMBRE$), mientras que los numéricos sencillamente no llevan posfijo; a menos que se requiera indicar y forzar explícitamente qué tipo de numérico es, por ejemplo A% es entero, A! es real simple precisión y A# es real doble precisión.\nEn BASIC las variables no necesitan forzosamente ser declaradas antes de usarse, excepto los arreglos de más de 10 elementos;  aunque versiones BASIC relativamente modernas poseen la opción (considerada buena práctica de programación) para obligar al programador a declarar toda variable antes de su uso (una directiva como OPTION EXPLICIT). La declaración de variables en BASIC se hace usando la palabra clave DIM.\nMuchos dialectos también soportan tipos numéricos adicionales, como enteros de 16 y 32 bits (simple y long, respectivamente), además de sus números de coma flotante. Adicionalmente algunos permiten la utilización de tipos de datos definidos por el usuario, similar a los «records» de Pascal, o las «structs» de C.\nVersiones modernas de BASIC (como VBA) soportan una gran variedad de tipos de datos primitivos (o intrínsecos), además de los definidos por el usuario.\nLa mayoría de los dialectos de BASIC soporta arreglos en todos sus tipos de datos; es común también el soporte para arreglos mulidimensionales\nEjemplos:\nDIM\nMatrizDeEnteros\n(\n100\n,\n)\nAS\nINTEGER\nVectorDeEnteros%\n30\nListaDeNombres\n50\nSTRING\nListaDeCiudades$\nDependiendo del dialecto de BASIC y del uso del enunciado OPTION BASE, el primer índice de los arreglos que se declaren será 1, por defecto es cero.\nEn los ejemplos anteriores, si no se declara previamente «OPTION BASE 1», el primero es un arreglo en dos dimensiones de enteros 16 bits, con índices que van desde 0 hasta 100 (matriz de 101 x 101 elementos); en tanto que el segundo es un arreglo de enteros en una sola dimensión, de 0 a 30 (vector de 31 elementos). Observar que las dos formas de declaración de enteros son equivalentes, explicitándolo o con el uso del posfijo %. Análogamente para cadenas o string de caracteres, que en este caso además son de longitud variable (dinámicas, por defecto)."}]}, {"name": "Disponibilidad y variantes del lenguaje", "text": "BASIC está disponible para casi todas las plataformas y sistemas operativos existentes. Una implementación gratuita que cumple con estándares y es multiplataforma es Bywater BASIC (bwBASIC). El intérprete está escrito en C y viene bajo la licencia GNU. Está diseñado para interfaz de texto o consola (no gráfica), no incluye soporte para crear interfaces gráficas de usuario (GUI's, Graphical User Interface). Hay un BASIC gratuito que si incluye soporte para GUI, es similar a Visual Basic y se ejecuta en Windows y GNU/Linux, es Phoenix Object BASIC.\nLas versiones de intérpretes/compiladores más conocidos son la línea de productos Quick BASIC y QBASIC, este último es solo intérprete, ambos son de Microsoft. En la actualidad lo es el moderno Visual BASIC, que Microsoft ha tratado de mantener al menos mínimamente compatible con incluso las primeras versiones de sus BASIC (en realidad es escasamente compatible), si bien existe FreeBASIC que es un compilador libre, compatible en sintaxis con QBASIC/QuickBASIC.\nOtras versiones comerciales incluyen PowerBASIC de PowerBASIC, PureBasic de Fantaisie Software, así como TrueBASIC de TrueBASIC, que cumple con los últimos estándares oficiales de BASIC. (True BASIC Inc. fue fundada por los creadores originales de Dartmouth BASIC.)\nREALbasic es una variante disponible para Mac OS Classic, Mac OS X, Microsoft Windows y GNU/Linux, comercializada por los actuales propietarios de Rapid-Q, otra implementación inicialmente libre de BASIC actualmente abandonada. Una versión de un dialecto simple de BASIC para la parrot virtual machine, muestra cómo se implementa un intérprete BASIC en un lenguaje similar al ensamblador. SmallBASIC es un dialecto que ejecuta en muchas plataformas (Win32, DOS, GNU/Linux y PalmOS) y viene bajo la licencia GNU (GPL).\nExisten muchas implementaciones de BASIC freeware o GNU, como BCX, YaBasic, HBasic, XBasic, Gambas o Just BASIC, entre otras.", "subsections": []}, {"name": "Ejemplos de código fuente", "text": "", "subsections": [{"name": "Ejemplo 1: ¡Hola Mundo!", "text": "PRINT\n\"¡Hola Mundo!\""}, {"name": "Ejemplo 2: BASIC original no estructurado (Applesoft BASIC)", "text": "10\nINPUT\n\"Cuál es su nombre:\"\n;\nNN$\n20\n\"Bienvenido al 'asterisquero' \"\n25\n\"con cuántos asteriscos inicia [Cero sale]:\"\nN\n40\nIF\n<=\n0\nTHEN\nGOTO\n200\n$\n=\n\"\"\n60\nFOR\nI\n1\nTO\n70\n+\n\"*\"\n80\nNEXT\n90\n\"AQUI ESTAN:\"\n100\n\"Desea más asteriscos:\"\nSN$\n110\n120\n<>\n\"S\"\nOR\n\"s\"\n130\n\"CUANTAS VECES DESEA REPETIRLOS [Cero sale]:\"\nVECES\n140\n150\n160\n170\n180\n185\nREM A repetir todo el ciclo (comentario)\n190\n25\nEND"}, {"name": "Ejemplo 3: Equivalente en BASIC estructurado (Quick BASIC)", "text": "DEFINT\n-\n'Declara entera toda variable que comience con letras I a N\niTrue\nBOOLEAN\n-1\n'Flag en Verdadero\n\"¿Cuál es su nombre\"\nNombreUsuario$\n\"Bievenido al 'asterisquero',\"\nDO\n\"¿Con cuántos asteriscos inicia [Cero sale]:\"\nNroAsteriscos\nEXIT\nAsteriscos$\n\"AQUI ESTAN: \"\nLOOP\nUNTIL\n'Salida\niVeces\nWHILE"}]}, {"name": "Véase también", "text": "Implementaciones de BASIC\nBasictoPHP\nDartmouth BASIC\nTiny BASIC\nLocomotive BASIC\nXBasic\nXblite\nSuperBASIC\nFreeBASIC\nGfa-BASIC\nRapid-Q\nAutoIt\nLSE (lenguaje)\nBASICs de Microsoft:\nMicrosoft BASIC\nPara antiguos computadores\nAltair BASIC\nAMOS\nApplesoft BASIC\nCommodore BASIC\nMSX BASIC\nPara IBM PC DOS\nBASICA\nPara MS-DOS\nGW-BASIC\nQBASIC\nQuickBASIC\nPara Windows\nVisual Basic\nVisual Basic .NET\nPara Internet\nVBScript\nBASICs de Mac:\nPara Mac OS\nBASICs de GNU/Linux:\nSoftware privativo\nREALbasic\nSoftware libre\nGambas\nHBasic\nKBasic\nOtros\nIntérprete BASIC\nProgramación\nInformática\nSoftware\nLínea de código fuente\nLenguaje de alto nivel\nLenguaje interpretado\nIntérprete", "subsections": []}, {"name": "Referencias", "text": "↑ The acronym is tied to the name of an unpublished paper by Thomas Kurtz and is not a backronym, as is sometimes suggested in older versions of The Jargon File\n↑ Mono brings Visual Basic programs to Linux, By Steven J. Vaughan-Nichols, 19 de febrero de 2007, Linux-Watch.", "subsections": []}, {"name": "Bibliografía", "text": "KEMENY, J.G.; T.E. KURTZ (1986). Structured BASIC programming (en inglés). New York, USA: John Wiley & Sons. ISBN 0-471-81087-8.  La referencia utiliza el parámetro obsoleto |coautores= (ayuda)\nBennet, P. Lientz (1976). A comparative evaluation of versions of BASIC (en inglés) 19. New York, USA: ACM. pp. 175-181. ISSN 0001-0782. \nGottfries, Byron S. (1984). Teoría y  problemas de Programación BASIC. traducción, Guillermo Caro Murillo, Jesús Villamizar Herrera (2a. ed. edición). Buenos Aires; Bogotá: McGraw-Hill. pp. 278 p. ISBN 968-451-396-8. \nKemeny, John G.; Thomas E. Kurtz (1984). Programación BASIC. México: Cecsa. pp. 432 p. ISBN 968-26-0402-8.  La referencia utiliza el parámetro obsoleto |coautores= (ayuda)\nFinkel, Leroy; Jerald R. Brown (1986). Programación de archivos de datos en BASIC. México; Argentina: Limusa. pp. 361 p. ISBN 968-18-1889-X. «(Series Instrucción Programada Limusa)».  La referencia utiliza el parámetro obsoleto |coautores= (ayuda)\nPetroutsos, Evangelos (1999). Visual Basic 6 (1a ed. edición). Anaya Multimedia. pp. 864 p. ISBN 978-84-415-0829-3. \nDobson, Rick (2002). Programación De Microsoft Sql Server 2000 Con Microsoft Visual Basic .net (1a ed. edición). McGraw-Hill. pp. 664 p. ISBN 978-84-481-3721-2. \nHalvorson, Michael (2008). Visual Basic 2008 (1a ed. edición). Anaya Multimedia. pp. 656 p. ISBN 978-84-415-2448-4. ", "subsections": []}, {"name": "Enlaces externos", "text": "Tomas Kurtz, co-inventor de BASIC\nA Brief History of Programming Languages\nTrue BASIC - Home Web\nTutorial de QBasic - Universidad de Oviedo\nTutorial de QBasic -Monografias.com\niBASIC - Home Web", "subsections": []}]}
