{"url": "https://es.wikipedia.org/wiki/Joystick", "title": "Palanca de mando", "summary": "Una palanca de mando o joystick (del inglés joy, alegría, y stick, palo)[1]​ es un periférico de entrada que consiste en una palanca que gira sobre una base e informa su ángulo o dirección al dispositivo que está controlando. Es el dispositivo de control principal en la cabina de vuelo de muchos aviones civiles y militares, ya sea como una palanca de control central o una palanca de control lateral. Algunas palancas poseen interruptores suplementarios para controlar diversos aspectos del vuelo de la aeronave.\nLas palancas de mando también se usan para controlar videojuegos y generalmente tienen uno o más botones cuyo estado también puede leer el computador. Una variación popular de la palanca de mando que se usa en las consolas de videojuegos modernas es la palanca analógica. Las palancas de mando también se utilizan para controlar máquinas como grúas, camiones, vehículos subacuáticos no tripulados, sillas de ruedas, cámaras de vigilancia y cortacéspedes de giro cero. Las palancas de mando miniatura accionados por el dedo se han adoptado como dispositivos de entrada para equipos electrónicos más pequeños, como teléfonos móviles.", "sections": [{"name": "Aviación", "text": "Las palancas de mando fueron diseñadas como controles para los alerones y el timón de profundidad, y se sabe que se usaron como tales en el avión Blériot VIII de Louis Bleriot en 1908, en combinación con una barra de timón accionada por pedal para la superficie de control de guiñada en la cola.[2]​\nEl origen del término \"joystick\" no es del todo claro. Se dice que fue usado por el piloto francés Robert Esnault-Pelterie a principios del siglo XX.[3]​ Otras fuentes dan el crédito a algunos de sus compañeros pilotos: Robert Loraine, James Henry Joyce y A. E. George. Loraine es citado por el Oxford English Dictionary por usar el término \"joystick\" en su diario en 1909 cuando fue a Pau para aprender a volar en la escuela de Bleriot. George fue un aviador pionero que, junto a su colega Jobling, construyó y voló un biplano hacia Newcastle, Inglaterra en 1910. Supuestamente inventó el \"Palo de George\" (George Stick), que se hizo más popularmente conocido como el joystick. La columna de control de la aeronave diseñada por George y Jobling está en la colección del Discovery Museum en Newcastle upon Tyne, Inglaterra. Los joysticks estaban presentes en los primeros aeroplanos, aunque sus orígenes mecánicos son inciertos.[4]​ La acuñación del término \"joystick\" en realidad puede atribuirse a Loraine, ya que es el uso conocido más antiguo del término, aunque ciertamente no inventó el dispositivo.", "subsections": []}, {"name": "Palancas de mando electrónicas", "text": "", "subsections": [{"name": "Historia", "text": "La palanca de mando eléctrica de dos ejes fue inventado por CB Mirick en el Laboratorio de Investigación Naval de los Estados Unidos (NRL, por sus siglas en inglés) y patentado en 1926 (Patente de Estados Unidos N.º 1.597.416).[5]​ En esa época, el NRL estaba desarrollando activamente un avión de control remoto y el joystick posiblemente se usó para apoyar este esfuerzo. En la patente otorgada, Mirick escribe: «Mi sistema de control es particularmente aplicable para maniobrar aviones sin piloto».[6]​\nLos alemanes desarrollaron una palanca de mando eléctrica de dos ejes alrededor del año 1944. El dispositivo se usó como parte del sistema de transmisión de control de radio llamado Funkgerät FuG 203 Kehl utilizado en ciertos aviones bombarderos alemanes.[7]​ También fue utilizado para guiar tanto al misil antibuque Henschel Hs 293 como a la bomba guiada Fritz-X,[8]​ contra objetivos marítimos y otros. Aquí, la palanca del transmisor Kehl fue utilizado por un operador para dirigir el misil hacia su objetivo. Esta palanca tenía interruptores de encendido-apagado en lugar de sensores analógicos. Tanto el Hs 293 como el Fritz-X usaron receptores de radio FuG 230 Straßburg para enviar las señales de control de Kehl a las superficies de control de la artillería. Se usó una palanca de mando similar para el control de la bomba guiada americana Azon, estrictamente para dirigir la bomba lateralmente en el eje vertical.[9]​\nEste invento alemán fue aprovechado por el equipo de científicos del Heeresversuchsanstalt en Peenemünde. Aquí, una parte del equipo del programa alemán de cohetes estaba desarrollando el misil Wasserfall, una variante del cohete V2, el primer misil tierra-aire. El equipo de desarrollo del Wasserfall modificó el sistema de control para convertir la señal eléctrica a señales de radio que se transmitían al misil, eliminando la necesidad del cable.[10]​\nEn la década de 1960, el uso de las palancas de mando se generalizó en los sistemas de aeronaves radiocontroladas como el Kwik Fly producido por Phill Kraft (1964).[11]​ La ahora desaparecida firma Kraft Systems finalmente se convirtió en un importante proveedor OEM de joysticks para la industria informática y otros usuarios. El primer uso de las palancas de mando fuera de la industria aeronáutica controlada por radio pudo haber estado en el control de sillas de ruedas motorizadas, como el Permobil (1963). Durante este período de tiempo, la NASA utilizó palancas de mando como dispositivos de control como parte de las misiones Apolo.[12]​\nEn muchos aviones modernos la palanca de mando ha recibido una nueva vida útil para el control de vuelo en forma de \"palanca lateral\" (side-stick), un controlador similar a un joystick de videojuegos pero que se usa para controlar el vuelo, reemplazando el yoke tradicional. La palanca lateral ahorra peso, mejora el movimiento y la visibilidad en la cabina, y puede ser más segura en un accidente que el tradicional \"Yoke de control\".[13]​"}, {"name": "Juegos electrónicos", "text": "Ralph H. Baer, inventor de los videojuegos de televisión y Bill Harrison, dieron a conocer los usos de las palancas de mando en videojuegos. En estos primeros videojuegos, se pudieron controlar la posición horizontal y vertical de un punto mostrado en una pantalla.[14]​ La palanca de mando para juegos electrónicos más antigua con un botón de disparo fue lanzado por Sega como parte de su videojuego de arcade Missile de 1969, un videojuego de simulación de disparos que lo usó como parte de un esquema de control dual temprano, donde se usan dos botones direccionales para mover un tanque motorizado y una palanca de mando bidireccional para disparar y dirigir el misil hacia los aviones que se aproximan y que se muestran en la pantalla; cuando se golpea un avión, se anima una explosión en la pantalla junto con un sonido de explosión.[15]​ En 1970, el videojuego fue lanzado en América del Norte como S.A.M.I.[16]​ por Midway Games.[15]​\nEn 1973, Taito diseñó una palanca de cuatro direcciones como parte del videojuego Astro Race, un videojuego de carreras arcade,[17]​ mientras que en 1975 Western Gun, un videojuego del tipo Matamarcianos multidireccional, introdujo un control con dos palancas de ocho direcciones; una palanca servía para movimiento y la otra para cambiar la dirección de disparo. En América del Norte, el videojuego fue lanzado por Midway bajo el título Gun Fight.[18]​ En 1976, Taito lanzó Interceptor, un simulador de vuelo de combate en primera persona que involucraba el pilotaje de un avión de caza mediante el uso de un de una palanca de mando de ocho direcciones para apuntar y disparar contra un avión enemigo.[19]​\nEl controlador Atari CX40 de 1977, conocido como el controlador \"clásico\" de Atari y desarrollado para el Atari 2600,[20]​ era una palanca de mando digital, con un solo botón de disparo. El puerto del controlador de Atari fue durante muchos años la especificación estándar de los joystick digitales de facto. Las palancas de mando se usaban comúnmente como controladores en consolas de la primera y segunda generación, para dar paso al mando tradicional con la Nintendo Entertainment System y la Sega Master System a mediados de la década de 1980.\nEn 1985, Space Harrier un videojuego arcade del tipo rail shooter en tercera persona desarrollado por Sega, introdujo una verdadera palanca de mando analógica, utilizada para el movimiento. La palanca podía registrar el movimiento en cualquier dirección, así como también medir el grado de empuje, lo que lograba mover al personaje del jugador a diferentes velocidades dependiendo de qué tan lejos se empujaba la palanca en cierta dirección.[21]​\nUna variación distinta de una palanca de mando analógica es una pistola posicional, que funciona de manera diferente a una pistola de luz. En lugar de utilizar sensores de luz, una pistola posicional es esencialmente una palanca de mando analógica montada en un lugar fijo que registra la posición de la pistola para determinar hacia dónde apunta el jugador en la pantalla.[22]​[23]​ Se usan a menudo en los videojuegos arcade de disparos con pistolas. Algunos ejemplos de estos videojuegos incluyen a Sea Devil de Sega en 1972;[24]​ Attack de Taito en 1976;[25]​ Cross Fire en 1977;[26]​ y Battle Shark de Nintendo en 1978.[27]​\nDurante la década de 1990, algunos joystick como CH Products Flightstick, Gravis Phoenix, Microsoft SideWinder, Logitech WingMan y Thrustmaster FCS tenían mucha demanda entre los jugadores de PC. Se les consideró como un requisito previo para los simuladores de vuelo como el F-16 Fighting Falcon y LHX Attack Chopper. Las palancas de mando se hicieron especialmente populares con el éxito principal de los videojuegos de simulación espacial como Star Wars: X-Wing y Wing Commander, así como el videojuego de disparos 3D Descent.[28]​[29]​[30]​[31]​[32]​ El joystick MongoosT-50 de VirPil Controls fue diseñado para imitar el estilo de un avión ruso (incluyendo el Sukhoi Su-35 y el Sukhoi Su-57), a diferencia de la mayoría de las palancas usadas en otros simuladores de vuelo.[33]​\nSin embargo, desde el comienzo del siglo XXI, este tipo de videojuegos han perdido popularidad y ahora se consideran un género \"muerto\", y con eso, las palancas de mando de videojuegos se han reducido a productos de nicho.[28]​[29]​[30]​[31]​[32]​ En la entrevista de NowGamer con Jim Boone, productor de Volition Inc., afirmó que las pobres ventas de FreeSpace 2 podrían haberse debido a que las palancas de mando se vendieron mal porque estaban \"pasadas de moda\" y porque los videojuegos de disparos en primera persona más modernos, como Quake, fueron «mucho sobre el ratón y [el] teclado». Luego añadió: «Antes de eso, cuando creamos Descent, por ejemplo, era muy común que las personas tuvieran palancas de mando. Vendimos muchas copias de Descent. Fue en ese momento [cuando] el \"FPS\" más moderno con mouse y teclado fue lanzado, a diferencia de otros videojuegos que solo usaban teclado como Wolfenstein [3D] o algo así».[34]​\nDesde fines de la década de 1990, las palancas analógicas (o thumbsticks, debido a que son controlados por los pulgares) se han convertido en un estándar en controladores para consolas de videojuegos, popularizados por el control de Nintendo 64 diseñado por Nintendo,[35]​ y tiene la capacidad de indicar el desplazamiento de la palanca desde su posición neutral. Esto significa que el software no tiene que hacer un seguimiento de la posición o estimar la velocidad a la que se mueven los controles. Estos dispositivos generalmente usan potenciómetros para determinar la posición de la palanca, aunque algunos modelos más nuevos usan un sensor de efecto Hall para una mayor confiabilidad y tamaño reducido."}, {"name": "Arcade stick", "text": "Un arcade stick es un controlador de gran tamaño para usar con consolas domésticas o computadoras. Utilizan la configuración de palanca y botones de algunas cabinas arcade, como los que tienen arreglos de botones específicos. Por ejemplo, el diseño de seis botones de los videojuegos arcade Street Fighter II o Mortal Kombat no se puede emular cómodamente en un control de consola, por lo que se fabrican arcade stick licenciados para estos juegos para su uso en consolas domésticas y PC.[36]​"}, {"name": "Hat switch", "text": "Un hat switch es un control en algunas palancas de mando. También se lo conoce como interruptor POV (point of view). Permite cambiar la vista en el mundo virtual, navegar por los menús, etc. Por ejemplo, muchos simuladores de vuelo lo usan para cambiar las vistas del jugador,[37]​ mientras que otros videojuegos a veces lo usan como un sustituto de la cruceta.\nEl término \"hat switch\" es un acortamiento del término \"Coolie hat switch\", que lleva el nombre del sombrero de aspecto similar.[38]​\nEn un avión real, el hat switch puede controlar cosas como el alerón o el borde del timón."}]}, {"name": "Asistencia a personas con discapacidad", "text": "Las palancas de mando especializadas, clasificadas como un dispositivo apuntador dentro de la tecnología de asistencia, se utilizan para reemplazar el ratón de la computadora para personas con discapacidades físicas bastante severas. En lugar de controlar videojuegos, estas palancas controlan el puntero. A menudo son útiles para las personas con afecciones atetoides, como la parálisis cerebral, ya que les resulta más fácil de entender que un ratón estándar.[39]​ Las palancas de mando en miniatura están disponibles para personas con afecciones que involucran debilidad muscular, como la distrofia muscular o alguna enfermedad de la motoneurona. También se usan en las sillas de ruedas eléctricas ya que son simples y efectivas para usar como método de control.[40]​", "subsections": []}, {"name": "Véase también", "text": "Anexo:Jerga informática\nAFCS\nSimulador de vuelo\nControlador de videojuego\nMando (videojuegos)\nPalanca analógica\nKempston Micro Electronics\nTAC-2", "subsections": []}, {"name": "Referencias", "text": "↑ «Joystick». Merriam Webster (en inglés). Consultado el 5 de junio de 2018. «La palabra aparece en inglés con su sentido actual sobre 1910. Su origen es un término de jerga que hacía referencia al miembro viril, una expresión con el uso equivalente a verga en español.» \n↑ AFP (25 de julio de 2009). «English Channel Armada to Mark Centenary of Louis Blériot Flight». Times of Malta. Consultado el 4 de junio de 2018. \n↑ Zeller Jr., Tom (5 de junio de 2005). «A Great Idea That's All in the Wrist». New York Times. Consultado el 4 de junio de 2018. \n↑ Quinion, Michael (17 de julio de 2004). «Questions & Answers: Joystick». World Wide Words. Consultado el 7 de septiembre de 2006. \n↑ «A Timeline of NRL's Autonomous Systems Research». Laboratorio de Investigación Naval de los Estados Unidos. 2011. Archivado desde el original el 3 de marzo de 2016. Consultado el 6 de junio de 2018. \n↑ Mirick, C. B. (1926). «Electrical Distant Control System». Oficina de Patentes y Marcas de Estados Unidos. Consultado el 6 de junio de 2018. \n↑ «Imagen del joystick utilizado en el Henschel Hs» (JPEG). wehrmacht-history.com. Archivado desde el original el 12 de noviembre de 2014. Consultado el 6 de junio de 2018. \n↑ «Bomb, Guided, Fritz X (X-1)» (en inglés). Museo Nacional del Aire y el Espacio de Estados Unidos. Archivado desde el original el 15 de junio de 2018. Consultado el 6 de junio de 2018. \n↑ Anthony, Alastair; Walker, Norman K.; DeSocio, Elizabeth (Mayo de 1946). The accuracy of the AZON guided bomb as affected by battle conditions in World War II (PDF) (en inglés). Defense Technical Information Center. pp. 4,6. Consultado el 14 de junio de 2018. \n↑ Reinke, Niklas, ed. (2012). History of Rocketry and Astronautics (PDF|formato= requiere |url= (ayuda)). AAS History (Univelt) 43: 167, 168. ISBN 978-0-87703-615-9. ISSN 0730-3564.  |fechaacceso= requiere |url= (ayuda)\n↑ Wolf, Mark J. P., ed. (2012). Encyclopedia of video games: the culture, technology, and art of gaming (en inglés). Santa Barbara, California: Greenwood. p. 342. ISBN 978-0-313-37936-9. Consultado el 15 de junio de 2018. \n↑ Wittler, Frank E.; Johnson, Lyndon B. (Marzo de 1975). «Spacecraft Hand Controller Development» (PDF). Apollo experience report - Crew Station Integration (en inglés) (NASA) 3. Consultado el 15 de junio de 2018. \n↑ John Hutchinson (25 de marzo de 2015). «How Safe Is the Airbus A320? 'Workhorse of the Skies' Is Still One of World's Most Reliable Planes Despite Alps Crash, Say Experts». Daily Mail. Consultado el 13 de septiembre de 2015. \n↑ Edwards, Benj (17 de julio de 2004). «Video Games Turn 40» (en inglés). 1UP.com. Archivado desde el original el 4 de junio de 2011. Consultado el 15 de junio de 2018. \n↑ a b Missile en Killer List of Videogames (en inglés)\n↑ S.A.M.I. en Killer List of Videogames (en inglés)\n↑ Astro Race en Killer List of Videogames (en inglés)\n↑ Totilo, Stephen (31 de agosto de 2010). «In Search Of The First Video Game Gun» (en inglés). Kotaku. Consultado el 3 de julio de 2018. \n↑ Interceptor en Killer List of Videogames (en inglés)\n↑ Grant Brunner (27 de mayo de 2013). «Shoulder Buttons of Giants: The Evolution of Controllers Leading Up to PS4 and Xbox One». ExtremeTech. Consultado el 11 de septiembre de 2015. \n↑ Buchanan, Levi (5 de septiembre de 2008). «Space Harrier retrospective - Page 2 of 3» (en inglés). IGN UK. Consultado el 15 de julio de 2018. \n↑ Morgan McGuire & Odest Chadwicke Jenkins (2009), Creating Games: Mechanics, Content, and Technology, A K Peters, Ltd., p. 408, ISBN 1-56881-305-8, consultado el 3 de abril de 2011, «Light guns, such as the NES Zapper or those used in the House of the Dead series, are distinctly different from positional guns used by arcade games such as SEGA's Gunblade NY. ... Light guns differ from positional guns, such as in Gunblade NY (bottom), that are essentially analog joysticks. ... Positional guns are essentially analog sticks mounted in a fixed location with respect to the screen. Light guns, in contrast, have no fixed a priori relationship with a display.» .\n↑ Yo-Sung Ho & Hyoung Joong Kim (November 13–16, 2005), Advances in Multimedia Information Processing-PCM 2005: 6th Pacific-Rim Conference on Multimedia, Jeju Island, Korea, Springer Science & Business, p. 688, ISBN 3-540-30040-6, consultado el 3 de abril de 2011, «The two routes to conventional gun control are light guns and positional guns. Light guns are the most common for video game systems of any type. They work optically with screen and do not keep track of location on the screen until the gun is fired. When the gun is fired, the screen blanks for a moment, and the optics in the gun register where on the screen the gun is aimed. That information is sent to the computer, which registers the shot. ... Positional guns are mounted stationary on the arcade cabinet with the ability to aim left/right and up/down. They function much like joysticks, which maintain a known location on screen at all times and register the current location when fired.» .\n↑ Sea Devil en Killer List of Videogames (en inglés)\n↑ Attack en Killer List of Videogames (en inglés)\n↑ Cross Fire en Killer List of Videogames (en inglés)\n↑ Battle Shark en Killer List of Videogames (en inglés)\n↑ a b Peckham, Matt (26 de septiembre de 2006). «DarkStar One». SciFi.com. Archivado desde el original el 17 de octubre de 2006. Consultado el 17 de noviembre de 2007. \n↑ a b «Space Interceptor: Project Freedom». MyGamer. 9 de noviembre de 2004. Archivado desde el original el 14 de abril de 2005. Consultado el 15 de julio de 2018. \n↑ a b Weise, Matt (28 de mayo de 2003). «Freelancer». GameCritics. Archivado desde el original el 6 de enero de 2008. Consultado el 17 de noviembre de 2007. \n↑ a b LaMosca, Adam (18 de julio de 2006). «Lost in the Void». The Escapist. Archivado desde el original el 25 de febrero de 2008. Consultado el 17 de noviembre de 2007. \n↑ a b Wen, Howard (12 de febrero de 2008). «What Happened To The Last Starfighters?». The Escapist. Archivado desde el original el 25 de febrero de 2009. Consultado el 20 de junio de 2008. \n↑ Hirsch, Matthew (4 de junio de 2017). «VPC’s MongoosT-50 joystick: A rare Russian-style controller for skies or space». Ars Technica. Archivado desde el original el 5 de junio de 2017. Consultado el 15 de julio de 2018. «Unlike most flight sticks for sale on the US market, which tend to be based with varying levels of verisimilitude on US fighter aircraft control columns, the MongoosT-50 is built to mirror the control stick on Russian aircraft—specifically, the fifth-generation Russian Sukhoi Su-35 and PAK FA (T-50).» \n↑ Tom Senior (7 de febrero de 2011). «Volition Would \"Commit Murder\" to Make Freespace 3». PC Gamer. Consultado el 15 de julio de 2018. \n↑ Jonathan Drake (24 de septiembre de 2011). «Nintendo 64: Launching a Legacy». IGN. Consultado el 9 de septiembre de 2015. \n↑ Block, Gerry (18 de diciembre de 2007). «Arcade in a Box Xbox 360 Arcade Stick» (en inglés). IGN UK. Consultado el 15 de julio de 2018. \n↑ «Microsoft Combat Flight Simulator 2, EU-Inside Moves Series, Jeff Van West, Book - Barnes & Noble». Search.barnesandnoble.com. Archivado desde el original el 29 de septiembre de 2007. Consultado el 18 de agosto de 2010. \n↑ Cantrell, Paul. «Helicopter Aviation». www.copters.com. Consultado el 20 de diciembre de 2015. \n↑ Darleen Hartley (22 de mayo de 2009). «Robotics Improves Movement in Kids with Cerebral Palsy». geek.com. Archivado desde el original el 20 de agosto de 2016. Consultado el 16 de septiembre de 2015. \n↑ Andrew Liszewski (28 de abril de 2012). «If You Don't Find This Video About Robot Wheelchairs for Babies' Heartwarming, You Probably Don't Have a Soul». Gizmodo. Consultado el 17 de septiembre de 2015. ", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una galería multimedia sobre Palanca de mando.\nEsta obra contiene una traducción parcial derivada de «Joystick» de Wikipedia en inglés, concretamente de esta versión del 28 de junio de 2018, publicada por sus editores bajo la Licencia de documentación libre de GNU y la Licencia Creative Commons Atribución-CompartirIgual 4.0 Internacional.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Kilobyte", "title": "Kilobyte", "summary": "Un kilobyte es una unidad de almacenamiento de información cuyo símbolo es el kB (con la 'k' en minúsculas) y equivale a 103 (mil) bytes. Aunque el prefijo griego kilo- (χίλιοι) significa «mil», el término kilobyte y el símbolo «kB» se han utilizado históricamente para hacer referencia tanto a 1024 (210) bytes como a 1000 (103) bytes, dependiendo del contexto, en los campos de la informática y de la tecnología de la información.[1]​[2]​[3]​\nPara solucionar esta confusión, la Comisión Electrotécnica Internacional publicó en 1998 un apéndice al estándar IEC 60027-2 donde se instauraban los prefijos binarios, naciendo la unidad kibibyte para designar 210 bytes y considerándose el uso de la palabra kilobyte no válido a dichos efectos.", "sections": [{"name": "El Sistema Internacional de Unidades y el término byte", "text": "Artículos principales:\n y \nEn los inicios de la informática, las unidades se mostraban como múltiplos de 1000, pero en los años 1960 se empezó a confundir 1000 con 1024, puesto que la memoria de los ordenadores trabajan en base binaria y no decimal. El problema radicó al nombrar estas unidades, ya que se adoptaron los nombres de los prefijos del Sistema Internacional de Unidades. Dada la similitud en las cantidades, se utilizaron los prefijos de base mil que se aplican a las unidades del sistema internacional (tales como el metro, el gramo, el voltio o el amperio). \nSin embargo, etimológicamente es incorrecto utilizar estos prefijos (de base decimal) para nombrar múltiplos en base binaria. Como ocurre en el caso del kilobyte, a pesar de que 1024 se aproxime a 1000. \nEste hecho sembró ciertas confusiones que, actualmente, continúan debatiéndose en la comunidad informática.\nPara clarificar la distinción entre los prefijos decimal y binario, la Comisión Electrotécnica Internacional (IEC), un grupo de estandarización, propuso en 1998 otros prefijos, que consistían en uniones abreviadas del Sistema Internacional de Unidades con la palabra binario. \nAsí pues, un conjunto de 210 bytes - o lo que es lo mismo, 1024 bytes - debería ser denominado un kibibyte[4]​ (KiB) contracción de Kilobyte Binario.\nEsta convención, expresada en los estándares IEC 60027-2[5]​ e IEC 80000-13:2008, ha sido adoptada para el sistema operativo \"Snow Leopard\" de Apple y por Ubuntu.  Otras, como Microsoft, adoptan la definición que se encuentra en diccionarios como el de Oxford (Ver referencias más adelante), al mantener el uso de kilobyte para 1024 bytes.\nEn el entorno informático se ha sugerido utilizar el prefijo K mayúscula para distinguir la cantidad binaria de la decimal, pero este tema aún no se ha normalizado, ya que el símbolo \"K\" en el SI representa la unidad de temperatura, el kelvin. Por otro lado, esta sugerencia no se podría extender a otros prefijos de mayor magnitud dado que, en el caso ejemplo del MB (megabyte), el SI ya utiliza tanto la M mayúscula (mega: millón) como la minúscula (mili: milésima).", "subsections": []}, {"name": "Equivalencia", "text": "", "subsections": []}, {"name": "Véase también", "text": "Byte\nMegabyte\nKibibyte\nMebibyte\nNibble", "subsections": []}, {"name": "Referencias", "text": "↑ definition of kilobyte from Oxford Dictionaries Online Archivado el 25 de junio de 2006 en Wayback Machine.. Askoxford.com. Retrieved on 2011-01-07.\n↑ Kilobyte – Definition and More from the Free Merriam-Webster Dictionary. Merriam-webster.com (2010-08-13). Retrieved on 2011-01-07.\n↑ Kilobyte | Define Kilobyte at Dictionary.com. Dictionary.reference.com (1995-09-29). Retrieved on 2011-01-07.\n↑ «Definitions of the SI units: The binary prefixes». Consultado el 2012. \n↑ Prefixes for binary multiples (en inglés)", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Lenguaje_ensamblador", "title": "Lenguaje ensamblador", "summary": "Motorola MC6800 Assembler listing\nEl lenguaje ensamblador o assembler (en inglés: assembler language y la abreviación asm) es un lenguaje de programación que se usa en los microprocesadores. Implementa una representación simbólica de los códigos de máquina binarios y otras constantes necesarias para programar una arquitectura de procesador y constituye la representación más directa del código máquina específico para cada arquitectura legible por un programador. Cada arquitectura de procesador tiene su propio lenguaje ensamblador que usualmente es definida por el fabricante de hardware, y está basada en los mnemónicos que simbolizan los pasos de procesamiento (las instrucciones), los registros del procesador, las posiciones de memoria y otras características del lenguaje. Un lenguaje ensamblador es por lo tanto específico de cierta arquitectura de computador física (o virtual). Esto está en contraste con la mayoría de los lenguajes de programación de alto nivel, que idealmente son portables.\nUn programa utilitario llamado ensamblador es usado para traducir sentencias del lenguaje ensamblador al código de máquina del computador objetivo. El ensamblador realiza una traducción más o menos isomorfa (un mapeo de uno a uno) desde las sentencias mnemónicas a las instrucciones y datos de máquina. Esto está en contraste con los lenguajes de alto nivel, en los cuales una sola declaración generalmente da lugar a muchas instrucciones de máquina.\nMuchos sofisticados ensambladores ofrecen mecanismos adicionales para facilitar el desarrollo del programa, controlar el proceso de ensamblaje, y la ayuda de depuración. Particularmente, la mayoría de los ensambladores modernos incluyen una facilidad de macro (descrita más abajo), y se llaman macro ensambladores.\nFue usado principalmente en los inicios del desarrollo de software, cuando aún no se contaba con potentes lenguajes de alto nivel y los recursos eran limitados. Actualmente se utiliza con frecuencia en ambientes académicos y de investigación, especialmente cuando se requiere la manipulación directa de hardware, alto rendimiento, o un uso de recursos controlado y reducido. También es utilizado en el desarrollo de controladores de dispositivo (en inglés, device drivers) y en el desarrollo de sistemas operativos, debido a la necesidad del acceso directo a las instrucciones de la máquina. Muchos dispositivos programables (como los microcontroladores) aún cuentan con el ensamblador como la única manera de ser manipulados.", "sections": [{"name": "Características", "text": "El código escrito en lenguaje ensamblador posee una cierta dificultad de ser entendido ya que su estructura se acerca al lenguaje máquina, es decir, es un lenguaje de bajo nivel.\nEl lenguaje ensamblador es difícilmente portable, es decir, un código escrito para un microprocesador, puede necesitar ser modificado, para poder ser usado en otra máquina distinta. Al cambiar a una máquina con arquitectura diferente, generalmente es necesario reescribirlo completamente.\nLos programas hechos por un programador experto en lenguaje ensamblador pueden ser más rápidos y consumir menos recursos del sistema (ej: memoria RAM) que el programa equivalente compilado desde un lenguaje de alto nivel. Al programar cuidadosamente en lenguaje ensamblador se pueden crear programas que se ejecutan más rápidamente y ocupan menos espacio que con lenguajes de alto nivel. Conforme han evolucionado tanto los procesadores como los compiladores de lenguajes de alto nivel, esta característica del lenguaje ensamblador se ha vuelto cada vez menos significativa. Es decir, un compilador moderno de lenguaje de alto nivel puede generar código casi tan eficiente como su equivalente en lenguaje ensamblador.[1]​\nCon el lenguaje ensamblador se tiene un control muy preciso de las tareas realizadas por un microprocesador por lo que se pueden crear segmentos de código difíciles y/o muy ineficientes de programar en un lenguaje de alto nivel, ya que, entre otras cosas, en el lenguaje ensamblador se dispone de instrucciones del CPU que generalmente no están disponibles en los lenguajes de alto nivel.", "subsections": []}, {"name": "Programa ensamblador", "text": "Artículo principal:\nGeneralmente, un programa ensamblador (assembler en inglés) moderno crea código objeto traduciendo instrucciones mnemónicas de lenguaje ensamblador en opcodes, y resolviendo los nombres simbólicos para las localizaciones de memoria y otras entidades.[2]​ El uso de referencias simbólicas es una característica clave del lenguaje ensamblador, evitando tediosos cálculos y actualizaciones manuales de las direcciones después de cada modificación del programa. La mayoría de los ensambladores también incluyen facilidades de macros para realizar sustitución textual - ej. generar cortas secuencias de instrucciones como expansión en línea en vez de llamar a subrutinas.\nLos ensambladores son generalmente más simples de escribir que los compiladores para los lenguajes de alto nivel, y han estado disponibles desde los años 1950. Los ensambladores modernos, especialmente para las arquitecturas basadas en RISC, tales como MIPS, Sun SPARC, y HP PA-RISC, así como también para el x86 (-64), optimizan la planificación de instrucciones para explotar la segmentación del CPU eficientemente.\nEn los compiladores para lenguajes de alto nivel, son el último paso antes de generar el código ejecutable.", "subsections": [{"name": "Número de pasos", "text": "Hay dos tipos de ensambladores basados en cuántos pasos a través de la fuente son necesarios para producir el programa ejecutable.\nLos ensambladores de un solo paso pasan a través del código fuente una vez y asumen que todos los símbolos serán definidos antes de cualquier instrucción que los refiera.\nLos ensambladores de dos pasos crean una tabla con todos los símbolos y sus valores en el primer paso, después usan la tabla en un segundo paso para generar código. El ensamblador debe por lo menos poder determinar la longitud de cada instrucción en el primer paso para que puedan ser calculadas las direcciones de los símbolos.\nLa ventaja de un ensamblador de un solo paso es la velocidad, que no es tan importante como lo fue en un momento dados los avances en velocidad y capacidades del computador. La ventaja del ensamblador de dos pasos es que los símbolos pueden ser definidos dondequiera en el código fuente del programa. Esto permite a los programas ser definidos de maneras más lógicas y más significativas, haciendo los programas de ensamblador de dos pasos más fáciles de leer y mantener.[3]​"}, {"name": "Ensambladores de alto nivel", "text": "Los más sofisticados ensambladores de alto nivel proporcionan abstracciones del lenguaje tales como:\nEstructuras de control avanzadas\nDeclaraciones e invocaciones de procedimientos/funciones de alto nivel\nTipos de datos abstractos de alto nivel, incluyendo las estructuras/récords, uniones, clases, y conjuntos\nProcesamiento de macros sofisticado (aunque está disponible en los ensambladores ordinarios desde finales de los años 1960 para el IBM S/360, entre otras máquinas)\nCaracterísticas de programación orientada a objetos"}, {"name": "Uso del término", "text": "Note que, en el uso profesional normal, el término ensamblador es frecuentemente usado tanto para referirse al lenguaje ensamblador como también al programa ensamblador (que convierte el código fuente escrito en el lenguaje ensamblador a código objeto que luego será enlazado para producir lenguaje de máquina). Las dos expresiones siguientes utilizan el término \"ensamblador\":"}]}, {"name": "Lenguaje", "text": "El lenguaje ensamblador refleja directamente la arquitectura y las instrucciones en lenguaje de máquina de la CPU, y pueden ser muy diferentes de una arquitectura de CPU a otra. \nCada arquitectura de microprocesador tiene su propio lenguaje de máquina, y en consecuencia su propio lenguaje ensamblador ya que este se encuentra muy ligado a la estructura del hardware para el cual se programa. Los microprocesadores difieren en el tipo y número de operaciones que soportan; también pueden tener diferente cantidad de registros, y distinta representación de los tipos de datos en memoria. Aunque la mayoría de los microprocesadores son capaces de cumplir esencialmente las mismas funciones, la forma en que lo hacen difiere y los respectivos lenguajes ensamblador reflejan tal diferencia.", "subsections": [{"name": "Instrucciones de CPU", "text": "La mayoría de las CPU tienen más o menos los mismos grupos de instrucciones, aunque no necesariamente tienen todas las instrucciones de cada grupo. Las operaciones que se pueden realizar varían de una CPU a otra. Una CPU particular puede tener instrucciones que no tenga otro y viceversa. \nLos primeros microprocesadores de 8 bits no tenían operaciones para multiplicar o dividir números, por ejemplo, y había que hacer subrutinas para realizar esas operaciones. Otras CPU puede que no tengan operaciones de punto flotante y habría que hacer o conseguir bibliotecas que realicen esas operaciones.\nLas instrucciones de la CPU pueden agruparse, de acuerdo a su funcionalidad, en:\nOperaciones con enteros: (de 8, 16, 32 y 64 bits dependiendo de la arquitectura de la CPU, en los sistemas muy viejos también de 12, 18, 24, 36 y 48 bits).\nEstas son operaciones realizadas por la Unidad aritmético lógica de la CPU:\nOperaciones aritméticas. Como suma, resta, multiplicación, división, módulo, cambio de signo\nOperaciones booleanas. Operaciones lógicas bit a bit como AND, OR, XOR, NOT\nOperaciones de bits. Como desplazamiento o shift lógico y rotaciones u Operadores a nivel de bits (hacia la derecha o hacia la izquierda, a través del bit del acarreo o sin él)\nComparaciones\nOperaciones de mover datos:\nDesde un registro a otro\nDesde un registro a un lugar de la memoria\nDesde un lugar de la memoria a un registro\nDesde un lugar a otro de la memoria\nUn valor inmediato a un registro\nUn valor inmediato a un lugar de memoria\nPUSH (escribe datos hacia el tope de la pila)\nPOP (lee datos desde el tope de la pila)\nINPUT Lectura desde un puerto de entrada\nOUTPUT Escritura hacia un puerto de salida\nOperaciones para el control del flujo del programa:\nLlamadas y retornos de subrutinas\nLlamadas y retornos de interrupciones\nSaltos condicionales de acuerdo al resultado de una comparación\nSaltos incondicionales\nOperaciones con números reales:\nEl estándar para las operaciones con números reales en las CPU está definido por el IEEE 754.\nUna CPU puede tener operaciones de punto flotante con números reales mediante el coprocesador numérico (si lo hay), como las siguientes:\nOperaciones aritméticas. Suma, resta, multiplicación, división, cambio de signo, valor absoluto, parte entera\nOperaciones trigonométricas. Seno, coseno, tangente, arcotangente\nOperaciones con logaritmos, potencias y raíces\nOtras\nEl lenguaje ensamblador tiene mnemónicos para cada una de las instrucciones de la CPU en adición a otros mnemónicos a ser procesados por el programa ensamblador (como por ejemplo macros y otras sentencias en tiempo de ensamblado)."}, {"name": "Ensamblado", "text": "La transformación del lenguaje ensamblador en código máquina la realiza un programa ensamblador, y la traducción inversa la puede efectuar un desensamblador. A diferencia de los lenguajes de alto nivel, aquí hay usualmente una correspondencia 1 a 1 entre las instrucciones simples del ensamblador y el lenguaje de máquina. Sin embargo, en algunos casos, un ensamblador puede proveer \"pseudo instrucciones\" que se expanden en un código de máquina más extenso a fin de proveer la funcionalidad necesaria y simplificar la programación. Por ejemplo, para un código máquina condicional como \"si X mayor o igual que\", un ensamblador puede utilizar una pseudoinstrucción al grupo \"haga si menor que\", y \"si = 0\" sobre el resultado de la condición anterior. Los Ensambladores más completos también proveen un rico lenguaje de macros que se utiliza para generar código más complejo y secuencias de datos.\nPara el mismo procesador y el mismo conjunto de instrucciones de CPU, diferentes programas ensambladores pueden tener, cada uno de ellos, variaciones y diferencias en el conjunto de mnemónicos o en la sintaxis de su lenguaje ensamblador. Por ejemplo, en un lenguaje ensamblador para la arquitectura x86, se puede expresar la instrucción para mover 5 al registro AL de la siguiente manera: MOV AL, 5, mientras que para otro ensamblador para la misma arquitectura se expresaría al revés: MOV 5, AL. Ambos lenguajes ensambladores harían exactamente lo mismo, solo que está expresado de manera diferente. El primero usa la sintaxis de Intel, mientras que el segundo usa la sintaxis de AT&T.\nEl uso del ensamblador no resuelve definitivamente el problema de cómo programar un sistema basado en microprocesador de modo sencillo ya que para hacer un uso eficiente del mismo, hay que conocer a fondo el microprocesador, los registros de trabajo de que dispone, la estructura de la memoria, y muchas cosas más referentes a su estructura básica de funcionamiento."}, {"name": "Ejemplos", "text": "Un programa escrito en lenguaje ensamblador consiste en una serie de instrucciones que corresponden al flujo de órdenes ejecutables por un microprocesador.\nPor ejemplo, en el lenguaje ensamblador para un procesador x86:\nLa sentencia\nMOV AL, 61h\nAsigna el valor hexadecimal 61 (97 decimal) al registro \"AL\".\nEl programa ensamblador lee la sentencia de arriba y produce su equivalente binario en lenguaje de máquina.\nBinario: 10110000 01100001 (hexadecimal: B061)\nEl mnemónico MOV es un código de operación u \"opcode\". El opcode es seguido por una lista de argumentos o parámetros, completando una típica instrucción de ensamblador. En el ejemplo, AL es un registro de 8 bits del procesador, al cual se le asignará el valor hexadecimal 61 especificado.\nEl código de máquina generado por el ensamblador consiste de 2 bytes. El primer byte contiene empaquetado la instrucción MOV y el código del registro hacia donde se va a mover el dato:\nEn el segundo byte se especifica el número 61h, escrito en binario como 01100001, que se asignará al registro AL, quedando la sentencia ejecutable como:\n10110000 01100001\nLa cual puede ser entendida y ejecutada directamente por el procesador."}]}, {"name": "Diseño del lenguaje", "text": "", "subsections": [{"name": "Elementos básicos", "text": "Hay un grado grande de diversidad en la manera en que los autores de los ensambladores categorizan las sentencias y en la nomenclatura que usan. En particular, algunos describen cualquier cosa como pseudo-operación (pseudo-Op), con excepción del mnemónico de máquina o del mnemónico extendido.\nUn típico lenguaje ensamblador consiste en 3 tipos de sentencias de instrucción que son usadas para definir las operaciones del programa:\nMnemónicos de opcode\nSecciones de datos\nDirectivas de ensamblador\nMnemónicos de opcode y mnemónicos extendidos\nA diferencia de las instrucciones (sentencias) de los lenguajes de alto nivel, las instrucciones en el lenguaje ensamblador son generalmente muy simples. Generalmente, un mnemónico es un nombre simbólico para una sola instrucción en lenguaje de máquina ejecutable (un opcode), y hay por lo menos un mnemónico de opcode definido para cada instrucción en lenguaje de máquina. Cada instrucción consiste típicamente en una operación u opcode más cero o más operandos. La mayoría de las instrucciones refieren a un solo valor, o a un par de valores. Los operandos pueden ser inmediatos (típicamente valores de un byte, codificados en la propia instrucción), registros especificados en la instrucción, implícitos o las direcciones de los datos localizados en otra parte de la memoria. Esto está determinado por la arquitectura subyacente del procesador, el ensamblador simplemente refleja cómo trabaja esta arquitectura. Los mnemónicos extendidos son frecuentemente usados para especificar una combinación de un opcode con un operando específico, ej, el ensamblador del System/360 usa a B como un mnemónico extendido para el BC con una máscara de 15 y NOP al BC con una máscara de 0.\nLos mnemónicos extendidos son frecuentemente usados para soportar usos especializados de instrucciones, a menudo para propósitos no obvios con respecto al nombre de la instrucción. Por ejemplo, muchos CPU no tienen una instrucción explícita de NOP (No Operación), pero tienen instrucciones que puedan ser usadas para tal propósito. En el CPU 8086, la instrucción XCHG AX,AX (intercambia el registro AX consigo mismo) es usada para el NOP, con NOP siendo un pseudo-opcode para codificar la instrucción XCHG AX,AX. Algunos desensambladores reconocen esto y decodificarán la instrucción XCHG AX,AX como NOP. Similarmente, los ensambladores de IBM para el System/360 usan los mnemónicos extendidos NOP y NOPR con las máscaras cero para BC y BCR.\nAlgunos ensambladores también soportan simples macroinstrucciones incorporadas que generan dos o más instrucciones de máquina. Por ejemplo, con algunos ensambladores para el Z80, la instrucción\ngenera las instrucciones\nLD HL, BC es un pseudo-opcode, que en este caso simula ser una instrucción de 16 bits. Cuando se expande se producen dos instrucciones de 8 bits que equivalen a la simulada de 16 bits.\nSecciones de datos\nHay instrucciones usadas para definir elementos de datos para manejar datos y variables. Definen el tipo de dato, la longitud y la alineación de los datos. Estas instrucciones también pueden definir si los datos están disponibles para programas exteriores (programas ensamblados separadamente) o solamente para el programa en el cual la sección de datos está definida. Algunos ensambladores clasifican estas instrucción como pseudo-instrucciones.\nDirectivas del ensamblador\nLas directivas del ensamblador, también llamadas pseudo opcodes, pseudo-operaciones o pseudo-ops, son instrucciones que son ejecutadas por un ensamblador en el tiempo de ensamblado, no por la CPU en tiempo de ejecución. Pueden hacer al ensamblado del programa dependiente de parámetros especificados por el programador, de modo que un programa pueda ser ensamblado de diferentes maneras, quizás para diversas aplicaciones. También pueden ser usadas para manipular la presentación de un programa para hacerlo más fácil de leer y mantener.\nPor ejemplo, las directivas pudieran ser usadas para reservar áreas de almacenamiento y opcionalmente para asignar su contenido inicial. Los nombres de las directivas a menudo comienzan con un punto para distinguirlas de las instrucciones de máquina.\nLos ensambladores simbólicos le permiten a los programadores asociar nombres arbitrarios (etiquetas o símbolos) a posiciones de memoria. Usualmente, cada constante y variable tiene un nombre para que las instrucciones puedan referir a esas ubicaciones por nombre, así promoviendo el código autodocumentado. En el código ejecutable, el nombre de cada subprograma es asociado a su punto de entrada, así que cualquier llamada a un subprograma puede usar su nombre. Dentro de subprogramas, a los destinos GOTO se le dan etiquetas. Algunos ensambladores soportan símbolos locales que son léxicamente distintos de los símbolos normales (ej, el uso de \"10$\" como un destino GOTO).\nLa mayoría de los ensambladores proporcionan un manejo flexible de símbolos, permitiendo a los programadores manejar diversos espacios de nombres, calcular automáticamente offsets dentro de estructuras de datos, y asignar etiquetas que refieren a valores literales o al resultado de cálculos simples realizados por el ensamblador. Las etiquetas también pueden ser usadas para inicializar constantes y variables con direcciones relocalizables.\nLos lenguajes ensambladores, como la mayoría de los otros lenguajes de computador, permiten que sean añadidos comentarios al código fuente, que son ignorados por el programa ensamblador. El buen uso de los comentarios es aún más importante con código ensamblador que con lenguajes de alto nivel, pues el significado y el propósito de una secuencia de instrucciones puede ser más difícil de entender a partir del código en sí mismo.\nEl uso sabio de estas facilidades puede simplificar significativamente los problemas de codificar y mantener el código de bajo nivel. El código fuente de lenguaje ensamblador crudo generado por compiladores o desensambladores - código sin ningún comentario, ni símbolos con algún sentido, ni definiciones de datos - es muy difícil de leer cuando deben hacerse cambios."}, {"name": "Macros", "text": "Muchos ensambladores soportan macros predefinidas, y otros soportan macros definidas (y repetidamente redefinibles) por el programador que implican secuencias de líneas del texto, en las cuales las variables y las constantes están embebidas. Esta secuencia de líneas de texto puede incluir opcodes o directivas. Una vez una macro se define, su nombre se puede usar en lugar de un mnemónico. Cuando el ensamblador procesa tal sentencia, reemplaza la sentencia por las líneas del texto asociadas a esa macro. Entonces, las procesa como si hubieran existido en el archivo del código fuente original (incluyendo, en algunos ensambladores, la expansión de cualquier macro que exista en el texto de reemplazo).\nPuesto que las macros pueden tener nombres cortos pero se expanden a varias, o de hecho, muchas líneas de código, pueden usarse para hacer que los programas en lenguaje ensamblador parezcan ser mucho más cortos, requiriendo menos líneas de código fuente, como sucede con los lenguajes de alto nivel. También se pueden usar para añadir niveles de estructura más altos a los programas ensamblador; opcionalmente introducen código de depuración integrado vía parámetros y otras características similares.\nMuchos ensambladores tienen macros incorporadas (o predefinidas) para las llamadas de sistema y otras secuencias especiales de código, tales como la generación y el almacenamiento de los datos realizados a través de avanzadas operaciones bitwise y operaciones booleanas usadas en juegos, software de seguridad, gestión de datos y criptografía.\nLos macro ensambladores a menudo permiten a las macros tomar parámetros. Algunos ensambladores incluyen lenguajes macro sofisticados, incorporando elementos de lenguajes de alto nivel tales como parámetros opcionales, variables simbólicas, condiciones, manipulaciones de strings, operaciones aritméticas, todos usables durante la ejecución de una macro dada, y permitiendo a las macros guardar el contexto o intercambiar información. Así una macro puede generar un gran número de instrucciones o definiciones de datos en lenguaje ensamblador, basadas en los argumentos de la macro. Esto se podría usar para generar, por ejemplo, estructuras de datos de estilo de récord o bucles \"desenrollados\", o podría generar algoritmos enteros basados en parámetros complejos. Una organización, usando lenguaje ensamblador, que ha sido fuertemente extendido usando tal suite de macros, puede ser considerada que se está trabajando en un lenguaje de alto nivel, puesto que tales programadores no están trabajando con los elementos conceptuales de más bajo nivel del computador.\nLas macros se usaron para personalizar sistemas de software de gran escala para clientes específicos en la era del mainframe. También se emplearon macros por los usuarios mismos para satisfacer las necesidades de sus organizaciones haciendo versiones específicas de los sistemas operativos del fabricante. Esto fue hecho, por ejemplo, por los programadores de sistema que trabajaban con el Conversational Monitor System / Virtual Machine (CMS/VM) de IBM y con los complementos real time transaction processing de IBM, CICS, Customer Information Control System, el airline/financial system que comenzó en los años 1970 y todavía corre con muchos sistemas de reservaciones computarizados (CRS) y sistemas de tarjeta de crédito de hoy.\nTambién es posible usar solamente las habilidades de procesamiento de macros de un ensamblador para generar código escrito en lenguajes completamente diferentes. Por ejemplo, para generar una versión de un programa en COBOL usando un programa macro ensamblador puro conteniendo líneas de código COBOL dentro de operadores de tiempo ensamblaje dando instrucciones al ensamblador para generar código arbitrario.\nEsto era porque, como en los años 1970 fue observado, el concepto de \"procesamiento de macro\" es independiente del concepto de \"ensamblaje\", siendo el anterior, en términos modernos, más un procesamiento de textos, que una generación de código objeto. El concepto de procesamiento de macro apareció, y aparece, en el lenguaje de programación C, que soporta \"instrucciones de preprocesador\" de fijar variables, y hace pruebas condicionales en sus valores. Observe que a diferencia de ciertos macroprocesadores previos dentro de los ensambladores, el preprocesador de C no es Turing-completo porque carecía de la capacidad de bucle o go to, esto último permitiendo a los programas hacer bucles.\nA pesar del poder del procesamiento macro, este dejó de usarse en muchos lenguajes de alto nivel (una importante excepción es C/C++), pero persistió en los ensambladores. Esto era porque muchos programadores estaban bastante confundidos por la sustitución de parámetros macro y no distinguían la diferencia entre procesamiento macro, el ensamblaje y la ejecución.\nLa sustitución de parámetros macro es estrictamente por nombre: en el tiempo de procesamiento macro, el valor de un parámetro es sustituido textualmente por su nombre. La clase más famosa de Error de software resultantes era el uso de un parámetro que en sí mismo era una expresión y no un nombre primario cuando el escritor macro esperaba un nombre. En el macro:\nla intención era que la rutina que llama proporcionaría el nombre de una variable, y la variable o constante \"global b\" sería usada para multiplicar a \"a\". Si foo se llama con el parámetro a-c, ocurre la expansión macro load a-c*b. Para evitar cualquier posible ambigüedad, los usuarios de macro procesadores pueden encerrar en paréntesis los parámetros formales dentro de las definiciones de macros, o las rutinas que llaman pueden envolver en paréntesis los parámetros de entrada.[5]​ Así, el macro correcto, con los paréntesis, sería:\ny su expansión, daría como resultado: load (a-c)*b\nEl PL/I y el C/C++ ofrecen macros, pero esta facilidad solo puede manipular texto. Por otra parte, los lenguajes homoicónicos, tales como Lisp, Prolog, y Forth, retienen el poder de los macros de lenguaje ensamblador porque pueden manipular su propio código como datos."}, {"name": "Soporte para programación estructurada", "text": "Algunos ensambladores han incorporado elementos de programación estructurada para codificar el flujo de la ejecución. El ejemplo más temprano de este acercamiento estaba en el Concept-14 macro set, originalmente propuesto por el Dr. H.D. Mills (marzo de 1970), e implementado por Marvin Kessler en la Federal Systems Division de IBM, que extendió el macro ensamblador del S/360 con bloques de control de flujo IF/ELSE/ENDIF y similares.[6]​ Esto era una manera de reducir o eliminar el uso de operaciones GOTO en el código en lenguaje ensamblador, uno de los principales factores que causaban código espagueti en el lenguaje ensamblador. Este acercamiento fue ampliamente aceptado a principios de los años 1980 (los últimos días del uso de lenguaje ensamblador en gran escala).\nUn curioso diseño fue A-natural, un ensamblador \"orientado a la corriente\" (stream-oriented) para los procesadores 8080/Z80[cita requerida] de Whitesmiths Ltd. (desarrolladores del sistema operativo Idris, similar al Unix), y lo que fue reportado como el primer compilador C comercial). El lenguaje fue clasificado como un ensamblador, porque trabajaba con elementos de máquina crudos tales como opcodes, registros, y referencias de memoria; pero incorporaba una sintaxis de expresión para indicar el orden de ejecución. Los paréntesis y otros símbolos especiales, junto con construcciones de programación estructurada orientadas a bloques, controlaban la secuencia de las instrucciones generadas. A-natural fue construido como el lenguaje objeto de un compilador C, en vez de la codificación manual, pero su sintaxis lógica ganó algunos seguidores.\nHa habido poca demanda aparente para ensambladores más sofisticados debido a la declinación del desarrollo de lenguaje ensamblador de larga escala.[7]​ A pesar de eso, todavía se están desarrollando y aplicando en casos donde las limitaciones de recursos o las particularidades en la arquitectura de sistema objetivo previenen el efectivo uso de lenguajes de alto nivel.[8]​"}]}, {"name": "Uso del lenguaje ensamblador", "text": "", "subsections": [{"name": "Perspectiva histórica", "text": "Los lenguajes ensambladores fueron primero desarrollados en los años 1950, cuando fueron referidos como lenguajes de programación de segunda generación. Por ejemplo, el SOAP (Symbolic Optimal Assembly Program) era un lenguaje ensamblador de 1957 para el computador IBM 650. Los lenguajes ensambladores eliminaron mucha de la propensión a errores y del consumo de tiempo de la programación de los lenguajes de primera generación, que se necesitaba con los primeros computadores, liberando a los programadores del tedio tal como recordar códigos numéricos y cálculo de direcciones. Una vez fueron ampliamente usados para todo tipo de programación. Sin embargo, por los años 1980 (1990 en los microcomputadores), su uso había sido en gran parte suplantado por los lenguajes de alto nivel,[cita requerida] en la búsqueda de una mejorada productividad en programación. Hoy en día, aunque el lenguaje ensamblador es casi siempre manejado y generado por los compiladores, todavía se usa para la manipulación directa del hardware, acceso a instrucciones especializadas del procesador, o para resolver problemas de desempeño crítico. Los usos típicos son controladores/manejadores (drivers) de dispositivo, sistemas embebidos de bajo nivel, y sistemas de tiempo real.\nHistóricamente, un gran número de programas han sido escritos enteramente en lenguaje ensamblador. Los sistemas operativos fueron casi exclusivamente escritos en lenguaje ensamblador hasta la aceptación amplia del lenguaje de programación C en los años 1970 y principios de los 1980. También, muchas aplicaciones comerciales fueron escritas en lenguaje ensamblador, incluyendo una gran cantidad del software escrito por grandes corporaciones para mainframes de IBM. Los lenguajes COBOL y FORTRAN finalmente desplazaron mucho de este trabajo, aunque un número de organizaciones grandes conservaran las infraestructuras de aplicaciones en lenguaje ensamblador hasta bien entrados los años 1990.\nLa mayoría de los primeros microcomputadores confiaron en el lenguaje ensamblador codificado a mano, incluyendo la mayoría de los sistemas operativos y de las aplicaciones grandes. Esto era porque estos sistemas tenían limitaciones severas de recursos, impusieron idiosincráticas arquitecturas de memoria y de pantalla, y proporcionaron servicios de sistema limitados y con errores. Quizás más importante era la falta de compiladores de primera clase de lenguajes de alto nivel adecuados para el uso en el microcomputador. Un factor psicológico también pudo haber jugado un papel: la primera generación de programadores de los microcomputadores conservó una actitud de aficionado de \"alambres y alicates\".\nEn un contexto más comercial, las más grandes razones para usar el lenguaje ensamblador era hacer programas con mínimo tamaño, mínima sobrecarga, mayor velocidad y confiabilidad.\nLos típicos ejemplos de programas grandes en lenguaje ensamblador de ese tiempo son los sistemas operativos IBM PC DOS y aplicaciones tempranas tales como la hoja de cálculo Lotus 1-2-3, y casi todos los juegos populares para la familia Atari 800 de computadores personales. Incluso en los años 1990, la mayoría de los videojuegos de consola fueron escritos en ensamblador, incluyendo la mayoría de los juegos para la Mega Drive/Genesis y el Super Nintendo Entertainment System.[cita requerida] Según algunos insiders de la industria, el lenguaje ensamblador era el mejor lenguaje de programación a usar para obtener el mejor desempeño del Sega Saturn, una consola para la cual era notoriamente desafiante desarrollar y programar juegos.[9]​ El popular juego de arcade NBA Jam (1993) es otro ejemplo. El ensamblador ha sido por largo trecho, el lenguaje de desarrollo primario en los computadores hogareños Commodore 64, Atari ST, así como el ZX Spectrum. Esto fue así en gran parte porque los dialectos del BASIC en estos sistemas ofrecieron insuficiente velocidad de ejecución, así como insuficientes características para aprovechar completamente el hardware disponible. Algunos sistemas, más notablemente el Amiga, incluso tienen IDEs con características de depuración y macros altamente avanzados, tales como el freeware ASM-One assembler, comparable a las del Microsoft Visual Studio (el ASM-Uno precede al Microsoft Visual Studio).\nEl ensamblador para el VIC-20 fue escrito por Don French y publicado por French Silk. Con 1639 bytes de longitud, su autor cree que es el más pequeño ensamblador simbólico jamás escrito. El ensamblador soportaba el direccionamiento simbólico usual y la definición de cadenas de caracteres o cadenas hexadecimales. También permitía expresiones de direcciones que podían combinarse con las operaciones de adición, sustracción, multiplicación, división, AND lógico, OR lógico, y exponenciación.[10]​"}, {"name": "Uso actual", "text": "Siempre ha habido debates sobre la utilidad y el desempeño del lenguaje ensamblador relativo a lenguajes de alto nivel. El lenguaje ensamblador tiene nichos específicos donde es importante (ver abajo). Pero, en general, los modernos compiladores de optimización para traducir lenguajes de alto nivel en código pueden correr tan rápidamente como el lenguaje ensamblador escrito a mano, a pesar de los contraejemplos que pueden ser encontrados.[11]​[12]​[13]​ La complejidad de los procesadores modernos y del subsistema de memoria hace la optimización efectiva cada vez más difícil para los compiladores, así como para los programadores en ensamblador.[14]​[15]​ Adicionalmente, y para la consternación de los amantes de la eficiencia, el desempeño cada vez mayor del procesador ha significado que la mayoría de los CPU estén desocupados la mayor parte del tiempo, con retardos causados por embotellamientos predecibles tales como operaciones de entrada/salida y paginación de memoria. Esto ha hecho que la velocidad de ejecución cruda del código no sea un problema para muchos programadores.\nHay algunas situaciones en las cuales los profesionales pudieran elegir utilizar el lenguaje ensamblador. Por ejemplo cuando:\nEs requerido un ejecutable binario independiente (stand-alone), es decir uno que deba ejecutarse sin recursos a componentes de tiempo de ejecución o a bibliotecas asociadas con un lenguaje de alto nivel; ésta es quizás la situación más común. Son programas empotrados que solo almacenan una pequeña cantidad de memoria y el dispositivo está dirigido para hacer tareas para un simple propósito. Ejemplos consisten en teléfonos, sistemas de combustible e ignición para automóviles, sistemas de control del aire acondicionado, sistemas de seguridad, y sensores.\nInteractuando directamente con el hardware, por ejemplo en controladores (drivers) de dispositivo y manejadores de interrupción.\nUsando instrucciones específicas del procesador no explotadas o disponibles por el compilador. Un ejemplo común es la instrucción de rotación bitwise en el núcleo de muchos algoritmos de cifrado.\nCreando funciones vectorizadas para programas en lenguajes de alto nivel como C. En el lenguaje de alto nivel esto es a veces ayudado por funciones intrínsecas del compilador que mapean directamente a los mnemónicos del SIMD, pero sin embargo resulta en una conversión de ensamblador de uno a uno para un procesador de vector asociado.\nEs requerida la optimización extrema, ej, en un bucle interno en un algoritmo intensivo en el uso del procesador. Los programadores de juegos toman ventaja de las habilidades de las características del hardware en los sistemas, permitiendo a los juegos correr más rápidamente. También las grandes simulaciones científicas requieren algoritmos altamente optimizados, ej, álgebra lineal con BLAS o la transformada de coseno discreta (ej, la versión SIMD en ensamblador del x264,[16]​ (una biblioteca para codificar streams de video).\nUn sistema con severas limitaciones de recursos (ej, un sistema empotrado) debe ser codificado a mano para maximizar el uso de los limitados recursos; pero esto está llegando a ser menos común a medida que el precio del procesador decrece y el desempeño mejora.\nNo existe ningún lenguaje de alto nivel, en un procesador nuevo o especializado.\nEscribiendo programas de tiempo real que necesitan sincronización y respuestas precisas, tales como sistemas de navegación de vuelo, y equipo médico. Por ejemplo, en un sistema fly-by-wire (vuelo por mandos eléctricos), la telemetría debe ser interpretada y hay que actuar dentro de limitaciones estrictas de tiempo. Tales sistemas deben eliminar fuentes de retrasos impredecibles, que pueden ser creados por (algunos) lenguajes interpretados, recolección de basura automática, operaciones de paginación, o multitarea apropiativa. Sin embargo, algunos lenguajes de alto nivel incorporan componentes de tiempo de ejecución e interfaces de sistema operativo que pueden introducir tales retrasos. Elegir el ensamblador o lenguajes de bajo nivel para tales sistemas da a los programadores mayor visibilidad y control sobre los detalles del procesamiento.\nEs requerido control total sobre el ambiente, en situaciones de seguridad extremadamente alta donde nada puede darse por sentado.\nSe escriben virus de computadora, bootloaders, ciertos controladores/manejadores de dispositivo, u otros elementos muy cerca del hardware o al sistema operativo de bajo nivel.\nSe escriben simuladores del conjunto de instrucciones para monitoreo, trazado y depuración de errores donde la sobrecarga adicional es mantenida al mínimo.\nSe hace ingeniería inversa en binarios existentes que pueden o no haber sido escritos originalmente en un lenguaje de alto nivel, por ejemplo al crackear la protección anticopia del software propietario.\nSe hace ingeniería inversa y modificación de videojuegos (también denominado ROM hacking), que es posible por medio de varios métodos. El más ampliamente implementado es alterando el código del programa a nivel de lenguaje ensamblador.\nSe escribe código automodificable (también conocido como polimórfico), algo para lo que el lenguaje ensamblador se presta bien.\nSe escriben juegos y otros softwares para calculadoras gráficas.[17]​\nSe escribe software compilador que genera código ensamblador, y por lo tanto los desarrolladores deben ser programadores de lenguaje ensamblador.\nSe escriben algoritmos criptográficos que siempre deben tomar estrictamente el mismo tiempo para ejecutar, previniendo ataques de tiempo.\nSin embargo, el lenguaje ensamblador es todavía enseñado en la mayoría de los programas de ciencias de la computación e ingeniería electrónica. Aunque hoy en día, pocos programadores trabajan regularmente con el lenguaje ensamblador como una herramienta, los conceptos fundamentales continúan siendo muy importantes. Tales tópicos fundamentales, como aritmética binaria, asignación de memoria, procesamiento del stack, codificación de conjunto de caracteres, procesamiento de interrupciones, y diseño de compiladores, serían duros de estudiar en detalle sin la comprensión de cómo el computador opera a nivel del hardware. Puesto que el comportamiento del computador es fundamentalmente definido por su conjunto de instrucciones, la manera lógica de aprender tales conceptos es estudiar un lenguaje ensamblador. La mayoría de los computadores modernos tienen un conjunto de instrucciones similares. Por lo tanto, estudiar un solo lenguaje ensamblador es suficiente para aprender: i) los conceptos básicos; ii) reconocer situaciones donde el uso de lenguaje ensamblador puede ser apropiado; y iii) ver cómo el código ejecutable eficiente puede ser creado por los lenguajes de alto nivel[18]​"}, {"name": "Aplicaciones típicas", "text": "El lenguaje ensamblador hard-coded es típicamente usado en el ROM de arranque del sistema (BIOS en los sistemas compatible IBM PC). Este código de bajo nivel es usado, entre otras cosas, para inicializar y probar el hardware del sistema antes de cargar el sistema operativo, y está almacenado en el ROM. Una vez que ha tomado lugar un cierto nivel de inicialización del hardware, la ejecución se transfiere a otro código, típicamente escrito en lenguajes de alto nivel; pero el código corriendo inmediatamente después de que es aplicada la energía usualmente está escrito en lenguaje ensamblador. Lo mismo es cierto para los boot loaders.\nMuchos compiladores traducen lenguajes de alto nivel a lenguaje ensamblador primero, antes de la compilación completa, permitiendo que el código en ensamblador sea visto para propósitos de depuración y optimización. Lenguajes de relativo bajo nivel, como C, con frecuencia proveen sintaxis especial para empotrar lenguaje ensamblador en cada plataforma de hardware. El código portable del sistema entonces puede usar estos componentes específicos a un procesador a través de una interfaz uniforme.\nEl lenguaje ensamblador también es valioso en ingeniería inversa, puesto que muchos programas solamente son distribuidos en una forma de código de máquina. El código de máquina es usualmente fácil de trasladar hacia lenguaje ensamblador para luego ser cuidadosamente examinado en esta forma, pero es muy difícil de trasladar hacia un lenguaje de alto nivel. Herramientas como Interactive Disassembler, hacen uso extenso del desensamblador para tales propósitos.\nUn nicho que hace uso del lenguaje ensamblador es el demoscene. Ciertas competiciones requieren a los concursantes restringir sus creaciones a un muy pequeño tamaño (ej, 256 bytes, 1 KB, 4 KB o 64 KB), y el lenguaje ensamblador es el lenguaje de preferencia para alcanzar este objetivo.[19]​ Cuando los recursos son una preocupación, es una necesidad la codificación en ensamblador, especialmente en sistemas constreñidos por el procesamiento del CPU, como los primeros modelos del Amiga, y el Commodore 64. El código optimizado en ensamblador es escrito \"a mano\" por los programadores en un intento de minimizar el número de ciclos de CPU usados. Las limitaciones del CPU son tan grandes que cada ciclo cuenta. Usar tales métodos ha habilitado, a sistemas como el Commodore 64, para producir gráficos en 3D en tiempo real con efectos avanzados, una hazaña que puede ser considerada improbable o incluso imposible para un sistema con un procesador de 0.99 MHz.[cita requerida]"}]}, {"name": "Detalles adicionales", "text": "Para un determinado computador personal, mainframe, sistema empotrado, y consola de juegos, tanto del pasado como del presente, ha sido escrito al menos uno, y posiblemente docenas de ensambladores. Para algunos ejemplos, vea la lista de ensambladores.\nEn los sistemas Unix, el ensamblador es llamado tradicionalmente as, aunque no es un simple cuerpo de código, siendo típicamente escrito uno nuevo por cada port. Un número de variantes de Unix usan el GAS\nDentro de los grupos de procesadores, cada ensamblador tiene su propio dialecto. A veces, algunos ensambladores pueden leer el dialecto de otro, por ejemplo, TASM puede leer el viejo código del MASM, pero no al revés. FASM y NASM tienen una sintaxis similar, pero cada uno soporta diferentes macros que pueden ser difícil de trasladar de uno al otro. Las cosas básicas son siempre las mismas, pero las características avanzadas serán diferentes[20]​\nTambién, los lenguajes ensambladores a veces pueden ser portables a través de diferentes sistemas operativos en el mismo tipo de CPU. Las convenciones de llamadas entre los sistemas operativos con frecuencia difieren ligeramente o en nada. y con cuidado es posible ganar portabilidad en el lenguaje ensamblador, usualmente al enlazar con una biblioteca de lenguaje C que no cambia entre sistemas operativos. Un simulador de conjunto de instrucciones (que idealmente sería escrito en lenguaje ensamblador) puede, en teoría, procesar el código objeto/binario de cualquier ensamblador) para lograr la portabilidad incluso a través de plataformas (con una sobrecargue no mayor que la de un interpretador de bytecode típico). Esto es esencialmente lo que logra el microcódigo cuando una plataforma de hardware cambia internamente.\nPor ejemplo, muchas cosas en libc dependen del preprocesador para hacer, al programa antes de compilar, cosas que son específicas del sistema operativo o específicas del C. De hecho, algunas funciones y símbolos ni siquiera están garantizados que existan fuera del preprocesador. Peor aún, el tamaño y el orden de los campos de las estructuras, tanto como el tamaño de ciertas typedefs como off_t, no están disponibles en lenguaje ensamblador sin la ayuda de un script de configuración, y difieren incluso entre versiones de Linux, haciendo imposible portar llamadas de funciones en libc diferentes de los que toman simples enteros o punteros como parámetros. Para manejar estos problemas, el proyecto FASMLIB provee una biblioteca de lenguaje ensamblador portable para las plataformas Win32 y Linux, pero todavía está muy incompleta.[21]​\nAlgunos lenguajes de muy alto nivel, como C y Borland/Pascal, soportan ensamblado en línea, donde relativamente secciones cortas de código en ensamblador puede ser empotradas dentro del código del lenguaje de alto nivel. El lenguaje Forth comúnmente contiene un ensamblador usado para codificar palabras.\nLa mayoría de la gente usa un emulador para depurar sus programas en lenguaje ensamblador.", "subsections": []}, {"name": "Ejemplos de lenguaje ensamblador", "text": "", "subsections": [{"name": "Ejemplo para la arquitectura x86", "text": "El siguiente es un ejemplo del programa clásico Hola mundo escrito para la arquitectura de procesador x86 (bajo el sistema operativo DOS).\n; "}, {"name": "-----------------------------------------", "text": "; Programa que imprime un string en la pantalla\n.model\nsmall\n; modelo de memoria\n.stack\n; segmento del stack\n.data\n; segmento de datos\nCadena1\nDB\n'\nHola\nMundo.\n; string a imprimir (finalizado en $)\n.code\n; segmento del código\n; Inicio del programa\nprograma:\n; "}, {"name": "------------------------------------------------------------------------------------------------", "text": "; inicia el segmento de datos\nMOV\nAX\n,\n@\ndata\n; carga en AX la dirección del segmento de datos\nDS\n; mueve la dirección al registro de segmento por medio de AX\n; Imprime un string en pantalla\nDX\noffset\nCadena1\n; mueve a DX la dirección del string a imprimir\nAH\n9\n; AH = código para indicar al MS DOS que imprima en la pantalla, el string en DS:DX\nINT\n21\nh\n; llamada al MS DOS para ejecutar la función (en este caso especificada en AH)\n; Finaliza el programa\n20\n; llamada al MS DOS para finalizar el programa\nend\nprograma"}, {"name": "Ejemplo para el computador virtual (POCA)", "text": "Una selección de instrucciones para una computadora virtual[22]​) con las correspondientes direcciones de memoria en las que se ubicarán las instrucciones. Estas direcciones NO son estáticas. Cada instrucción se acompaña del código en lenguaje ensamblador generado (código objeto) que coincide con la arquitectura de computador virtual, o conjunto de instrucciones ISA."}, {"name": "Ejemplo para el computador virtual (ARC)", "text": "ARC es un subconjunto del modelo de arquitectura basado en el procesador SPARC. ARC ( A RISC Computer) contiene la mayoría de las características\nimportantes de la arquitectura SPARC. "}, {"name": "Ejemplo para el µC Intel 8051", "text": "Código en lenguaje ensamblador para µC Intel 80C51:\nORG\n8030\nH\ninclude\nT05SEG:\nSETB\nTR0\nJNB\nuSEG\nT05SEG\n;esta subrutina es utilizada\nCLR\n;para realizar una cuenta de\nCPL\n;0,5 segundos mediante la\nR1\nDPL\n;interrupción del timer 0.\nINVOKE\nR2\nDPH\nCJNE\n#07\n#78\nDPTR\n#0\nRET"}, {"name": "Ejemplo para el Microchip PIC16F84", "text": "Código en lenguaje ensamblador para el microcontrolador 16F84 de Microchip:\n0\nInicio\nbcf\nSTATUS\nRP0\nclrf\nPORTB\nmovlw\n0xFF\nmovwf\nPORTA\nbsf\nPrincipal\nmovf\nW\nContador\nmovf\nF\nbtfsc\nZ\ngoto\nPuntoDecimal\nsublw\nd\nbtfss\nC\nEND"}]}, {"name": "Véase también", "text": "Lenguaje ensamblador x86\nAnexo:Listados de instrucciones x86\nEnsamblador\nMacro ensamblador\nEnsamblador de alto nivel\nDesensamblador\nCompilador\nDecompilador\nIntérprete (informática)\nDepurador\nLenguaje de alto nivel\nLenguaje de bajo nivel\nLenguaje de máquina\nConjunto de instrucciones\nTipos de datos máquina\nLittle man computer\nEnsambladores\nComparación de ensambladores\nHigh Level Assembly\nNetwide Assembler\nFlat assembler\nGNU Assembler\nMicrosoft Macro Assembler\nRosASM\nA86 y A386 assemblers\nTurbo Assembler\nGNU toolchain\nDesensambladores\nInteractive Disassembler\nDepuradores\nSoftICE\nGNU Debugger\nOllyDbg\nValgrind\nRosASM\nA86 y A386 assemblers\nData Display Debugger\nOtros\nSistemas operativos escritos completamente en assembler:\nMenuetOS\nKolibriOS\nBareMetal OS", "subsections": []}, {"name": "Referencias", "text": "↑ \"DSP: C versus Assembly\", Steven W. Smith, Ph.D., 2011\n↑ David Salomon (1993). Assemblers and Loaders\n↑ Beck, Leland L. (1996). «2». System Software: An Introduction to Systems Programming. Addison Wesley. \n↑ http://www.z80.de/z80/z80code.htm\n↑ «Macros (C/C++), MSDN Library for Visual Studio 2008». Microsoft Corp. Consultado el 22 de junio de 2010. \n↑ «Concept 14 Macros». MVS Software. Consultado el 25 de mayo de 2009. \n↑ Answers.com. «assembly language: Definition and Much More from Answers.com». Consultado el 19 de junio de 2008. \n↑ NESHLA: The High Level, Open Source, 6502 Assembler for the Nintendo Entertainment System\n↑ «Eidolon's Inn : SegaBase Saturn». Archivado desde el original el 13 de julio de 2008. Consultado el 25 de julio de 2008. \n↑ Jim Lawless (21 de mayo de 2004). «Speaking with Don French : The Man Behind the French Silk Assembler Tools». Archivado desde el original el 21 de agosto de 2008. Consultado el 25 de julio de 2008. \n↑ «Writing the Fastest Code, by Hand, for Fun: A Human Computer Keeps Speeding Up Chips». New York Times, John Markoff. 28 de noviembre de 2005. Consultado el 4 de marzo de 2010. \n↑ «Bit-field-badness». hardwarebug.org. 30 de enero de 2010. Archivado desde el original el 5 de febrero de 2010. Consultado el 4 de marzo de 2010. \n↑ «GCC makes a mess». hardwarebug.org. 13 de mayo de 2009. Archivado desde el original el 16 de marzo de 2010. Consultado el 4 de marzo de 2010. \n↑ Randall Hyde. «The Great Debate». Archivado desde el original el 16 de junio de 2008. Consultado el 3 de julio de 2008. \n↑ «Code sourcery fails again». hardwarebug.org. 30 de enero de 2010. Archivado desde el original el 2 de abril de 2010. Consultado el 4 de marzo de 2010. \n↑ «x264.git/common/x86/dct-32.asm». git.videolan.org. 29 de septiembre de 2010. Archivado desde el original el 4 de marzo de 2012. Consultado el 29 de septiembre de 2010. \n↑ «68K Programming in Fargo II». Consultado el 3 de julio de 2008. \n↑ Hyde, Randall (30 de septiembre de 1996). «Foreword (\"Why would anyone learn this stuff?\"), op. cit.». Archivado desde el original el 22 de febrero de 2010. Consultado el 5 de marzo de 2010. \n↑ «256bytes demos archives». Consultado el 3 de julio de 2008. \n↑ Randall Hyde. «Which Assembler is the Best?». Archivado desde el original el 18 de octubre de 2007. Consultado el 19 de octubre de 2007. \n↑ \"vid\". «FASMLIB: Features». Consultado el 19 de octubre de 2007. \n↑ Principles of Computer Architecture (POCA) – ARCTools computadora virtual disponible para descarga y ejecución del código, acceso el 24 de agosto de 2005\n↑ Murdocca, Miles J. y Heuring, Vincent P.:Principles of Computer Architecture (2000), Prentice Hall, ISBN 0-201-43664-7", "subsections": []}, {"name": "Bibliografía", "text": "Dominic Sweetman: See MIPS Run. Morgan Kaufmann Publishers, 1999. ISBN 1-55860-410-3\nRobert Britton: MIPS Assembly Language Programming. Prentice Hall, 2003. ISBN 0-13-142044-5\nJohn Waldron: Introduction to RISC Assembly Language Programming. Addison Wesley, 1998. ISBN 0-201-39828-1\nASM Community Book \"An online book full of helpful ASM info, tutorials and code examples\" by the ASM Community\nJonathan Bartlett: Programming from the Ground Up. Bartlett Publishing, 2004. ISBN 0-9752838-4-7Also available online as PDF Archivado el 6 de febrero de 2009 en Wayback Machine.\nPaul Carter: PC Assembly Language. Free ebook, 2001.Website\nJeff Duntemann: Assembly Language Step-by-Step. Wiley, 2000. ISBN 0-471-37523-3\nRandall Hyde: The Art of Assembly Language. No Starch Press, 2003. ISBN 1-886411-97-2Draft versions available online as PDF and HTML\nPeter Norton, John Socha, Peter Norton's Assembly Language Book for the IBM PC, Brady Books, NY: 1986.\nMichael Singer, PDP-11. Assembler Language Programming and Machine Organization, John Wiley & Sons, NY: 1980.\nPrincipios de arquitectura de computadoras - Miles J. Murdocca - Vincent P. Heuring", "subsections": []}, {"name": "Enlaces externos", "text": " Wikilibros alberga un libro o manual sobre Programación en lenguaje ensamblador.\nThe Art of Assembly Language Programming,\nComputer-Books.us, Online Assembly Language Brooks\nPC Assembly Tutorial using NASM and GCC by Paul Carter\nProgramming from the Ground Up by Jonathan Bartlett\nThe ASM Book by the ASM Community\nInline::ASM módulo Perl en CPAN para programar en lenguaje ensamblador dentro de programas Perl (en inglés)\nEjemplos prácticos de ensamblador en GNU/Linux", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Libra_esterlina", "title": "Libra esterlina", "summary": "en inglés\nReino Unido\nIslas Malvinas\nTerritorio Británico del Océano Índico\nIsla de Man\nJersey\n[\n]\n31 de agosto de 2024\nLa libra esterlina (pound sterling en inglés, símbolo monetario: £) es la moneda oficial del Reino Unido así como de las Dependencias de la Corona y de algunos territorios británicos de ultramar. En sus demás territorios coloniales se usan diferentes divisas pero fijadas a la esterlina: la libra gibraltareña, libra malvinense y libra de Santa Elena. En Egipto por ejemplo se usa la Libra egipcia a pesar de no formar parte del Reino Unido. Su símbolo monetario es £ y proviene del latín libra, que se refería a la unidad de masa. Una libra se divide en cien peniques.\nEl nombre oficial completo, libra esterlina (en plural, libras esterlinas), es usado sobre todo en contextos formales y también cuando es necesario distinguir la moneda que se usa en el Reino Unido de las que se utilizan en otros países y que tienen el mismo nombre. El nombre de la divisa —pero no los nombres de sus unidades— a veces es abreviado solamente a \"esterlina\", particularmente en los mercados financieros de venta al por mayor; por ejemplo \"pago aceptado en esterlinas\", pero no \"eso cuesta cinco esterlinas\". Las abreviaturas \"ster.\" o \"stg.\" son usadas ocasionalmente. El término libra británica es usado comúnmente en situaciones menos formales, aunque no es un nombre oficial de la divisa. La esterlina es una antigua moneda inglesa de plata esterlina, una aleación de un 92,5 % de plata y un 7,5 % de cobre y/u otros metales, y con una masa de 1,555 gramos o 1/240 de una libra troy.\nLa libra fue originalmente el valor del peso de una Libra Torre de plata esterlina (de ahí que se llame \"libra esterlina\"). El símbolo de la divisa es el símbolo de la libra, originalmente ₤ con dos barras cruzadas, más tarde fue más común £ con una sola barra. El símbolo se deriva de la letra \"L\", de la abreviación LSD —librae, solidi, denarii— usada para las libras, chelines y peniques del sistema monetario duodecimal original. Libra era la unidad romana básica de peso, que se derivaba del latín de \"balanza\". El código ISO 4217 es GBP (en inglés Great Britain pound, Libra de Gran Bretaña). Ocasionalmente es vista la abreviación UKP, pero esta es incorrecta. Las Dependencias de la Corona usan sus propios códigos (no ISO) cuando desean reflejar su distinción. Los recursos generalmente son intercambiados por peniques, así que los comerciantes pueden referirse al penique esterlino, GBX (a veces BGp), cuando enlistan sus precios.\nDespués de la adopción del euro por varios países, la libra se convirtió en la divisa más antigua del mundo aún en uso, y actualmente tiene la tercera porción más grande de monedas de reserva a nivel mundial, después del dólar estadounidense y el euro. La libra esterlina es la cuarta divisa más intercambiada en el mercado internacional de intercambio detrás del dólar, el euro y el yen japonés.", "sections": [{"name": "Monedas con el mismo origen etimológico", "text": "La antigua moneda italiana lira tiene el mismo origen etimológico que la libra. La lira también es la moneda de otros países como Líbano o Turquía donde la moneda es la libra o la lira libanesa (en los billetes dice en árabe \"lira\" y en francés \"livre\").", "subsections": []}, {"name": "Subdivisiones", "text": "Antes de la decimalización, la libra se dividía en 20 chelines (shilling), y el chelín en 12 peniques (penny, plural pence), haciendo un total de 240 peniques en una libra. El símbolo del chelín era \"s\" —no por la primera letra de la palabra en inglés, sino por la palabra latina solidus—. El símbolo del penique era \"d\", de la palabra francesa denier, que se originaba de la palabra latina denario (el sólido bizantino y el denario eran antiguas monedas romanas). Una suma mezclada de chelines y peniques como \"dos chelines y seis peniques\" se escribiría como \"2/6\" o \"2s 6d\", y se diría \"dos y seis\". Cinco chelines se escribiría como \"5s\" o, más frecuentemente, \"5/-\". En la época de la decimalización, la unidad más pequeña era el penique, aunque en el pasado se habían acuñado monedas de menor valor.\nDesde la decimalización en 1971, la libra está dividida en 100 peniques. El símbolo del penique es \"p\"; una cantidad como 50p (0,50 £) se pronuncia normalmente (en inglés) como \"cincuenta pee\" en lugar de \"cincuenta pence\" (esto para ayudar a distinguir entre los nuevos peniques y los viejos durante el cambio de un sistema a otro).\nDespués del Día Decimal (15 de febrero de 1971), el valor de la libra se mantuvo intacto, pero ahora estaba dividida en 100 nuevos peniques en lugar de 240 de los viejos. Cada penique decimal tenía el valor de 2,4 de los peniques pre-decimales. Unos cuantos años después de la decimalización, al penique decimal se le llamaba comúnmente \"nuevo penique\". Las monedas de las denominaciones de ½p, 1p, 2p, 5p, 10p y 50p todas tenían la inscripción \"Nuevo penique\" hasta 1982, cuando la inscripción cambió a Medio penique, un penique, dos peniques, cinco peniques, y así. Las viejas monedas de un chelín (\"1/-\") y dos chelines (\"2/-\", florín) eran equivalentes a las monedas de 5p y 10p respectivamente, y continuaron como válidas en el sistema decimal hasta que las monedas de 5p y 10p fueron reemplazadas por versiones más pequeñas en 1990 y 1992 respectivamente, mientras las viejas versiones eran quitadas de circulación en 1991 y 1993. La vieja moneda de seis peniques también se mantuvo en circulación, con valor de 2½ nuevos peniques, antes de ser quitadas de circulación en 1980.", "subsections": []}, {"name": "Moneda de curso legal y expediciones regionales", "text": "Las leyes de la moneda de curso legal en el Reino Unido son especialmente complejas: de acuerdo con la Royal Mint (Real Casa de la Moneda), moneda de curso legal significa \"que un deudor no puede ser demandado exitosamente por la suspensión del pago si paga en la corte con la moneda de curso legal. Esto no significa que cualquier transacción ordinaria tenga que realizarse con la moneda de curso legal o sólo con la cantidad denominada por la legislación. Ambas partes son libres de acordar cualquier forma de pago ya sea la moneda de curso legal o cualquier otra forma, de acuerdo con sus deseos. Para cumplir las estrictas reglas que gobiernan a la moneda en curso legal es necesario, por ejemplo, ofrecer el importe exacto debido porque no se puede reclamar ningún cambio\".[cita requerida]\nEn Inglaterra y Gales, los billetes expedidos por el Banco de Inglaterra son moneda de curso legal, lo que significa que pueden ser aceptados como el pago de una deuda; no tienen que ser aceptados, pero el deudor tendría una buena defensa legal contra una demanda por la suspensión del pago de la deuda. En Escocia e Irlanda del Norte, ningún billete es moneda de curso legal, y cada banco que expide billetes lo hace en la forma de sus propias letras de cambio. En las Islas del Canal y la Isla de Man, las variaciones locales en los billetes son moneda de curso legal en sus respectivas jurisdicciones.\nLos billetes escoceses, norirlandeses, de las Islas del Canal y maneses a veces son rechazados en las tiendas cuando se usan en Inglaterra. Los tenderos británicos pueden rechazar cualquier forma de pago, aun siendo moneda de curso legal en esa jurisdicción, porque no existe ninguna deuda cuando la oferta de pago se hace. Cuando se paga una cuenta en un restaurante u otra deuda, las leyes de la moneda de curso legal sí se aplican, pero normalmente se acepta cualquier método razonable de pago de la deuda (como tarjeta de crédito o cheque).\nLos billetes son expedidos por los cuatro grandes bancos en Irlanda del Norte — el Banco de Irlanda, el First Trust Bank (Primer Banco de Trust), el Northern Bank (Banco del Norte) y el Ulster Bank (Banco del Úlster). Los billetes impresos en el Banco de Irlanda, aunque son de libras esterlinas, son confunidos en Inglaterra con la antigua libra irlandesa y frecuentemente rechazados. En el año 2000, el Banco del Norte emitió el primer billete plástico en la historia del Reino Unido, correspondiendo en este caso al billete conmemorativo de £5, que fue impreso en Australia.\nLos billetes escoceses son expedidos por el Banco de Escocia, el Banco Real de Escocia y el Clydesdale Bank (Banco Clydesdale), pero (al igual que en Irlanda del Norte) no son moneda de curso legal. Solo las monedas de la Real Casa de la Moneda son moneda de curso legal en Escocia, y solo las monedas de una y dos libras son moneda de curso legal para una cantidad indefinida. Este no siempre fue el caso, ya que durante la Segunda Guerra Mundial los billetes escoceses fueron convertidos en moneda de curso legal en 1939; este estatus fue revertido el 1 de enero de 1946. Algunos billetes del Banco de Inglaterra fueron moneda de curso legal en Escocia e Irlanda del Norte; no obstante, este estatus solo se aplicaba para los billetes de denominaciones inferiores a cinco libras, así que después de que el Banco de Inglaterra quitara de la circulación el billete de una libra en 1985, ningún billete circulante está afectado por esta cláusula.\nLa moneda de una libra del Reino Unido tiene muchos diseños variados en su reverso, que difieren cada año con los nuevos diseños que aparecen; sin embargo, todas son monedas de la Real Casa de la Moneda y de legalidad equivalente. Las Dependencias de la Corona: Islas del Canal (incluyendo a Alderney) y la Isla de Man expiden sus propias acuñaciones.\nTodas las monedas circulantes británicas son de curso legal en todo el Reino Unido, en la mayoría de los casos tienen un límite de uso por transacción, como la moneda conmemorativa de cinco libras y la de 25 peniques (\"corona\") que raramente se ven en circulación. Muchas monedas de oro expedidas por la Real Casa de la Moneda siguen siendo de curso legal, pero debido a que tienen un valor metálico mucho mayor que el valor que les fue asignado, nunca se usan en circulación y tienden a ser conservadas por coleccionistas.\nLos territorios británicos de ultramar de Gibraltar, Santa Elena y sus dependencias asociadas, así como las Islas Malvinas, también expiden sus propias divisas, que se fijan al valor de la libra.\nLos países que usan la libra o estas divisas ligadas con la libra son conocidos como los países de la zona esterlina. Durante finales del siglo XIX y hasta mediados del siglo XX, un gran número de dominios y colonias británicas fueron miembros de la zona esterlina.\nLa ley británica establece que las monedas de curso legal acuñadas para circular en el país deben tener el retrato del monarca que se encuentre en el trono. Así, distintos retratos oficiales de la reina Isabel II pueden observarse en las monedas británicas a través del tiempo. Asimismo, tras el fallecimiento de la monarca en 2022 fue necesario que la Royal Mint del Reino Unido comenzara a trabajar en los nuevos diseños con la efigie del nuevo rey, Carlos III. No obstante, ello no significa que las monedas con el retrato de la reina anterior dejen de tener curso legal, siendo éstas perfectamente circulantes. Del mismo modo, muchos Estados de la Mancomunidad de Naciones (Commonwealth) y otros que tienen al monarca del Reino Unido como jefe de Estado también deberán cambiar el diseño de sus monedas y billetes. Este es el caso de países como Canadá, Australia, Nueva Zelanda y Belice, entre muchos otros.[2]​\nNotar también que es la usanza, después el siglo XVII, por la cabeza de un nuevo monarca en los obversos de las monedas británicas de hacer frente a la dirección opuesta de su antecesor. Así, perqué la cabeza de la reina Isabel II hace frente a la derecha sobre las monedas, la cabeza de Carlos III hará frente a la izquierda. Hay una excepción a esta regla; ambas las cabezas de Jorge V y Jorge VI hacen frente a la izquierda, porqué Eduardo VIII - cuyas monedas estaban nunca puestas en circulación - haría frente a la derecha.", "subsections": [{"name": "Billetes de polímero", "text": "El billete de polímero de £5, fue emitido en el año 2000 por el Northern Bank (ahora Danske Bank) y fue el único billete de polímero en circulación hasta 2016. El Banco de Inglaterra comenzó a emitir billetes de polímero de £5 en septiembre de 2016 y retiró de la circulación los billetes de papel moneda de £5 el 5 de mayo de 2016.[3]​[4]​ El billete de polímero de £10 fue emitido el 14 de septiembre de 2017 y el de papel moneda fue retirado el 1 de marzo de 2018. En febrero de 2020 se puso en circulación el billete de £20 y en junio de 2021 el de £50. De igual forma, se dispuso el retiro de circulación de los billetes de papel de £20 y £50 para el 1 de octubre de 2022.[5]​"}]}, {"name": "Historia", "text": "", "subsections": [{"name": "Antes de la libra esterlina", "text": "En los tiempos anglo-sajones, pequeñas monedas de plata conocidas como sceattas eran usadas en el comercio: estas se derivaban de unos ejemplos frisios, y pesaban unos 20 granos (1,3 g).\nEl rey Offa de Mercia (790) introdujo un penique plateado de 22,5 granos (1,5 gramos). Doscientos cuarenta de estos fueron hechos de una medida de plata conocido como la libra Torre: aparentemente esta pesaba 5400 granos (349,9 g).\nEn 1526 el estándar fue cambiado por la libra Troy de 5760 granos (373,242 g)."}, {"name": "La libra esterlina", "text": "Como unidad monetaria, el término libra se origina del valor del peso de una libra de plata de gran pureza conocida como plata esterlina.\nLas primeras monedas de peniques (1/240 de libras (349,9 g) de plata) se acuñaron con plata casi pura (99,9 % de pureza), pero las monedas acuñadas de esta forma se desgastaban rápidamente, por lo que, a partir de 1158, el Rey Enrique II comenzó a acuñar monedas de peniques con una aleación que era 92,5 % de plata. Esta aleación pasó a denominarse plata esterlina (plata fuerte), debido a que las monedas acuñadas con esta aleación no se desgastaban tan fácilmente.[6]​\nEl Gran Envilecimiento\nEntre 1544 y 1551 tuvo lugar la Política del Gran Envilecimiento, que fue una política monetaria que implicaba un envilecimiento de todas las denominaciones correspondientes la moneda oficial de Inglaterra, la libra esterlina. Esta medida, fue introducida en 1544 en Inglaterra por orden del Rey Enrique VIII, que redujo la cantidad de metal precioso en las monedas de oro y plata y, en algunos casos, la sustituyó por completo por metales básicos con un valor monetario muy inferior, como lo era y sigue siendo el cobre.\nEl móvil para la aplicación de esta reforma, fue para financiar el excesivo gasto público de la corona de Enrique VIII al tener que también financiar una la costosa guerra de cortejo real contra la corona escocesa y la tercera guerra anglo-franca del siglo XVI, para ello, el estado inglés debió recurrir a medidas desesperadas como la disolución de los monasterios, en 1537, excusándose en un desacuerdo con las políticas de la iglesia, que luego llevó una confiscación de cientos de propiedades, incluyendo no solo monasterios, sino también abadías y hasta parroquias, que pasaron a manos del estado inglés, las cuales se vendieron por un monto equivalente a £3 millones (equivalente a £2.5 mil millones en 2021), y varias colecciones de joyas, platería y demás pertenencias personales de los funcionarios eclesiásticos, con un valor aproximado de £80,000 (equivalente a £66 millones en 2021).[7]​\nPara financiar ambos conflictos y un monto \"inespecificado\" para los gastos personales del monarca; junto a este cuantioso gasto, la corona tampoco escatimó en endeudarse hasta niveles impagables: a principios de 1544, pidieron préstamos equivalentes a 400,000 marcos escoceses de plata, y los prestatarios naturalmente demandaron - infructosamente - el reintegro total de sus fondos al año fiscal siguiente, algo que la corona no pudo cumplir en tiempo y forma, y cuyos pagos cesaron hasta que se reanudaron y la deuda se saldó recién en la década de los 1550s. Por otro lado, para paliar la crisis, el rey comenzó a otorgar préstamos, subsidios y \"benevolencias\" a miembros de la corte y el parlamento, que en dos años, dicha suma alcanzó las £ 300,000 (equivalente a £205 millones actuales).[8]​\nDurante el proceso de envilecimiento, los estándares de oro se redujeron de manera drástica, más de un 17 % de recortes en el caso de las piezas acuñadas en oro, mientras que el contenido de la plata se redujo en proporciones muy superiores, un total de 67.5 %, pasando de una densidad del 92,5 %, a un mínimo del 25 % en 1551, cuatro años después de la muerte de Enrique VIII, y momento en que se revirtieron los efectos de la reforma, restaurándose el poder adquisitivo de la libra mediante la reintroducción de patrones monetarios metálicos de alta densidad (se volvió al estándar del 92.5 %).\nEnrique, previendo un cataclismo económico en el corto plazo, ya había avecinado la crisis dos años antes del comienzo de la guerra con Francia: en mayo de 1542, emitió un decreto secreto por el cual ordenaba que se redujeran de manera oculta, las proporciones de oro y plata en todas las denominaciones y también ordenaba la reintroducción del Testoon (equivalente a doce peniques, luego rebautizada como shilling, o chelín, en español). Durante los dos años siguientes, estas nuevas monedas envilecidas junto con los testoon, se fueron almacenando de manera progresiva y escalada en la Torre de las Joyas del Palacio de Westminster, mientras continuaba la producción de monedas con el estándar actual.\nEn mayo de 1544, la escasez de metales preciosos que estaban en posesión de la casa de la moneda, hizo que el gobierno hiciese efectivo aquel contrato secreto redactado dos años antes y permitiera que las monedas envilecidas se convirtieran en piezas de curso legal y entraran en circulación. Sin embargo, dos meses más tarde, en julio de 1544, los comerciantes de los Países Bajos se dieron cuenta de que los groats (o grañones; piezas de cuatro peniques) de plata recién acuñados habían sido envilecidos y empezaron a ofrecerlos a un precio más bajo en moneda local. La introducción de estas monedas envilecidas hizo que desaparecieran de la circulación monedas con un valor nominal similar pero con mayor contenido de metal precioso, demostrando la validez de la Ley de Gresham.[9]​\nSin embargo, el descubrimiento del fraude no interrumpió el proceso, por lo que los estándares de oro y plata continuaron cayendo durante el reinado de Enrique VIII: en 1545 el oro se redujo a 22 quilates y nuevamente a 20 quilates en 1546. El contenido de plata también se redujo varias veces desde la plata esterlina (92,5 %) al 50 % en 1549 y nuevamente a 33 % en 1546. El cobre se utilizó como sustituto de la plata en las monedas.[10]​\nDurante 1544, los estándares de oro y plata cayeron por primera vez, reduciéndose, en el caso del oro, se pasó de una graduación de 24 quilates (99.99 %) a una algo inferior, de 22 quilates (91.67 %) en 1545 y luego a una de 20 quilates (83.25 %) al año siguiente, mientras que en el caso de la plata, se redujo de 92.5 % (plata esterlina) a 50 % en 1546 y nuevamente a un mero 33 % en 1549. Durante estos años, comenzó el cobre como una alternativa para compensar la escasez de metales preciosos, tanto en las piezas de oro como en las de plata. En general, en la gran mayoría de estas piezas, el contenido neto de plata consistía en una delgada capa que tenía una tendencia progresiva a la erosión que se hacía evidente a medida que aumentaba su tiempo en circulación, por lo cual, aquellas piezas degradadas dejaban entrever un contenido cobrizo intenso que se acentuaba particularmente en la zona que representaba la nariz del jefe de Estado, hecho que le valió el apodo de Old Coppernose (en español: Viejo Nariz de Cobre).[11]​\nTras la muerte de Enrique VIII en 1547, fue sucedido ese mismo año por su hijo varón de nueve años, Eduardo VI, por entonces, al cargo de sus tutores; Durante el reinado de este, las políticas de envilecimiento continuaron de manera sostenida, hasta que se llegó a un punto clímax en el que el contenido de plata en todas las denominaciones era de tan solo 25 % del total; En 1548, en un intento por revertir los efectos devaluatorios de la reforma, que por cierto, hicieron caer a la economía a niveles presenciados en siglos anteriores, se reintrodujo un estándar metálico de oro que fijaba la pureza en 22 quilates (conocido como \"estándar del oro corona\"), el caso de las denominaciones en plata, se tardaron tres años más en revertir sus efectos, (en octubre de 1551, se abolió esta política de manera definitiva) principalmente debido a su prevalencia en las transacciones minoristas, que dificultó de sobremanera la confianza en la introducción de nuevas monedas.\nRestauración Monetaria del reinado de Isabel I (1558-1603)\nPara el momento en que Isabel I llegó al poder en 1558, la calidad de las monedas circulantes en el país, ya había afectado de manera contundente la reputación de la corona y la confianza libra esterlina, la cual se la consideraba, hasta antes del envilecimiento, como una de las principales reservas de valor monetario. Los comerciantes extranjeros de todos los rubros, se negaban rotundamente a aceptar las monedas envilecidas como medio de pago. La reina, su consejero William Cecil y el banquero Thomas Gresham, descrifraron que la única forma de solucionar esta crisis de desconfianza, era restaurar el contenido de oro y plata en todas las denominaciones, pero a costa de reducir su peso; Por ejemplo, el soberano de oro, que tenía un peso de 12.96 gramos antes de 1544, vio aumentada su pureza en dos quilates tras la reforma, pero a cambio, perdió 2.02 gramos. También se dieron cuerta de la importancia de remover las piezas envilecidas de circulación: Para ello, la corona decretó una ley que prohibía a la ciudadanía exportar las monedas a mercados extranjeros, y además, declaró inválidas todas aquellas piezas envilecidas producidas durante las dos décadas previas.\nLas antiguas monedas, con una pureza muy superior, eran atesoradas y rara vez se las veía en circulación de deudas, mientras que, las piezas envilecidas, de mucho menor valor, se las usaba para pagar deudas y/o comprar cosas en la vida cotidiana, este fenómeno fue retratado por Henry D. Macleod, a fines de siglo XIX, y quien le otorgó el nombre \"Ley de Gresham en honor al banquero (aunque este no fuera el primero en darla a conocer) a un principio que establece que \"el dinero malo (piezas envilecidas), reemplaza al bueno (piezas de alta pureza)\".\nEn 1560, bajo mandato real, Thomas Gresham retiró de la circulación todas las piezas envilecidas e hizo fundir las monedas retiradas y las sustituyó por otras de nueva acuñación con una elevada pureza.\nLa libra esterlina mantuvo su valor intrínseco —\"un fetiche en la opinión pública\" lo llamó Braudel— de manera única entre las divisas europeas, aún después de que el Reino Unido adoptó oficialmente el patrón oro, hasta después de la Primera Guerra Mundial, soportando crisis financieras en 1621, en 1694-1696, cuando John Locke panfleteó por la libra esterlina como \"una unidad fundamental invariable\" y de nuevo en 1774 y 1797. Ni siquiera los violentos desórdenes de la Guerra Civil devaluaron la libra esterlina en los mercados monetarios de Europa. Braudel atribuye el fácil crédito de Inglaterra a la divisa restaurada, que nunca fue devaluada a través de los siglos,[cita requerida] que dio seguridad de contrato y una alza a una superioridad financiera durante el siglo XVIII. La libra esterlina ha sido la moneda del Banco de Inglaterra desde sus inicios en 1694."}, {"name": "El patrón oro", "text": "La libra se trasladó extraoficialmente del patrón plata al patrón oro gracias a una sobrevaluación del oro en Inglaterra que atrajo oro del extranjero y ocasionó una importación constante de la moneda de plata, a pesar de una revaluación del oro en 1717 por Isaac Newton, maestro de la Real Casa de la Moneda. El patrón oro de facto continuó hasta su adopción oficial después del fin de las guerras napoleónicas, en 1816. Este duró hasta que el Reino Unido, en acuerdo con muchos otros países, abandonó el patrón en 1914, al estallar la Primera Guerra Mundial, cuando los billetes del Banco de Inglaterra y del Tesoro se convirtieron en moneda de curso legal.\nAlgunas discusiones tuvieron lugar después de la Conferencia Monetaria Internacional de 1865 en París concernientes a la posibilidad de que el Reino Unido se uniera a la Unión Monetaria Latina, y una Comisión Real de Acuñación Internacional examinó la cuestión, resultando en la decisión en contra de unirse a la Unión Monetaria.\nAntes de la Primera Guerra Mundial, el Reino Unido tenía una de las economías más fuertes del mundo, reteniendo el 40 % de las inversiones de ultramar en el mundo. Sin embargo, al final de la Guerra, el país debía £850 millones, la mayor parte a los Estados Unidos, con intereses que costaban al país un 40 % de todo el gasto del gobierno.[12]​ El gobierno británico bajo el Primer Ministro David Lloyd George y el Canciller de la Hacienda Austen Chamberlain trató de compensar el déficit con una política deflacionaria, pero esto sólo condujo a la Depresión de 1920–21.[13]​\nEn un intento de recobrar la estabilidad, en 1925, se introdujo el patrón cambio oro que suponía una variación del patrón oro, bajo este sistema, el valor de la divisa fue fijada al precio del oro, en los niveles previos a la guerra, aunque la población solo podía intercambiar su dinero por oro en lingotes, en lugar de monedas."}, {"name": "Zona esterlina", "text": "La libra esterlina fue usada como la moneda de muchas partes del Imperio británico. Al crearse la Mancomunidad Británica de Naciones, los países de la Mancomunidad introdujeron sus propias divisas como la libra australiana o la libra irlandesa, esto llevó a crear la denominada zona esterlina, donde esas divisas mantenían una relación fija con la libra esterlina."}, {"name": "Tras el abandono del patrón oro", "text": "El 21 de septiembre, como resultado de la Gran Depresión, el Reino Unido abandonó definitivamente el patrón oro y la libra se devaluó un 25 %.[14]​ A partir de esta fecha, la libra esterlina se convirtió en una moneda emitida por decreto (o fiat) y a su vez fiduciaria, con su valor determinado por su continua aceptación en la economía nacional e internacional.\nDespués de dejar el patrón oro, ha habido varios intentos de fijar el valor de libra a otras monedas, inicialmente el dólar estadounidense.\nEn 1940, un acuerdo con los Estados Unidos fijó la libra esterlina al dólar estadounidense a una tasa de 1 libra = 4,03 dólares estadounidenses.[15]​ Este tipo de cambio se mantuvo durante la Segunda Guerra Mundial y se convirtió en parte del Sistema de Bretton Woods que rigió los tipos de cambio de la posguerra.\nEn 1946, La libra fue hecha completamente convertible como una condición por recibir un préstamo de Estados Unidos de 3750 millones de dólares después de la Segunda Guerra Mundial.\nEl 19 de septiembre de 1949, bajo una presión económica continua, y a pesar de meses de negaciones de que lo evitarían, el gobierno devaluó la libra un 30,5 % de una tasa de 1 libra = 4,04 dólares a una tasa de 1 libra = 2,80 dólares.[16]​ Esta devaluación provocó que varias otras monedas se devaluaran frente al dólar, entre ellos: Australia, Dinamarca, Irlanda, Egipto, India, Israel, Nueva Zelanda, Noruega y Sudáfrica.[17]​\nEn 1961, 1964 y 1966, la libra esterlina estuvo bajo una presión renovada, ya que los especuladores vendían libras por dólares. En el verano de 1966, con la caída del valor de la libra en los mercados de divisas, el gobierno laborista de Harold Wilson endureció los controles de cambio. Entre las medidas, se prohibió a los turistas sacar del país más de £50 en cheques de viajero y remesas, más £15 en efectivo;[18]​ esta restricción no se levantó hasta 1979. El 18 de noviembre de 1967, la libra esterlina se devaluó un 14,3 % a uma una tasa de 1 libra = 2,40 dólares estadounidenses.[16]​[19]​\nLa libra, al igual que todas las otras monedas del mundo, ya no mantiene ninguna relación con el oro, la plata o ningún otro metal precioso. El dólar estadounidense fue la última divisa en abandonar el oro, en 1971.\nCon la ruptura del del Sistema de Bretton Woods, la libra esterlina flotó desde agosto de 1971 en adelante. Al principio se apreció un poco, subiendo a casi US$2,65 en marzo de 1972 desde US$2,42, el límite superior de la banda en la que se había fijado. El área de la libra esterlina efectivamente terminó en este momento, cuando la mayoría de sus miembros también optaron por flotar libremente frente a la libra esterlina y el dólar.\nUna crisis posterior siguió en 1976, cuando aparentemente el Fondo Monetario Internacional (FMI) pensó que la libra debería establecerse a $1,50 dólares, y como resultado la libra cayó a $1,57, y el gobierno decidió que tenía que solicitar un préstamo de £2,3 mil millones al FMI.\nA principios de la década de 1980 la libra subió hasta el nivel de $2 al elevarse las tasas de interés en respuesta a la política monetarista y la alta tasa de cambio fue ampliamente considerada culpable de la profunda recesión de 1981. En su punto más bajo, la libra se colocó a solo $1,05 dólares en febrero de 1985, antes de regresar al nivel de 2 dólares a principios de la década de 1990.[20]​\nAdopción del sistema decimal\nEl 15 de febrero de 1971, pasó a la historia como el Decimal Day (Día decimal), dado que en esa fecha comenzó la división de la libra esterlina bajo la forma métrica decimal al establecer una nueva fracción de 100 peniques, antes de eso la libra esterlina británica (símbolo \"£\") se subdividía en 20 chelines, cada uno de 12 peniques (antiguos), un total de 240 peniques. Con la decimalización, la libra mantuvo su antiguo valor y nombre, pero se abolió el chelín y se revaluó el penique ajustándolo al nivel del centavo, de modo que la libra se subdividió en 100 de lo que originalmente se llamó \"nuevos peniques\" (\"NP\"), y luego solo peniques (\"p\") cuando la confusión ya no era probable. Cada nuevo penique o centavo valía 2,4 peniques antiguos (abreviado \"d\")."}, {"name": "Siguiendo al marco alemán", "text": "En 1988, el Canciller de la Hacienda del Reino Unido de Margaret Thatcher, Nigel Lawson, decidió que la libra debería hacer sombra al marco alemán de Alemania Occidental, con el resultado no deseado de un rápido aumento de la inflación a medida que la economía florecía debido a las bajas tasas de interés.[21]​\nDespués de la reunificación alemana en 1990, ocurrió lo contrario, ya que los altos costos de endeudamiento de Alemania para financiar la reconstrucción del Este, exacerbados por la decisión política de sustituir el Marco de la República Democrática Alemana por su contraparte occidental en una proporción de 1:1, significaron que las tasas de interés en otros países ensombrecieron la divisa alemana, especialmente en el Reino Unido, era demasiado alto en relación con las circunstancias internas, lo que provocó una disminución de la vivienda y una recesión."}, {"name": "Siguiendo a la Unidad Monetaria Europea", "text": "En otro cambio de táctica, el 8 de octubre de 1990 el gobierno de Thatcher decidió unirse al Mecanismo Europeo de Tasa de Cambio, con la libra establecida en 2,95 marcos alemanes. No obstante, el país fue forzado a retirarse del sistema el Miércoles Negro (16 de septiembre de 1992), ya que la ejecución económica británica hacía la tasa de cambio insostenible.[22]​[23]​\nEl Miércoles Negro vio a las tasas de interés saltar de 10 % a 12 %, y finalmente a 15 % en un vano intento de detener a la libra de caer debajo de los límites del Mecanismo. La tasa de cambio cayó a 2,20 marcos alemanes. Proponentes de una tasa de cambio más baja entre la libra y el marco (que después fue reemplazado por el euro) fueron reivindicados, ya que la libra, más barata, fomentó las exportaciones y contribuyó a la prosperidad económica de la década de 1990.[24]​"}, {"name": "La década de 2000", "text": "Las preocupaciones de la inflación en el Reino Unido llevaron al Banco de Inglaterra a aumentar las tasas de interés al doble inesperadamente a fines de 2006 y principios de 2007, causando que la libra se elevara a su tasa más alta contra el euro desde enero de 2003. Futuros aumentos se esperaron en 2007. Esto ha tenido un efecto de golpe contra otras divisas mayores, y la libra alcanzó su precio más alto en 26 años contra el dólar el 8 de abril de 2007, habiendo pasado al nivel de los 2 dólares por primera vez desde 1992.[cita requerida]"}, {"name": "La crisis financiera de 2008", "text": "La libra esterlina se devaluó gravemente tras la crisis financiera de 2008, hasta alcanzar el valor de €1,25 en abril de 2008[25]​ y $1,38 en enero de 2009.[26]​ La libra alcanzaría su valor más ínfimo el 29 de diciembre de 2009, a €1,0219.[27]​\nEl 5 de marzo de 2009, el Banco de Inglaterra anunció que inyectaría 75 000 millones en la economía británica, a través de un proceso llamado expansión cuantitativa. A pesar de ser la primera vez que un proyecto de tal envergadura era llevado a cabo en la historia del Reino Unido, el entonces Gobernador del Banco de Inglaterra, Mervyn King sugirió que no se trataba de ningún experimento.[28]​\nEste proceso, llevó al Banco de Inglaterra a aumentar la masa monetaria, imprimiendo dinero, para poder comprar activos como deuda pública, bonos corporativos, letras de cambio u obligaciones.[29]​ La cantidad inicial se estableció en 75 000 millones de libras, aunque el entonces Canciller de la Hacienda del Reino Unido, Alistair Darling, autorizó a emitir hasta 150 000 millones si fuera necesario.[30]​ Se esperaba que el proceso durara 3 meses, y con resultados a largo plazo. En noviembre de 2009 ya se habían inyectado más de 175 000 millones mediante la expansión cuantitativa, reduciendo la efectividad del proceso a largo plazo. En julio de 2012, con la última emisión, se habían creado más de 375 000 millones de libras esterlinas, con las que se había comprado exclusivamente bonos del estado de Reino Unido, por valor de un tercio de la deuda soberana británica.[31]​"}, {"name": "El referéndum sobre la permanencia del Reino Unido en la Unión Europea de 2016", "text": "El resultado del referéndum sobre la permanencia del Reino Unido en la Unión Europea el 23 de junio de 2016 causó una gran incertidumbre acerca del futuro de las relaciones internacionales y la política doméstica británica, causando un desplome de la libra esterlina contra las principales divisas internacionales.[32]​ La noche anterior al voto, la libra cotizaba a €1,30; al día siguiente a €1,23, una devaluación del 5 %. Frente al dólar, la libra también registró una devaluación inmediata, cayendo desde $1,466 a $1,3694 cuando se anunció el resultado del referéndum. En octubre del 2016, la libra cotizaba a $1,2232, registrando una caída del 16 %.[33]​"}]}, {"name": "Véase también", "text": "Zona esterlina\nChelín inglés\nPenique", "subsections": []}, {"name": "Referencias", "text": "↑ «United Kingdom Inflation Rate» (en inglés). Consultado el 31 de marzo de 2017. \n↑ «Bruno Rodríguez Carapelle - La Muerte de la Reina y el Cambio del Cono Monetario (La Tercera, 13 de septiembre de 2022)». \n↑ «El nuevo billete de plástico de Reino Unido sirve tanto para pagar tus compras como para tocar vinilos». Gizmodo en Español. Consultado el 15 de octubre de 2019. \n↑ numismaticodigital.com. «Billete polímero para el Reino Unido dedicado a Churchill». numismaticodigital.com. Consultado el 15 de octubre de 2019. \n↑ «Current bank notes». bankofengland.co.uk (en inglés). Consultado el 6 de junio de 2022. \n↑ Shaw, William Arthur (13 May 1896). \"The History of Currency, 1252–1894: Being an Account of the Gold and Silver Moneys and Monetary Standards of Europe and America, Together with an Examination of the Effects of Currency and Exchange Phenomena on Commercial and National Progress and Well-being\". Putnam.\n↑ «The English Crown's foreign debt by Wayne M. Kline». \n↑ «Some Financial Expedients of Henry VIII by W.C Richardson». \n↑ «The Testoons of Henry VIII». AMR Coins. Consultado el 2 de abril de 2017. \n↑ Li, Ling-Fan (2009). After the Great Debasement, 1544-51: Did Gresham's Law Apply?\n↑ Owen, James (19 de diciembre de 2012). «Old Coppernose – Quantitative easing, the medieval way». Royal Mint. Archivado desde el original el 10 de abril de 2019. Consultado el 3 de abril de 2017. \n↑ \"The Interest Burden of Inter-Government Debts\". The Economic World. 110: 342. 2 Septiembre 1922.\n↑ The pound sterling : A history of English money, en inglés, consultado el 2/4/2023.\n↑ The Board of Trade Journal, 7 de enero de 1932.\n↑ A History of the Canadian Dollar, en inglés, consultado el 2/4/2023.\n↑ a b How the British pound plummeted, en inglés, consultado el 2/4/2023.\n↑ Borio, Claudio E. V.; Toniolo, Gianni (2006). One hundred and thirty years of central bank cooperation: a BIS perspective. Bank for International Settlements, Monetary and Economic Dept. p. 41.\n↑ £ 50 en 1966 es alrededor de £ 991 hoy.\n↑ British devalue pound, ask $1 million loan, en inglés, consultado el 2/4/2023.\n↑ GBP Forecast to See Support at 1.40 v US Dollar, But 1983 Lows a Step Too Far, en inglés, consultado el 04/04/2023.\n↑ Sometimes it can pay to break the rules, en inglés, consultado el 04/04/2023.\n↑ [ Naef, Alain (2022). An Exchange Rate History of the United Kingdom: 1945–1992. Studies in Macroeconomic History. Cambridge: Cambridge University Press. p. 214.]\n↑ James, Harold (2020). Making a Modern Central Bank: The Bank of England 1979–2003. Studies in Macroeconomic History. Cambridge: Cambridge University Press. p. 290.\n↑ Wren-Lewis, Simon, et al. (June 1991). \"Evaluating the U.K.'s Choice of Entry Rate into the ERM\", The Manchester School of Economic & Social Studies Vol. LIV Supplement, University of Manchester, pp. 1–22.\n↑ «Información histórica - GBP/USD». \n↑ «Información histórica - GBP/EUR». \n↑ «La libra alcanza otro negativo histórico contra el Euro (en inglés)». \n↑ «El Banco de Inglaterra inyectará 75,000 millones a la economía (en inglés)». \n↑ «El Banco Central Europeo y el Banco de Inglaterra recortan sus tipos de intereses hasta bajos mínimos (en inglés)». \n↑ «El Banco de Inglaterra imprime 75,000 millones y recorta las tasas de interés a la mitad (en inglés)». \n↑ «¿Qué es la expansión cuantitativa? (en inglés)». \n↑ Colin Lawrence. «Exchange Rates Today: British Pound Slumps Vs Euro, Dollar As UK Services Hits Record Low» (en inglés). Consultado el 14 de enero de 2019. \n↑ «British Pound (GBP) to US Dollar (USD) exchange rate history» (en inglés). Consultado el 14 de enero de 2019. ", "subsections": []}, {"name": "Bibliografía", "text": "Krause, Chester L., y Clifford Mishler (2008). Standard Catalog of World Coins: (1901–2008). Krause Publications. ISBN 9780896897137.\nPick, Albert (2009). Standard Catalog of World Paper Money, Modern Issues, 1961-Present. Colin R. Bruce II y Neil Shafer (editores). Krause Publications. ISBN 0-87341-207-9.", "subsections": []}, {"name": "Enlaces externos", "text": " Wikcionario  tiene definiciones y otra información sobre libra esterlina.\n Wikinoticias tiene noticias relacionadas con la libra esterlina.\nConversor de libras a euros.\nBilletes\nMonedas británicas (catálogo y galería)\nLos billetes de Reino Unido (en inglés) y (en alemán)", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Logotipo", "title": "Logotipo", "summary": "Busca fuentes: «Logotipo» – noticias · libros · académico · imágenes\nUn logotipo —especialmente también llamado logo— es un signo gráfico que identifica a una empresa, un producto comercial, un proyecto, o en general, a cualquier entidad pública o privada.[1]​\nAntes \nHistóricamente, los artesanos del barro, del cristal, de la piedra, los fabricantes de espadas y artilugios de hierro fino, así como los impresores, utilizaban marcas para señalar su autoría.", "sections": [{"name": "El logotipo como elemento de comunicación", "text": "Para que un logotipo resulte congruente y exitoso, debe ser conforme al principio fundamental del diseño donde «menos es más». Dicha simplicidad permite que sea:\nLegible - hasta el tamaño más pequeño.\nEscalable - a cualquier tamaño requerido.\nReproducible - sin restricciones materiales.\nDistinguible - tanto en positivo como en negativo.\nMemorable - que impacte y no se olvide.\nLas marcas construidas exclusivamente con letras llegan a tener tanta fuerza o más que aquellas que, si bien cuentan con un icono gráfico, requieren la asociación del texto para posicionarse desde el inicio; tal es el caso, por ejemplo, de las marcas de automóviles. Posteriormente, la imagen queda intrínsecamente asociada al sonido del nombre de la marca original.\nEl logotipo puede ser el eje afirmador de la propiedad privada a través del hecho de la autoría.\nUn logotipo se diferencia por:\nLa funcionalidad de un logotipo radica en su capacidad para comunicar el mensaje que se desea, como, por ejemplo: Somos una empresa responsable o Este producto es de alta calidad, y para conseguir esto se necesitan colores y formas que contribuyan a que el espectador final le dé esta interpretación.\nUn logotipo, en términos generales, requiere el uso apropiado de la semiótica como herramienta para lograr la adecuada comunicación del mensaje y la interpretación por parte del espectador más cercana a este mensaje. Así, por ejemplo, un círculo amarillo puede interpretarse de diferentes formas y dársele diferentes significados como sol, moneda, huevo, queso u otros, mientras que si se encuentra adyacente a la palabra \"banco\", ambos elementos, el círculo amarillo y la palabra banco, toman un solo significado: \"Institución Bancaria\". Es decir, el logotipo, al momento de representar una entidad o grupo de personas, lo más apropiado es que mantenga congruencia semiótica entre lo que se entiende y lo que realmente busca representar la imagen.", "subsections": []}, {"name": "¿Qué es una simbología?", "text": "La simbología es el estudio de los símbolos o el conjunto de estos. Un símbolo, por otra parte, es la representación sensorial de una idea que guarda un vínculo convencional y arbitrario con su objeto.\nLa noción de simbología se utiliza para nombrar al sistema de los símbolos que identifican a los diferentes elementos de algún ámbito. La electricidad, la química y la mecánica, entre otros ámbitos del conocimiento, tienen su propia simbología.\nQuien conoce la simbología de una especialidad, puede expresarse mediante los símbolos e interpretar diagramas o esquemas que apelen a los símbolos en lugar de las palabras. Es posible clasificar la simbología según su objeto de estudio o área de incumbencia.", "subsections": []}, {"name": "Protección del diseño", "text": "Los logotipos y su diseño pueden estar protegidos por derechos de autor, a través de varias organizaciones de propiedad intelectual en todo el mundo que ponen a disposición los procedimientos de solicitud para registrar un diseño y darle protección legal. Por ejemplo, en el Reino Unido, la Oficina de Propiedad Intelectual (Reino Unido) rige los diseños registrados, las patentes y las marcas comerciales. Por lo general, es el diseño visual el que estará protegido, incluso si se reproduce en una variedad de otros colores o fondos.", "subsections": []}, {"name": "Marcas corporativas", "text": "Isologo, imagotipo, isotipo y logotipo son varias tipologías posibles de la marca corporativa.", "subsections": []}, {"name": "Véase también", "text": "Derecho de autor\nDiseño gráfico\nEmpaquetado neutro\nImprenta\nImpresión\nMarca de impresor\nMarca personal\nMarca (registro)\nReputación de marca\nTipografía", "subsections": []}, {"name": "Referencias", "text": "↑ «logotipo». Diccionario Español de Ingeniería (1.0 edición). Real Academia de Ingeniería de España. 2014. ", "subsections": []}]}
