{"url": "https://es.wikipedia.org/wiki/M%C3%B3dem", "title": "Módem", "summary": "Este aviso fue puesto el 5 de junio de 2023.\nAM\nFM\nPM\nQAM\nDSB\nSSB\nASK\nAPSK\nCPM\nFSK\nGMFK\nGMSK\nMFSK\nMSK\nOOK\nPPM\nPSK\nSC-FDMA\nTCM\nCSS\nDSSS\nFHSS\nTHSS\nDetección y corrección de errores\nDemodulación\nCódigos en línea\nMódem\nPAM\nPCM\nPWM\nΔΣM\nOFDM\nvte\nUn módem (del inglés modem, acrónimo de modulator demodulator; pl. módems)[1]​ es un dispositivo que convierte las señales digitales en analógicas (modulación) y viceversa (desmodulación),[2]​ y permite así la comunicación entre computadoras a través de la línea telefónica o del cablemódem. Sirve para enviar la señal moduladora mediante otra señal llamada portadora.\nSe han usado módems desde la década de 1960, debido a que la transmisión directa de las señales electrónicas inteligibles, a largas distancias, no es eficiente; por ejemplo, para transmitir señales de audio por el aire se requerirían antenas de gran tamaño (del orden de cientos de metros) para su correcta recepción. Es habitual encontrar en muchos módems de red conmutada la facilidad de respuesta y marcación automática, que les permiten conectarse cuando reciben una llamada de la RTPC (Red Telefónica Pública Conmutada) y proceder a la marcación de cualquier número previamente grabado por el usuario. Gracias a estas funciones se pueden realizar automáticamente todas las operaciones de establecimiento de la comunicación.", "sections": [{"name": "Historia", "text": "Los servicios por cable de noticias en la década de 1920 utilizaban dispositivos multiplex que satisfacían la definición de un módem.[3]​ Sin embargo, la función de módem era incidental a la función de multiplexación, por lo que generalmente no se incluyen en la historia de los módems.\nLos módems surgieron de la necesidad de conectar teletipos a través de líneas telefónicas normales en lugar de en las líneas arrendadas más caras que anteriormente se habían utilizado para los teletipos basados en bucles de corriente y los telégrafos automatizados.\nEn 1941, los Aliados desarrollaron un sistema de encriptado de voz llamado SIGSALY que usaba un vocoder para digitalizar el habla, luego encriptaba el habla con un teclado de una única vez y codificaba los datos digitales como tonos utilizando el cambio de frecuencia.\nLa producción generalizada de módems en Estados Unidos comenzó en 1958 (el año en que se usó por primera vez la palabra «modem»[4]​) como un dispositivo parte del sistema de defensa aérea SAGE, conectando terminales en varias bases aéreas, en los lugares en que se situaban los radares y en los centros de mando y control con los centros directores del SAGE que se encontraban dispersos por Estados Unidos y Canadá. Los Bell Labs  de  AT&T describieron los módems SAGE como conformes a su entonces recientemente publicado estándar de  conjunto de datos Bell 101. Mientras funcionaban en líneas telefónicas dedicadas, los dispositivos en cada extremo no eran diferentes de los módems comerciales de Bell 101, módems de 110 baudios.\nLos Data-Phones 201A y 201B eran módems síncronos que utilizaban el cifrado de cambio de fase de dos bits por baudio (PSK). El 201A operaba medio dúplex a 2000 bit/s en las líneas telefónicas normales, mientras que el 201B proporcionaba un servicio dúplex completo de 2400 bit/s en líneas alquiladas de cuatro hilos, siendo los canales de envío y recepción ejecutados en su propio conjunto de dos hilos.\nAT&T también introdujo en 1962 el famoso estándar de conjunto de datos Bell 103A.[5]​[6]​ Proporcionaba un servicio dúplex completo a 300 bit/s en las líneas telefónicas normales. Se usó la modulación por desplazamiento de fase, con el originador de la llamada transmitiendo a 1070 o 1270 Hz y el módem que respondía transmitiendo a 2025 o 2225 Hz. El 103A2, fácilmente disponible, dio un impulso importante al uso de terminales remotos de baja velocidad como el Teletype Model 33 ASR y KSR, y el IBM 2741. AT&T redujo los costos de módem al introducir los módems 113D de solo origen y el 113B/C de solo respuesta. \nAcoplador acústico\nVéase también:\nDurante muchos años, el sistema Bell  (AT&T) mantuvo un monopolio en el uso de sus líneas telefónicas y de los dispositivos que podían estar conectados a ellas. Sin embargo, en la decisión fundamental de 1968 de la FCC sobre Carterfone (Carterfone Decision), la FCC concluyó que los dispositivos electrónicos podían conectarse al sistema telefónico siempre y cuando usaran un acoplador acústico. Dado que la mayoría de los teléfonos eran suministrados por Western Electric y, que por lo tanto tenían un diseño estándar, los acopladores acústicos fueron relativamente fáciles de construir. Los módems de 300 bit/s compatibles con Bell 103A acoplados acústicamente fueron comunes durante los años 1970. Los modelos más conocidos eran el Novation CAT  y el Anderson-Jacobson,  el último derivado de un proyecto interno en el Stanford Research Institute (ahora  SRI International). Una opción aún más económica era el módem Pennywhistle, diseñado para ser construido con piezas de chatarra electrónica y de excedentes de tiendas.\nEn diciembre de 1972, Vadic lanzó el VA3400, notable para la operación de dúplex completo a 1200 bit/s a través de la red telefónica. Al igual que el 103A, utilizaba diferentes bandas de frecuencia para transmitir y recibir. En noviembre de 1976, AT&T presentó el módem 212A para competir con Vadic. Era similar en diseño, pero usaba el conjunto de frecuencias más bajas para la transmisión. También se podría usar el 212A con un módem 103A a 300 bit/s. Según Vadic, el cambio en las asignaciones de frecuencia hizo que el 212 fuese intencionalmente incompatible con el acoplamiento acústico, bloqueando así a muchos posibles fabricantes de módems. En 1977, Vadic respondió con el módem triple VA3467, un módem solo de respuesta vendido a operadores de centros de cómputo que admitían el modo de 1200 bit/s de Vadic, el modo 212A de AT&T y la operación 103A.", "subsections": []}, {"name": "Cómo funciona", "text": "El modulador emite una señal denominada portadora. Generalmente, se trata de una simple señal eléctrica sinusoidal de mucha mayor frecuencia que la señal moduladora. La señal moduladora constituye la información que se prepara para una transmisión (un módem prepara la información para ser transmitida, pero no realiza la transmisión). La moduladora modifica alguna característica de la portadora (que es la acción de modular), de manera que se obtiene una señal, que incluye la información de la moduladora. Así el demodulador puede recuperar la señal moduladora original, quitando la portadora. Las características que se pueden modificar de la señal portadora son:\namplitud, lo que da lugar a una modulación de la amplitud (AM/ASK);\nfrecuencia, lo que da lugar a una modulación de la frecuencia (FM/FSK);\nfase, lo que da lugar a una modulación de la fase (PM/PSK).\nTambién es posible una combinación de modulaciones o modulaciones más complejas, como la modulación de amplitud en cuadratura.", "subsections": []}, {"name": "Módems para PC", "text": "La distinción más común es la que suele hacerse entre módems internos y módems externos, aunque han aparecido módems llamados módems software, más conocidos como winmódems o linuxmódems, que han vuelto complejo el panorama. También existen los módems para XDSL, RDSI, y los que se usan para conectarse a través de cable coaxial de 75 ohms (cablemódems).\nInternos: consisten en una tarjeta de expansión sobre la cual están dispuestos los diferentes componentes que forman el módem. Existen para diversos tipos de conector:\nBus ISA: debido a las bajas velocidades que se manejan en estos aparatos, durante muchos años se utilizó en exclusiva este conector, hoy en día en desuso (obsoleto).\nBus PCI: el formato más común en la actualidad, todavía en uso.\nAMR: en algunas placas; económicos pero poco recomendables por su bajo rendimiento. Hoy es una tecnología obsoleta.\nExternos: semejantes a los anteriores, pero externos al ordenador o PDA. La ventaja de estos módems reside en su fácil portabilidad entre ordenadores previamente distintos entre ellos (algunos de ellos más fácilmente transportables y pequeños que otros), además de que es posible saber el estado del módem (marcando, con/sin línea, transmitiendo...) mediante los ledes de estado que incorporan. Por el contrario, ocupan más espacio que los internos.", "subsections": []}, {"name": "Tipos de conexión", "text": "La conexión de los módems telefónicos externos al computador se realiza generalmente mediante uno de los puertos serie tradicionales o RS-232 (COM), por lo que se usa la UART del ordenador, que deberá ser capaz de proporcionar la suficiente velocidad de comunicación. La UART debe ser de 16550 o superior para que el rendimiento de un módem de 28 800 bit/s o más sea el adecuado. Estos módems necesitan un enchufe para su transformador.\nLos módems PC Card (internos) tienen forma de tarjeta, que se utilizaban en portátiles, antes de la llegada del USB (PCMCIA). Su tamaño es similar al de una tarjeta de crédito algo más gruesa, pero sus capacidades son las mismas que los modelos estándares.\nExisten modelos para puerto USB (módem USB), de conexión y configuración aún más sencillas, que no necesitan toma de corriente. Hay modelos tanto para conexión mediante telefonía fija, como para telefonía móvil.\nLos módems por software HSP (Host Signal Processor) o winmódems: son módems generalmente internos, en los cuales se han eliminado varias piezas electrónicas (por ejemplo, chips especializados), de manera que el microprocesador de la computadora debe suplir su función mediante un programa informático. Lo normal es que utilicen como conexión una ranura PCI (o una AMR), aunque no todos los módems PCI son de este tipo. El uso de la CPU entorpece el funcionamiento del resto de aplicaciones del usuario. Además, la necesidad de disponer del programa puede imposibilitar su uso con sistemas operativos no soportados por el fabricante, de manera que, por ejemplo, si el fabricante desaparece, el módem quedaría eventualmente inutilizado ante una futura actualización del sistema. A pesar de su bajo coste, resultan poco o nada recomendables.\nMódem completo: los módems clásicos no HSP, bien sean internos o externos. En ellos, el rendimiento depende casi exclusivamente de la velocidad del módem y de la UART del ordenador, no del microprocesador.", "subsections": []}, {"name": "Módems telefónicos", "text": "Su uso más común y conocido es en transmisiones de datos por vía telefónica. \nLas computadoras procesan datos de forma digital; sin embargo, las líneas telefónicas de la red básica solo transmiten señales analógicas.\nLos métodos de modulación y otras características de los módems telefónicos están estandarizados por el UIT-T (el antiguo CCITT) en la serie de Recomendaciones \"V\". Estas Recomendaciones también determinan la velocidad de transmisión. Destacan:\nV.21. Comunicación Full Dúplex entre dos módems analógicos realizando una variación en la frecuencia de la portadora de un rango de 300 baudios, logrando una transferencia de hasta 300 bit/s (bits por segundo).\nV.22. Comunicación Full Dúplex entre dos módems analógicos utilizando una modulación PSK de 600 baudios para lograr una transferencia de datos de hasta 600 o 1200 bit/s.\nV.32. Transmisión a 9600 bit/s.\nV.32bis. Transmisión a 14 400 bit/s.\nV.34. Estándar de módem que permite hasta 28,8 kbit/s de transferencia de datos bidireccionales (full-dúplex), utilizando modulación en PSK.\nV.34bis. Módem construido bajo el estándar V34, permite una transferencia de datos bidireccionales de 33,6 kbit/s, utilizando la misma modulación en PSK (estándar aprobado en febrero de 1998).\nV.90. Transmisión a 56,6 kbit/s de descarga y hasta 33 600 bit/s de subida.\nV.92. Mejora sobre V.90 con compresión de datos y llamada en espera. La velocidad de subida se incrementa, pero sigue sin igualar a la de descarga.\nExisten, además, módems DSL (Digital Subscriber Line), que utilizan un espectro de frecuencias situado por encima de la banda vocal (300-3400 Hz) en líneas telefónicas o por encima de los 80 kHz ocupados en las líneas RDSI, y permiten alcanzar velocidades mucho mayores que un módem telefónico convencional. También poseen otras cualidades, como es la posibilidad de establecer una comunicación telefónica por voz al mismo tiempo que se envían y reciben datos.\nAmpliando un poco más esta evolución histórica, podemos  marcar una diferencia importante si tomamos como punto de partida los primeros módems que operaban de forma analógica, pudiendo transmitir en muy baja velocidad, llegando a través de la norma V.34 a unos 34 kbps como máximo y allí alcanza su límite.[7]​\nEn muy poco tiempo comienzan a implantarse en determinados extremos,  las primeras redes de conmutación de paquetes (universitarias, investigación, militares), con ello se gana muchísimo en la relación señal ruido y se evita una segunda conversión analógica digital, la norma V.92 fue su máximo exponente superando los 64 kbps.\nEl hecho concreto que da inicio a este nuevo cambio, es la implantación de las “Jerarquías digitales”, inicialmente Plesiócronas con PDH y hoy Sincrónicas con SDH, a través de estas nuevas tecnologías la voz, cumpliendo con los tres pasos (muestreo, cuantificación y codificación) pasa a transmitirse de forma digital, ocupando canales de 64 Kbps en accesos básicos (BRI = 128 kbps) y primarios (PRI = 2 Mbps con las tramas E1).\nAparece la tecnología RDSI (Red Digital de Servicios Integrados) que rápidamente es superada por xDSL (x Digital Subscriber Line), sobre la que nos detendremos aquí.\nEstos servicios xDSL se basan sobre todo en nuevas formas de modulación (combinando sobre todo fase y amplitud) a través de “constelaciones” de bits, basados en la capacidad de varias portadoras asociadas a la relación señal ruido de esta “última milla” que hemos mencionado anteriormente; por esta razón es que xDSL es muy dependiente de la distancia y la calidad del par de cobre que llega hasta el domicilio, cuanto mejor sea la relación señal/ruido, mayor cantidad de bits podrá transmitirse por ese par de cobre y por lo tanto mayor ancho de banda se podrá ofrecer.   Estas tecnologías xDSL son una familia (HDSL, VDSL, ADSL, etc…), de ellas, la que más empleo se termina haciendo en las redes de Telefonía a nivel domiciliario es ADSL (asynchronous DSL).   El concepto de “asíncrono o asimétrico” viene dado en virtud de emplearse dos canales para datos (y un tercero más, independiente para la voz).    De los dos canales de datos uno se emplea para “bajada” de información que suele ser de mayor capacidad y otro para “subida” de información que suele ser sensiblemente menor. Las especificaciones técnicas de esta tecnología se encuentran en la recomendación G.992.1 (G.dmt) y G992.2 (G.lite) de la ITU-T y en el estándar T1.413-1998 de la ANSI.  A continuación presentamos una imagen de su funcionamiento:", "subsections": [{"name": "Módem fax", "text": "Un módem fax permite a la computadora transmitir y recibir documentos como faxes en una línea telefónica. Un módem fax es como un módem de datos, pero está diseñado para transmitir y recibir documentos desde una máquina de fax u otro módem de fax. Algunos, pero no todos, también funcionan como módems de datos. Al igual que otros módems, estos pueden ser internos o externos. Los de tipo internos son llamados a menudo tarjetas fax.\nA principios de la década de 1990, los pequeños negocios comúnmente utilizaban computadoras con tarjetas fax/módem y software para fax  (típicamente WinFax Pro). Con el cambio de siglo, el fax/módem fue sustituido casi completamente por el correo electrónico. En caso de ser necesario enviar un fax desde una PC, existen alternativas de fax virtual en Internet. De igual forma, las máquinas de fax también fueron suplantadas por el correo electrónico.\nLos sistemas médicos continúan utilizando esta tecnología en el siglo XXI, pero muchos usuarios comunes y empresas prefieren el uso de internet de velocidad alta.[8]​"}, {"name": "Lista de velocidades de acceso telefónico", "text": "Tenga en cuenta que los valores indicados son valores máximos y los valores reales pueden ser más lento en ciertas condiciones (por ejemplo, las líneas telefónicas ruidosas).[9]​ Un baudio es un símbolo por segundo, y cada símbolo puede codificar uno o más bits de datos."}, {"name": "Tipos de modulación", "text": "Dependiendo de si el módem es digital o analógico se usa una modulación de la misma naturaleza. Para una modulación digital se tienen, por ejemplo, los siguientes tipos de modulación:\nASK, (Amplitude Shift Keying, modulación por desplazamiento de amplitud): La amplitud de la portadora se modula a niveles correspondientes a los dígitos binarios de entrada 1 o 0.\nFSK, (Frecuency Shift Keying, modulación por desplazamiento de frecuencia): La frecuencia portadora se modula sumándole o restándole una frecuencia de desplazamiento que representa los dígitos binarios 1 o 0. Es el tipo de modulación común en módems de baja velocidad en la que los dos estados de la señal binaria se transmiten como dos frecuencias distintas.\nPSK, (Phase Shift Keying, modulación por desplazamiento de fase): tipo de modulación donde la portadora transmitida se desplaza cierto número de grados en respuesta a la configuración de los datos. Los módems bifásicos por ejemplo, emplean desplazamientos de 180° para representar el dígito binario 0.\nSin embargo, en el canal telefónico también existen perturbaciones que el módem debe enfrentar para poder transmitir la información. Estos trastornos se pueden enumerar en: distorsiones, deformaciones y ecos; ruidos aleatorios e impulsivos y, por último, las interferencias.\nPara una modulación analógica se tienen, por ejemplo, los siguientes tipos de modulación:\nAM Amplitud Modulada: La amplitud de la portadora se varía por medio de la amplitud de la moduladora.\nFM Frecuencia Modulada: La frecuencia de la portadora se varía por medio de la amplitud de la moduladora.\nPM Phase Modulation. Modulación de fase: en este caso el parámetro que se varía de la portadora es la fase de la señal, matemáticamente es casi idéntica a la modulación en frecuencia. Igualmente que en AM y FM, es la amplitud de la moduladora lo que se emplea para afectar a la portadora."}, {"name": "Órdenes AT", "text": "Órdenes de comunicación\nATA: con esta orden el módem queda en espera de una llamada telefónica, y se comporta como un receptor (autoanswer).\nCada módem utiliza una serie de órdenes \"AT\" comunes y otras específicas. Por ello, se deberá hacer uso de los manuales que acompañan al módem para configurarlo adecuadamente."}, {"name": "Registros", "text": "Los registros o registros S son porciones de memoria donde se pueden guardar permanentemente parámetros que definen el perfil del módem (profiles). Además de las órdenes \"AT\", se dispone de esta serie de registros que permiten al usuario la modificación de otras características de su funcionamiento. Al igual que ocurre con las órdenes \"AT\", existen registros comunes y otros específicos del módem. Se enumeraran los más comunes.\nRegistro 0: número de llamadas que el módem espera antes de responder (autoanswer). Si su valor es 0, el módem nunca responderá a las llamadas.\nRegistro 1: contabilizador de llamadas realizadas / recibidas.\nRegistro 2: código del carácter que se utiliza para activar la secuencia de escape. Suele ser un +.\nRegistro 3: código del carácter de fin de línea. Suele ser un 13 (enter).\nRegistro 4: código de carácter de avance de línea, (line feed).\nRegistro 5: código de carácter de borrado con retroceso (backspace).\nRegistro 6: tiempo de espera antes de empezar a marcar (s).\nRegistro 7: tiempo de espera para recibir portadora (s).\nRegistro 8: tiempo asignado a la pausa del Hayes (la coma en s).\nRegistro 9: tiempo de respuesta a la detección de portadora, para activar la DCD (en décimas de segundo).\nRegistro 10: tiempo máximo de pérdida de portadora para cortar la línea. Aumentando su valor permite al remoto cortar temporalmente la conexión sin que el módem local inicie la secuencia de desconexión. Si es 255, se asume que siempre hay portadora. Este tiempo debe ser mayor que el del registro 9 (en décimas de segundo).\nRegistro 12: determina el guard time; este es el tiempo mínimo que precede y sigue a un código de escape (+++), sin que se hayan transmitido o recibido datos. Si es 0, no hay límite de tiempo (S12 x 20 ms).\nRegistro 18: contiene la duración de los tests.\nRegistro 25: tiempo para que el módem considere que la señal de DTR ha cambiado.\nRegistro 26: tiempo de respuesta de la señal CTS ante RTS."}, {"name": "Perfiles de funcionamiento", "text": "Existen tres tipos de perfil para funcionamiento de los módems:\nel de fábrica (por defecto o predeterminado);\nel activo;\nel del usuario.\nEstos perfiles están guardados en su NVRAM, y el perfil de fábrica está guardado en ROM.\nHay dos opciones o lugares de memoria donde se pueden grabar los perfiles:\nAT&Y0, (al encender se carga el perfil = 0)\nAT&Y1, (al encender se carga el perfil = 1)\nEstas órdenes se envían antes de apagar el módem, para que los cargue en su próximo encendido.\nCuando se escriben las órdenes \"AT\", en función del tamaño del buffer del módem, se pueden ir concatenando sin necesidad de escribir para cada uno de ellos el prefijo \"AT\". De esta forma, por ejemplo, cuando en un programa se pide una secuencia de inicialización del módem, se pueden incluir conjuntamente en una sola línea todas las órdenes necesarias para configurar el módem."}, {"name": "Pasos o procesos para establecer comunicación a través del módem", "text": "Detección del tono de línea. El módem dispone de un detector del tono de línea. Este se activa si dicho tono permanece por más de un segundo. De no ser así, sea porque ha pasado un segundo sin detectar nada o no se ha mantenido activado ese tiempo el tono, envía a la computadora el mensaje \"NO DIALTONE\".\nMarcación del número. Si no se indica el modo de llamada, primero se intenta llamar con tonos y si el detector de tonos sigue activo, se pasa a llamar con pulsos. En el período entre cada dígito del número telefónico, el IDP (Interdigit pulse), se continua atendiendo al detector de tono. Si en algún IDP el detector se activa, la llamada se termina y se retorna un mensaje de BUSY. Una vez terminada la marcación, se vuelve a atender al detector de tono para comprobar si hay conexión. En este caso pueden suceder varias cosas:\nRings de espera. Se detectan y contabilizan los rings que se reciban, y se comparan con el registro S1 del módem. Si se excede del valor allí contenido, se retorna al mensaje \"NO ANSWER\".\nSi hay respuesta, se activa un detector de voz/señal, la detección de la respuesta del otro módem se realiza a través del filtro de banda alta (al menos debe estar activo 2 segundos).\nSi el detector de tono fluctúa en un período de dos segundos se retorna el mensaje \"VOICE\". El mensaje \"NO ANSWER\" puede obtenerse si se produce un intervalo de silencio después de la llamada.\nEstablecer el enlace. Implica una secuencia de procesos que dependen si se está llamando o si se recibe la llamada.\nSi se está llamando, será:\nFijar la recepción de datos a 1.\nSeleccionar el modo de baja velocidad.\nActivar 0'6 segundos el tono de llamada y esperar señal de línea.\nDesactivar señal de tono\nSeleccionar modo de alta velocidad.\nEsperar a recibir unos, después transmitir unos y activar la transmisión\nAnalizar los datos recibidos para comprobar que hay conexión. Si ésta no se consigue en el tiempo límite fijado en el registro S7, se da el mensaje \"NO CARRIER\"; en caso contrario, se dejan de enviar unos, se activa la señal de conexión, se desbloquea la recepción de datos y se da el mensaje \"CARRIER\".\nSi se está recibiendo, será:\nSelección del modo respuesta.\nDesactivar el scrambler.\nSeleccionar el modo de baja velocidad y activar el tono de respuesta (p. ej. 2400 Hz durante 3.3 s).\nDesactivar el transmisor.\nEsperar portadora, si no se recibe activar el transmisor, el modo de alta velocidad y el tono a 1800 Hz.\nEsperar el tiempo indicado en S7, si no hay conexión envía el mensaje \"NO CARRIER\", si la hay, indica \"CONNECT\", se activa el transmisor, el detector de portadora y la señal de conexión.\nEn resumen, los pasos para establecimiento de una conexión son:\nLa terminal levanta la línea DTR.\nSe envía desde la terminal la orden ATDT 5551234 (\"AT\" -> atención, D -> marcar, T -> por tonos, 5551234 -> número a llamar.)\nEl módem levanta la línea y marca el número.\nEl módem realiza el hand shaking con el módem remoto.\nEl programa de comunicación espera el código de resultado.\nCódigo de resultado \"CONNECT\"."}]}, {"name": "Test en módems Hayes", "text": "Los tests permiten verificar el módem local, la terminal local, el módem remoto y la línea de comunicaciones. Con el registro del módem S18 se indica el tiempo de duración de los tests. Si su contenido es 0, no hay límite de tiempo y es el usuario el que debe finalizar las pruebas con la orden AT&T0. El módem al encenderse realiza una serie de exámenes internos. En caso de surgir algún error, se le indicará al DTE oportunamente.\nLos tests que pueden realizarse son:\nLocal analog loopback (bucle local analógico): se ejecuta con &T1. Comprueba la conexión entre el módem y el terminal local. Tras introducir AT&T1, pasados unos segundos, se entra en modo en línea. Para realizar el test debe estar activado el eco local. La ejecución correcta del test implica que todo carácter digitado por el usuario aparecerá duplicado. Para terminar el test, se pulsa la secuencia de escape y después AT&T0. Si el test se inicia estando ya conectado a un servicio, esta conexión se corta.\nLocal Digital Loopback (bucle local digital): se ejecuta con &T3. Solo puede realizarse durante una conexión con un módem remoto. Comprueba la conexión entre el módem local y el remoto, y el circuito de línea. Envía al módem remoto las cadenas que reciba de él.\nRemote Digital Loopback (bucle digital remoto): se ejecuta con &T6. Comprueba el terminal local, el módem local, el módem remoto y el circuito de línea. Debe realizarse durante una conexión, y el módem remoto puede o debe aceptar la petición del test. Para finalizarlo se pasa a modo de órdenes con la secuencia de escape y se teclea AT&T0. El terminal local compara la cadena recibida con la transmitida por él previamente. Las cadenas son proporcionadas por el usuario.\nRemote Digital Loopback with Selftest (bucle digital remoto con autotest): se ejecuta con &T7. Comprueba el módem local, el remoto, y el circuito de línea. Debe realizarse durante una conexión y para finalizarlo hay que indicar la secuencia de escape y AT&T0. Se genera un patrón binario, según la recomendación V.54 del CCITT, para comprobar la conexión. Al finalizar el test se indica el número de errores aparecidos, (de 000 a 255).\nLocal Analog Loopback with Selftest (bucle analógico local con autotest): se ejecuta con &T8. Comprueba el módem local. Tras iniciarse el test, pasados unos segundos, se retorna al modo de órdenes. Se finaliza con &T0 o si se alcanza el tiempo límite definido en S18. El test comprueba los circuitos de transmisión y recepción del módem. Se utiliza un patrón binario, según la recomendación CCITT V.54. Si está conectado con algún servicio, la conexión se corta. Al finalizar el test se retorna el número de errores, (000 a 255).", "subsections": []}, {"name": "Protocolos de comprobación de errores", "text": "El control de errores son varias técnicas mediante las cuales se chequea la fiabilidad de los bloques de datos o de los caracteres.\nParidad: función donde el transmisor añade otro bit a los que codifican un símbolo. Es paridad par, cuando el símbolo tenga un número par de bits y es impar en caso contrario. El receptor recalcula el número de par de bits con valor uno, y si el valor recalculado coincide con el bit de paridad enviado, acepta el paquete. De esta forma se detectan errores de un solo bit en los símbolos transmitidos, pero no errores múltiples.\nCRC (Cyclic Redundancy Check, prueba de redundancia cíclica): esta técnica de detección de error consiste en un algoritmo cíclico en el cual cada bloque o trama de datos es chequeada por el módem que envía y por el que recibe. El módem que está enviando inserta el resultado de su cálculo en cada bloque en forma de código CRC. Por su parte, el módem que está recibiendo compara el resultado con el código CRC recibido y responde con un reconocimiento positivo o negativo dependiendo del resultado.\nMNP (Microcom Networking Protocol, protocolo de red Microcom): es un control de error desarrollado por Microcom, Inc. Este protocolo asegura transmisiones libres de error por medio de una detección de error, (CRC) y retransmisión de tramas equivocadas.", "subsections": []}, {"name": "Protocolos de transferencia de archivos", "text": "Xmodem: es el protocolo más popular, pero lentamente está siendo reemplazado por protocolos más fiables y más rápidos. Xmodem envía archivos en bloques de 128 caracteres al mismo tiempo. Cuando el computador que está recibiendo comprueba que el bloque ha llegado intacto, lo señala así y espera el bloque siguiente. El chequeo de error es un checksum o un chequeo más sofisticado de redundancia cíclica. Algunas comunicaciones por software soportan ambas y podrían automáticamente usar la más indicada para un momento dado. Durante una descarga, el software tiende a usar el CRC, pero se cambiará a checksum si se detecta que el host no soporta el CRC. El protocolo de Xmodem también necesita tener declarado en su configuración: no paridad, ocho bits de datos y un bit de parada.\nXmodem-1k: es una pequeña variante del anterior que usa bloques que posen un kilobyte (1024 bytes) de tamaño. Este protocolo suele llamarse todavía ‘Ymodem’ en algunos programas, lo cual es incorrecto.\nXmodem-1k-g: es una variante del anterior para canales libres de error tales como corrección de errores por hardware o líneas de cable null-módem entre dos computadoras. Logra mayor velocidad enviando bloques uno tras otro sin tener que esperar el reconocimiento desde el receptor. Sin embargo, no puede retransmitir los bloques en caso de errores. En caso de que un error sea detectado en el receptor, la transferencia será abortada. Al igual que el anterior, muchas veces es mal llamado ‘Ymodem-g’.\nZmodem: este avanzado protocolo es muy rápido al igual que garantiza una buena fiabilidad y ofrece varias características. Zmodem usa paquetes de 1 kb en una línea limpia, pero puede reducir el tamaño del paquete según si la calidad de la línea va deteriorándose. Una vez que la calidad de la línea es recuperada el tamaño del paquete se incrementa nuevamente. Zmodem puede transferir un grupo de archivos en un lote (batch) y guardar exactamente el tamaño y la fecha de los archivos. También puede detectar y recuperar rápidamente errores, y puede resumir e interrumpir transferencias en un período más tarde. Igualmente es muy bueno para enlaces satelitales y redes de paquetes conmutadas.\nASCII: en una transferencia ASCII, es como que si el que envía estuviera actualmente digitando los caracteres y el receptor grabándolos ahora. No se utiliza ninguna forma de detección de error. Usualmente, solo los archivos ASCII pueden ser enviados de esta forma, es decir, como archivos binarios que contienen caracteres.\nYmodem: este protocolo es una variante del Xmodem, el cual permite que múltiples archivos sean enviados en una transferencia. A lo largo de ella, se guarda el nombre correcto, tamaño, y fecha del archivo. Puede usar 128 o (más comúnmente), 1024 bytes para los bloques.\nYmodem-g: este protocolo es una variante del anterior, el cual alcanza una tasa de transferencia muy alta, enviando bloques uno tras otro sin esperar por un reconocimiento. Esto, sin embargo, significa que si un error es detectado por el receptor, la transferencia será abortada.\nTelink: este protocolo se encuentra principalmente en Fido Bulletin Board Systems. Es básicamente el protocolo Xmodem usando CRC para chequear y un bloque extra enviado como cabecera del archivo que dice su nombre, tamaño y fecha. Por su parte, también permite que más de un archivo sea enviado al mismo tiempo (Fido es una BBS muy popular, que se utiliza en todo el mundo).\nKermit: este protocolo fue desarrollado para facilitar el intercambio de archivos entre los diferentes tipos de computadoras. Casi ninguna computadora que usa Kermit puede ser configurada para enviar archivos a otra computadora que también use Kermit. Kermit usa pequeños paquetes (usualmente de 94 bytes) y, aunque es fiable, es lento porque la relación del protocolo de datos para usarlos es más alta que en muchos otros protocolos.", "subsections": []}, {"name": "Véase también", "text": "Agere Systems\nBanda Ancha Móvil\nDashboard (software)\nIntel High Definition Audio (HDA)\nInterfaz\nMódem USB\nPCI-Express\nRouter\nRouter ADSL\nRS-232\nTethering\nUSB\nWi-Fi\nWifi móvil", "subsections": []}, {"name": "Referencias", "text": "↑  Real Academia Española. «módem  : Aparato que convierte las señales digitales en analógicas y viceversa, y que permite la comunicación entre dos computadoras a través de una línea telefónica o de un cable.». Diccionario de la lengua española (23.ª edición). Consultado el 20 de abril de 2019.  \n↑  Real Academia Española. «módem  : Del ingl. modem, acrón. de modulator 'modulador' y demodulator 'demodulador'.». Diccionario de la lengua española (23.ª edición). Consultado el 20 de abril de 2019.  \n↑ inventors, Mary Bellis Mary Bellis wrote on the topics of; Years, Inventions for 18; Producer, Was a Film; director. «Where Did the Modem Come From?». ThoughtCo. Consultado el 12 de diciembre de 2018. \n↑ «Modem entry». Archivado desde el original el 11 de julio de 2014. \n↑ Internet, Tamsin Oxford 2009-12-26T11:00:00 359Z. «Getting connected: a history of modems». TechRadar (en inglés británico). Consultado el 12 de diciembre de 2018. \n↑ «Bell 103 modem - Semantic Scholar». www.semanticscholar.org (en inglés). Consultado el 12 de diciembre de 2018. \n↑ Corletti Estrada, Alejandro (2016). Seguridad en Redes (Primera edición). Madrid: Moralzarzal. pp. 18-24. ISBN 978-84-617-5291-1. Archivado desde el original el 3 de mayo de 2017. Consultado el 24 de octubre de 2016. \n↑ «A Brief History of Faxing for tbhe Tech Enthusiast». eFax. 11 de febrero de 2014. Consultado el 15 de julio de 2024. \n↑ Data communication over the telephone network (en inglés)\n↑ blogspot.com - baudline signal analyzer\n↑ a b c d e f g tldp.org - 29.2 Historical Modem Protocols\n↑ concordia.ca - Data Communication and Computer Networks\n↑ garretwilson.com - Group 3 Facsimile Communication\n↑ upatras.gr - Implementation of a V.34 modem on a Digital Signal Processor\n↑ About bonding modems Archivado el 10 de diciembre de 1997 en Wayback Machine.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/MHz", "title": "Megahercio", "summary": "Un megahercio (MHz) es una unidad de medida de la frecuencia, equivale a 106 hercios (1 millón). Se utiliza muy frecuentemente como unidad de medida de la frecuencia de trabajo de un dispositivo de algo, o bien como medida de ondas.", "sections": [{"name": "Megahercios en informática", "text": "Se utilizó mucho en este campo (sobre todo entre los años 1974 y 2000) para referirse a la velocidad de procesamiento de un microprocesador, ya que la velocidad de reloj estaba en ese orden de magnitud. Sin embargo ya ocurría que el rendimiento de un MOS 6502 a 1 MHz era muy similar, incluso a veces superior, al de un Zilog Z80A a 4 MHz, y viceversa no siempre.\nEl triunfo del compatible IBM PC hizo que Intel y sus competidores en los procesadores x86 se lanzaran a una carrera por el procesador más rápido, que llegó a su límite con el Pentium IV a 3800 MHz. Recordemos que cada hercio es un ciclo por segundo, lo que significa que un procesador a 3800 MHz viene realizando tres mil ochocientos millones de operaciones por segundo que bien pueden ser suma, resta, multiplicación o división, pero actualmente es más común que se exprese en Gigahercios como 3,8 GHz dado que es su más cercano múltiplo superior. La desventaja de operar a esa frecuencia es el calentamiento del procesador, y por tanto una menor vida útil del mismo debido al encarecimiento y el desgaste continuo de la estructura interna del procesador.\nEste aumento de velocidades por parte del trabajo del microprocesador ha llevado a una práctica denominada overclocking consistente en forzar manualmente las frecuencias de serie del procesador, incrementando los valores del multiplicador del microprocesador o del FSB a través de una serie de configuraciones. Se han llegado a registrar frecuencias superiores a los 9 GHz mediante refrigeración forzada por nitrógeno líquido. En teoría, el límite físico del silicio, como material actual de integración ronda los 10 GHz aunque este sistema ya está quedando obsoleto por la salida de nuevos cpus.\nOtras componentes, como la memoria RAM o la VRAM y la unidad de procesamiento gráfico también operan a diferentes frecuencias, habitualmente también del orden de megahercios, aunque estas especificaciones técnicas eran menos anunciadas por los vendedores de ordenadores que la frecuencia del microprocesador, por su menor gancho comercial.\nYa AMD había comenzado a utilizar número que no indicaban la frecuencia del procesador, sino su rendimiento comparado, y los Power Macintosh con procesadores más lentos batían tranquilamente en rendimiento a PCs com micros tres veces más rápidos.[1]​ No obstante, el panorama cambió con el lanzamiento del AMD Athlon 64, con rendimiento muy superior al del Pentium IV pese a su menor velocidad, que forzó a Intel a responder integrando varios núcleos (curiosamente evoluciones de su anterior arquitectura Pentium III a la mitad de la velocidad punta del Pentium IV) en un mismo microprocesador. Ambos factores combinados hacen que hoy en día se viva una carrera de los núcleos donde se publicita el número de núcleos incluidos en la CPU sin detallar si son gráficos o generales, soslayando muchas veces la información sobre la velocidad.", "subsections": [{"name": "Mito del megahercio", "text": "Un error común, llamado habitualmente el «mito del megahercio» es que afirma que  un microprocesador será más rápido que otro si su frecuencia es mayor; sin embargo, esto no es necesariamente cierto. Habría que tener en cuenta más parámetros para conocer el rendimiento que se aprovecha de cada ciclo.\nAsí, por ejemplo, hay una clase de computadores de arquitectura CISC, que se caracterizan por tener un conjunto de instrucciones más complejas que las de arquitectura RISC. Las instrucciones RISC se realizan en promedio más rápido, pero las CISC son más elaboradas. Funcionando a menor frecuencia, un CISC podría ser más eficiente.\nDentro de un mismo tipo de arquitectura (por ejemplo, comparando dos procesadores x86 a una misma frecuencia, la forma de disponer los transistores, su litografía, sus elementos, sus unidades, es decir su estructura interna, así como sus instrucciones, tendrá mucha más repercusión en el rendimiento todavía que la frecuencia de reloj. A modo comparativo, un procesador de 2001 mononúcleo a 2 GHz no se le podría comparar a la eficiencia de un procesador multinúcleo del 2011 a 2 GHz. Algo parecido ocurre con los procesadores gráficos.\nLo más adecuado para medir con seguridad el rendimiento es realizar un banco de pruebas o benchmark."}]}, {"name": "Véase también", "text": "HD Radio\nRadio FM\nFrecuencia Modulada\nLongitud de onda\nPulsación\nAncho de banda", "subsections": []}, {"name": "Referencias", "text": "↑ Tony Smith (28 de febrero de 2002). «Megahertz myth : Technology» (en inglés). The Guardian. Consultado el 30 de marzo de 2016. ", "subsections": []}, {"name": "Enlaces externos", "text": " Wikcionario  tiene definiciones y otra información sobre megahercio.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/MOS_Technology_6502", "title": "MOS 6502", "summary": "El MOS 6502 o MOS Technology 6502 es un microprocesador de 8 bits diseñado por MOS Technology en 1975. Cuando fue introducido fue, con bastante diferencia, la CPU más barata con características completas de mercado, con alrededor de un sexto del precio o menos que las CPU con las que competía de compañías más grandes como Motorola e Intel. Era sin embargo más rápido que la mayoría de ellos, y, junto con el Zilog Z80, fueron la chispa de una serie de proyectos de computadores que finalmente darían lugar a la revolución del ordenador personal de finales de los 1970 y principios de los años 1980. Además de MOS Technology, el diseño del 6502 tuvo originalmente como segunda fuente a Rockwell y Synertek y fue licenciado más adelante a varias compañías más. Todavía se hace para sistemas integrados (embedded systems).\nEl 6502 consiste en realidad en una familia de CPU que comparten el chip, pero están encapsuladas con diferentes números de patillas, abaratando costes y sacrificando algunas prestaciones. Éstos a su vez se dividen en dos grupos: los 650x, con reloj interno, y los 651x, que necesitan reloj de dos fases (como el MC6800).", "sections": [{"name": "Historia y uso", "text": "El 6502 fue diseñado primariamente por el mismo equipo que había diseñado el Motorola 6800. Después de abandonar el grupo Motorola, rápidamente diseñaron el 6501, un diseño totalmente nuevo que era sin embargo compatible a nivel de pines con el 6800. Motorola les demandó inmediatamente, y aunque hoy en día el caso habría sido descartado inmediatamente, el daño a MOS fue lo bastante grande para que acordaran parar la producción de los 6501.\nApple IIe\nAtari 800XL\nCommodore VIC 20\nAtari 2600\nEl resultado fue el 6502, el cual no podría causar un litigio legal con Motorola, ya que por un diferente ordenamiento de sus patillas, era inutilizable en una tarjeta madre para el 6800. Sin embargo esto dejó a MOS Technology con el problema de conseguir nuevos desarrolladores para el sistema, así que en respuesta el ingeniero Chuck Peddle diseñó el KIM-1 una computadora en una sola placa. Para su sorpresa, el KIM-1 se vendió en cantidades enormes a los aficionados y a las personas que les gustaba experimentar, y también entre los ingenieros para los cuales fue pensado. El AIM 65, un sistema de control, entrenamiento, y desarrollo, manufacturado por Rockwell también se vendió bien. Otro diseño más o menos similar fue el Synertek Sync.", "subsections": []}, {"name": "Introduciendo al 6502", "text": "El 6502 fue lanzado al mercado en una feria tecnológica en septiembre de 1975. El precio era de US$25 ($125,9 en 2024), mientras que el 6800 y el 8080 se vendían por US$179 ($901,42 en 2024). Al principio, mucha gente pensaba que era alguna clase de fraude, pero antes de que la feria terminara, tanto Motorola como Intel habían bajado sus precios a US$79 ($397,83 en 2024). Ahora el 6502 estaba legitimado y comenzaba a venderse por cientos.\nUno de los primeros usos «públicos» para el diseño fue la videoconsola Atari 2600. Los 2600 utilizaron un descendiente del 6502 llamado 6507, que tenía menos pines y como resultado podía direccionar solamente 8 KB de memoria RAM. Millones serían vendidos en esta forma. El 6502 luego fue usado en la familia del Apple II, y entonces rápidamente apareció en varios computadores personales como el Commodore PET, Commodore VIC-20, la familia Atari de 8 bits, la familia BBC Micro, y un enorme número de otros diseños ahora perdidos en la historia. El 6510, un sucesor directo del 6502, fue la CPU usada en el extremadamente popular computador personal Commodore 64.\nOtro uso importante del 6502 fue en el Nintendo Famicom, una videoconsola japonesa. Su equivalente estadounidense y europeo, el Nintendo Entertainment System (NES), también tenía el 6502. El 6502 usado en el NES eran una versión modificada, que fue producida solamente para los Nintendo, llamada 2A03 en las consolas NTSC y 2A07 en las consolas PAL, la diferencia entre los dos era el divisor frecuencias del reloj. El procesador personalizado para el NES careció del modo decimal del 6502 pero agregó 22 registros de memoria mapeada para la generación del sonido, la lectura del joypad (control del juego) y el DMA para los sprites.\nEl eficiente diseño del 6502 también inspiró a los principales diseñadores del ARM, un procesador RISC, y así se puede decir que la herencia del 6502 ha trascendido la familia original del procesador puesto que su espíritu vive en el diseño del ARM, usado en varios computadores de escritorio así como una plétora de sistemas de mano (hanheld) y de otros empotrados (embedded), y vendido como bloque de IP para ser usado en productos tipo System on a chip.", "subsections": []}, {"name": "Descripción", "text": "El 6502, un microprocesador de 8 bits con un bus de dirección de 16 bits, fue lanzado en septiembre de 1975 por MOS Technology. La lógica interna corre a la misma velocidad que la frecuencia del reloj externo, pero las aparentemente lentas velocidades de reloj, normalmente 1 MHz, eran realmente competitivas con otras CPU corriendo cuatro veces más rápido, porque el 6502 era un procesador pipeline, y los otros de su época fueron microcodificados y tenían velocidades comparables con la del 6502. El reloj del Z80, por ejemplo, necesita 4 ciclos para leer una instrucción. Aunque esto puede sonar como un «truco», el 6502 tenía el efecto secundario de bajar los requerimientos de velocidad de los periféricos unidos a la CPU, bajando de esta manera el coste total del sistema, un importante factor para conseguir un diseño ganador en los muy sensibles mercados de las consolas de juegos y los computadores personales. Cuenta con 3510 transistores.\nA diferencia del Intel 8080 y de similares microprocesadores, el 6502 tenía muy pocos registros. En ese tiempo, la memoria RAM era más rápida que las CPU, así que tenía sentido optimizar el acceso a RAM más que aumentar el número de registros en el chip. Dentro del 6502 había un registro acumulador «A» de 8 bits, dos registros índice «X» e «Y» de 8 bits, un registro de estado «SR» de 8 bits, un puntero de pila «SP» de 8 bits, y un contador de programa «PC» de 16 bits. El espacio de dirección de la pila para llamadas a subrutinas o almacenamiento temporal estaba fijado por hardware a la página $01 de la memoria, es decir la gama de direcciones $0100-$01FF (256-511). El acceso del software a la pila se hacía mediante cuatro instrucciones con modo de direccionamiento implícito cuya función era colocar o retirar un elemento en la pila (Push o Pop). Había instrucciones Push y Pop para el contenido del acumulador o para el registro de estado del procesador.\nEl chip utilizó los registros del índice y de la pila efectivamente con varios modos de direccionamiento, incluyendo un rápido modo de «página directa» o «página cero» que accedía a posiciones de memoria de las direcciones 0 a 255 (00 a FF hexadecimal) con una sola dirección 8 bits (no tenía que leer un segundo byte para la dirección). El código para el 6502 utilizaba mucho la página cero, tanto como el código para otros procesadores habrían usado sus registros. En la mayoría de los microcomputadores basados en el 6502 con un sistema operativo, el sistema operativo en sí mismo utilizaba casi completamente la página cero, dejando quizás un puñado de localizaciones para el usuario.\nLos modos de direccionamiento también incluían:\nimplied (instrucciones de 1 byte)\nabsolute (3 bytes)\nrelative (2 bytes)\nacumulador (1 byte)\nindirect, x e indirect, y (2 bytes)\nimmediate (2 bytes)\nindexado, X e indexado, Y (2 o 3 bytes, dependiendo de que la base esté en la página cero o no)\nEl modo absoluto era un modo de uso general. El modo relativo era usado para instrucciones de bifurcación condicional que podrían mover el contador de programa hasta 128 bytes adelante o atrás. El modo acumulador usó el acumulador como una dirección efectiva, y no necesitaba ningún dato de operando. El modo inmediato utilizaba un operando literal de 8 bits.\nLos modos indirectos eran útiles para procesamiento de vectores y otras operaciones repetitivas con bucles. Con el modo indirecto, y el registro Y, de 8 bits, era agregado a una base de 16 bits localizada en la página cero de la memoria (un byte en el opcode denotaba la localización de página cero). Los registros de 8 bits X e Y eran usados como offset (desplazamiento) más que su uso 'normal' como registros índice. El incremento de X o Y para caminar por la matriz era una operación de 8 bits de dos ciclos, aunque la matriz pudiera estar situado en cualquier parte del espacio de dirección 16 bits (obteniendo la base de 16 bits leída de la página cero). Aquí es donde el 6502 se diferencia más del Motorola 6800. Un superficial vistazo en las especificaciones del 6502 mostrando que había solamente registros de índice de 8 bits es absolutamente engañoso.", "subsections": []}, {"name": "Características dudosas", "text": "Los 6502 son notorios por tener una variedad de instrucciones indocumentadas, que variaban de un diseño al siguiente. La decodificación de instrucciones en el 6502 está implementada por medio de una matriz lógica fija implementada en hardware (similar a un PLA) definido solamente para los opcodes válidos. Los aproximadamente 32 opcodes indocumentados accionan varias instrucciones válidas a la vez, conduciendo a resultados inesperados. En las versiones CMOS (65Cxx) estos códigos se ejecutan como NOP, pero de número de bytes y ciclos variables según el código.\nLa instrucción de salto indirecto del 6502, JMP (xxxx), tenía un defecto. Si la dirección era xxFF hexadecimal, el procesador no tendría acceso a la dirección almacenada en xxFF y xxFF+1, sino en xxFF y xx00. El 6510 no corrigió este error, ni fue corregido en cualquiera de las otras versiones NMOS del 6502 como el 8502 y el 2A03. Bill Mensch en Western Design Center fue el primero en corregirlo, en el derivado CMOS 65C02, pero a costa de un ciclo de reloj más. Posteriormente diseñó el procesador 65816, un sucesor de 16 bits del 65C02 como también un descendiente híbrido llamado 65802 que era un 65816 con un espacio de dirección de 64 KB y un encapsulado compatible a nivel de pines con el 65(C)02.", "subsections": []}, {"name": "Aceleración", "text": "Muchos usuarios de sistemas basados en 6502 de 1 MHz pronto deseaban que sus computadoras pudieran ir más rápidamente. Varias compañías vendieron hardware de reemplazo para acelerar esos sistemas. Generalmente, los aceleradores de los sistemas 6502 fueron basados en:\nChips 6502 o 65C02 que cuentan con una velocidad de reloj más rápida.\nChips 65C816 en modo de emulación del 6502, que cuenta con una velocidad de reloj mucho más rápida (hasta 20 MHz).\nProcesadores Zip Chip de 4 MHz y 8 MHz, hechos por Zip Technology, y Rocket Chips de 10 MHz, hechos por Bits and Pieces, todos usando caché RAM incorporado en la placa para acelerar el proceso de datos frecuentemente accesados mientras se permanecía compatible con una placa madre de 1 MHz. Finalmente, la patente n.º 4.794.523 de Zip Technology fuerza a Bits and Pieces a cesar de manufacturar el Rocket Chip.", "subsections": []}, {"name": "Familia 65xx", "text": "Véase también:", "subsections": []}, {"name": "Licenciamiento", "text": "MOS Technology licenció pronto su 65xx, entre otras, a las siguientes compañías:\nRockwell Semiconductor\nSynertek\nAMI\nITT\nUMC\nNTE", "subsections": []}, {"name": "Microcomputadores que usaron el 6502", "text": "El procesador MOS 6502 y sus variantes fueron usados, entre otros equipos, en:\nApple I, Apple II, Apple III\nCommodore PET, Commodore VIC-20\nAtari 400/800/400XL/600XL/800XL/1200XL/65XE/130XE/XG/XGS, consola Atari Lynx 1 y 2\nMOS Technology KIM-1\nOhio Superboard, Ohio Superboard II, Ohio Challenger (Ohio Scientific)\nAcorn Atom, BBC Micro, Acorn Electron\nOric 1, Oric Atmos\nNintendo Entertainment System (consola)\nPC-Engine (TurboGrafx-16) (dos CPU's 6502)", "subsections": [{"name": "Hardware que emula el MOS 6502", "text": "Existen múltiples proyectos que buscan emular el MOS 6502 y derivados a nivel de software, así como también a nivel de hardware. Entre los proyectos que implementan/emulan un MOS 6502 a nivel de hardware:\nMOnSter 6502, una placa que implementa la parte \"funcional \" de un MOS 6502 sobre una placa compuesta por transistores y resistencias y luces LED visibles. El nombre \"monster\" hace referencia al tamaño de la placa, de 30 x 38 cm.[1]​\nGigatron TTL, una microcomputadora de estilo retro, que, entre sus características, es la capacidad de emular el MOS 6502.\nEn Minecraft, fue posible implementar una computadora completa basada en el MOS6502 gracias al mod RedPower 2.[2]​[3]​"}]}, {"name": "Véase también", "text": "MOS 6501\nMOS 6510\nW65C02\nOtros microprocesadores de la época\nIntel 8080\nIntel 8085\nZilog Z80\nMotorola 6800\nComputadores prototipo y para experimentación\nKIM-1\nAIM 65\nSYM-1\nMicrocomputadores\nApple I\nApple II\nApple III\nCommodore PET\nCommodore VIC-20\nFamilia Atari de 8 bits", "subsections": []}, {"name": "Referencias", "text": "↑ «MOnSter 6502: El clásico procesador de 8 bits, construido a gran escala – NeoTeo». www.neoteo.com. Consultado el 14 de julio de 2022. \n↑ Toor, Amar (21 de mayo de 2012). «RedPower 2 mod brings fully emulated 6502 CPU to Minecraft». The Verge (en inglés). Consultado el 14 de julio de 2022. \n↑ By (20 de mayo de 2012). «Building A 6502 In Minecraft». Hackaday (en inglés estadounidense). Consultado el 14 de julio de 2022. ", "subsections": []}, {"name": "Enlaces externos", "text": "Esquema interno del 6502\nwww.6502.org\nSimulador para Windows\nKIM-1, esquemático\n6502 images and description at cpu-collection.de\nList of 6502 software emulators\nApple I Owners Club\n6502 accelerator information (apple2history.org)\n6502 acceleration article (C=Hacking)\n[1]", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Memoria_de_acceso_aleatorio", "title": "Memoria de acceso aleatorio", "summary": "Busca fuentes: «Memoria de acceso aleatorio» – noticias · libros · académico · imágenes\nLa memoria de acceso aleatorio (Random Access Memory, RAM) es una memoria de almacenaje a corto plazo. El sistema operativo de ordenadores u otros dispositivos utiliza la memoria RAM para guardar de forma temporal todos los programas y sus procesos de ejecución.[1]​ En la RAM se cargan todas las instrucciones que ejecuta la unidad central de procesamiento (CPU) y otras unidades del ordenador, además de contener los datos que manipulan los distintos programas.\nSe llama «de acceso aleatorio» porque se puede leer o escribir en una posición de memoria con igual tiempo de espera para cualquier posición, no requiriendo un orden para acceder (acceso secuencial) a la información de la manera más rápida posible.\nDurante el encendido de la computadora, la rutina POST verifica que los módulos de RAM estén bien conectados. En el caso de que no existan o no se los detecte, la mayoría de las placas base emiten sonidos que indican la ausencia de la memoria principal. Terminado ese proceso, la memoria BIOS puede realizar un test básico de la RAM indicando fallos mayores en ella.", "sections": [{"name": "Historia", "text": "Uno de los primeros tipos de memoria RAM fue la memoria de núcleo magnético, desarrollada entre 1949 y 1952 y usada en muchos computadores hasta el desarrollo de circuitos integrados a finales de los años 60 y principios de los 70. Esa memoria requería que cada bit estuviera almacenado en un toroide de material ferromagnético de algunos milímetros de diámetro, lo que resultaba en dispositivos con una capacidad de memoria muy pequeña. Antes que eso, las computadoras usaban relés y líneas de retardo de varios tipos construidas para implementar las funciones de memoria principal con o sin acceso aleatorio.\nEn 1969 fueron lanzadas una de las primeras memorias RAM basadas en semiconductores de silicio por parte de Intel con el integrado 3101 de 64 bits de memoria y para el siguiente año se presentó una memoria DRAM de 1024 bits, referencia 1103 que se constituyó en un hito, ya que fue la primera en ser comercializada con éxito, lo que significó el principio del fin para las memorias de núcleo magnético. En comparación con los integrados de memoria DRAM actuales, la 1103 es primitiva en varios aspectos, pero tenía un desempeño mayor que la memoria de núcleos.\nEn 1973 se presentó una innovación que permitió otra miniaturización y se convirtió en estándar para las memorias DRAM: la multiplexación en tiempo de la direcciones de memoria. MOSTEK lanzó la referencia MK4096 de 4096 bytes en un empaque de 16 pines,[2]​ mientras sus competidores las fabricaban en el empaque DIP de 22 pines. El esquema de direccionamiento[3]​ se convirtió en un estándar de facto debido a la gran popularidad que logró esta referencia de DRAM.\nPara finales de los 70 los integrados eran usados en la mayoría de computadores nuevos, se soldaban directamente a las placas base o se instalaban en zócalos, de modo que ocupaban un área extensa de circuito impreso. Luego se hizo obvio que instalar la RAM en el impreso principal impedía miniaturizar, entonces se idearon los primeros módulos de memoria como el SIPP, usando las ventajas de la construcción modular. El formato SIMM fue una mejora al anterior. Eliminó los pines metálicos y dejó áreas de cobre en uno de los bordes del impreso, muy similares a los de las tarjetas de expansión, de hecho los módulos SIPP y los primeros SIMM tienen igual distribución de pines.\nA fines de los 80 el aumento de velocidad de los procesadores y el aumento en el ancho de banda requerido, dejaron atrás a las memorias DRAM con el esquema original MOSTEK, de manera que se realizaron mejoras en el direccionamiento como las siguientes:", "subsections": [{"name": "FPM RAM", "text": "Fast Page Mode RAM (FPM-RAM) fue inspirado en técnicas como el Burst Mode usado en procesadores como el Intel 486.[4]​ Se implantó un modo direccionador en el que el controlador de memoria envía una sola dirección y recibe a cambio esa y varias consecutivas sin necesidad de generar todas. Esto ahorra tiempos, ya que ciertas operaciones son repetitivas al querer acceder a muchas posiciones seguidas. Es como si deseáramos visitar todas las casas en una calle: tras la primera vez no sería necesario decir el número de la calle, sino sólo seguir la misma. Se fabricaban con tiempos de acceso de 70 o 60 ns y fueron muy populares en sistemas basados en el 486 y primeros Pentium."}, {"name": "EDO RAM", "text": "Extended Data Output RAM (EDO-RAM) fue lanzada al mercado en 1994 y con tiempos de accesos de 40 o 30 ns suponía una mejora sobre FPM, su antecesora. La EDO, también es capaz de enviar direcciones contiguas pero direcciona la columna que va a utilizar mientras se lee la información de la columna anterior, resultando en eliminar estados de espera manteniendo activo el búfer de salida hasta que comienza el próximo ciclo de lectura."}, {"name": "BEDO RAM", "text": "Burst Extended Data Output RAM (BEDO-RAM) fue la evolución de la EDO-RAM y competidora de la SDRAM, fue presentada en 1997. Era un tipo de memoria que usaba generadores internos de direcciones y accedía a más de una posición de memoria en cada ciclo de reloj, de manera que lograba un 50 % de beneficios, mejor que la EDO. No se comerció, pues Intel y otros fabricantes se decidieron por esquemas de memoria síncronos que si bien tenían mucho del direccionamiento MOSTEK, sumaban funciones distintas como señales de reloj, entre otras."}]}, {"name": "Tipos de RAM", "text": "Las tres formas principales de RAM moderna son:\nSRAM (Static Random Access Memory), RAM estática, memoria estática de acceso aleatorio.\nvolátiles.\nno volátiles:\nNVRAM (non-volatile random access memory), memoria de acceso aleatorio no volátil\nMRAM (magnetoresistive random-access memory), memoria de acceso aleatorio magnetorresistiva o magnética\nDRAM (Dynamic Random Access Memory), RAM dinámica, memoria dinámica de acceso aleatorio.\nDRAM Asincrónica (Asynchronous Dynamic Random Access Memory), memoria de acceso aleatorio dinámica asincrónica.\nFPM RAM (Fast Page Mode RAM)\nEDO RAM (Extended Data Output RAM)\nSDRAM (Synchronous Dynamic Random-Access Memory), memoria de acceso aleatorio dinámica sincrónica\nRambus:\nRDRAM (Rambus Dynamic Random Access Memory)\nXDR DRAM (eXtreme Data Rate Dynamic Random Access Memory)\nXDR2 DRAM (eXtreme Data Rate two Dynamic Random Access Memory)\nSDR SDRAM (Single Data Rate Synchronous Dynamic Random-Access Memory, SDRAM de tasa de datos simple)\nDDR SDRAM (Double Data Rate Synchronous Dynamic Random-Access Memory, SDRAM de tasa de datos doble)\nDDR2 SDRAM (Double Data Rate type two SDRAM, SDRAM de tasa de datos doble de tipo dos)\nDDR3 SDRAM (Double Data Rate type three SDRAM, SDRAM de tasa de datos doble de tipo tres)\nDDR4 SDRAM (Double Data Rate type four SDRAM, SDRAM de tasa de datos doble de tipo cuatro).\nDDR5 SDRAM (Double Data Rate type five SDRAM, SDRAM de tasa de datos doble de tipo cinco).\n VRAM (Video Ramdom Access Memory) memoria gráfica de acceso aleatorio es un tipo de memoria RAM que utiliza el controlador gráfico para poder manejar toda la información visual que le envía la CPU del sistema. La principal característica de esta clase de memoria es que es accesible de forma simultánea por dos dispositivos. De esta manera, es posible que la CPU grabe información en ella, mientras se leen los datos que serán visualizados en el monitor en cada momento.Por esta razón también se clasifica como Dual-Ported. En un principio ( procesadores de 8 bits) e llamaba así a la memoria solo accesible directamente por el procesador gráfico, debiendo la CPU cargar los datos a través de él. Podía darse el caso de equipos con más memoria VRAM que RAM (como algunos modelos japoneses de MSX2 , que contaban con 64 KiB de RAM y 128 KiB de VRAM). Tipos de VRAM:\nSONIC (serial s memory): el módulo SAM (usualmente en la forma de un registro linear) no es cambiado por los cálculos y contiene los datos que van a ser utilizados por el RAMDAC. Esto lo convierte en memoria secuencial, que al contrario de la RAM de datos solo puede ser evaluada sucesivamente (de un modo similar a una casete. La SAM puede seleccionarse mucho más rápidamente que la RAM, pues en principio no necesita cálculos de direccionamiento.", "subsections": []}, {"name": "Nomenclatura", "text": "La expresión memoria RAM se utiliza frecuentemente para describir a los módulos de memoria utilizados en las computadoras personales y servidores.\nLa RAM es solo una variedad de la memoria de acceso aleatorio: las ROM, memorias Flash, caché (SRAM), los registros en procesadores y otras unidades de procesamiento también poseen la cualidad de presentar retardos de acceso iguales para cualquier posición.\nLos módulos de RAM son la presentación comercial de este tipo de memoria, que se compone de circuitos integrados soldados sobre un circuito impreso independiente, en otros dispositivos como las consolas de videojuegos, la RAM va soldada directamente sobre la placa principal.", "subsections": []}, {"name": "Módulos de RAM", "text": "Los módulos de RAM son tarjetas o placas de circuito impreso que tienen soldados chips de memoria DRAM, por una o ambas caras.\nLa implementación DRAM se basa en una topología de circuito eléctrico que permite alcanzar densidades altas de memoria por cantidad de transistores, logrando integrados de cientos o miles de megabits. Además de DRAM, los módulos poseen un integrado que permiten la identificación de los mismos ante la computadora por medio del protocolo de comunicación Serial Presence Detect (SPD).\nLa conexión con los demás componentes se realiza por medio de un área de pines en uno de los filos del circuito impreso, que permiten que el módulo al ser instalado en un zócalo o ranura apropiada de la placa base, tenga buen contacto eléctrico con los controladores de memoria y las fuentes de alimentación.\nLa necesidad de hacer intercambiable los módulos, y de utilizar integrados de distintos fabricantes, condujo al establecimiento de estándares de la industria como los Joint Electron Device Engineering Council (JEDEC).\nPaquete DIP (Dual In-line Package, paquete de pines en-línea doble).\nPaquete SIPP (Single In-line Pin Package, paquete de pines en-línea simple): fueron los primeros módulos comerciales de memoria, de formato propietario, es decir, no había un estándar entre distintas marcas.\nMódulos RIMM (Rambus In-line Memory Module, módulo de memoria en-línea rambus): Fueron otros módulos propietarios bastante conocidos, ideados por la empresa RAMBUS.\nMódulos SIMM (Single In-line Memory Module, módulo de memoria en-línea simple): formato usado en computadoras antiguas. Tenían un bus de datos de 16 o 32 bits.\nMódulos DIMM (Dual In-line Memory Module, módulo de memoria en-línea dual): usado en computadoras de escritorio. Se caracterizan por tener un bus de datos de 64 bits.\nMódulos SO-DIMM (Small Outline DIMM): usado en computadoras portátiles. Formato miniaturizado de DIMM.\nMódulos FB-DIMM (Fully-Buffered Dual Inline Memory Module): usado en servidores.", "subsections": []}, {"name": "Tecnologías de memoria", "text": "La tecnología de memoria actual usa una señal de sincronización para realizar las funciones de lectura/escritura de manera que siempre está sincronizada con un reloj del bus de memoria, a diferencia de las antiguas memorias FPM y EDO que eran asíncronas.\nToda la industria se decantó por las tecnologías síncronas, porque permiten construir integrados que funcionen a una frecuencia superior a 66 MHz.\nTipos de DIMM según su cantidad de contactos o pines:", "subsections": [{"name": "SDR SDRAM", "text": "Artículo principal:\nMemoria síncrona, con tiempos de acceso de entre 25 y 10 ns y que se presentan en módulos DIMM de 168 contactos. Fue utilizada en los Pentium II y en los Pentium III, así como en los AMD K6, AMD Athlon K7 y Duron.\nEstá muy extendida la creencia de que se llama SDRAM a secas, y que la denominación SDR SDRAM es para diferenciarla de la memoria DDR, pero no es así, simplemente se extendió muy rápido la denominación incorrecta. El nombre correcto es SDR SDRAM ya que ambas (tanto la SDR como la DDR) son memorias síncronas dinámicas. Los tipos disponibles son:\nPC66: SDR SDRAM, funciona a un máx de 66,6 MHz.\nPC100: SDR SDRAM, funciona a un máx de 100 MHz.\nPC133: SDR SDRAM, funciona a un máx de 133,3 MHz."}, {"name": "RDRAM", "text": "Se presentan en módulos RIMM de 184 contactos. Fue utilizada en los Pentium 4.\nEra la memoria más rápida en su tiempo, pero por su elevado costo fue rápidamente cambiada por la económica DDR.\nLos tipos disponibles son:\nPC600: RIMM RDRAM, funciona a un máximo de 300 MHz.\nPC700: RIMM RDRAM, funciona a un máximo de 350 MHz.\nPC800: RIMM RDRAM, funciona a un máximo de 400 MHz.\nPC1066: RIMM RDRAM, funciona a un máximo de 533 MHz.\nPC1200: RIMM RDRAM, funciona a un máximo de 600 MHz."}, {"name": "DDR SDRAM", "text": "Memoria síncrona, envía los datos dos veces por cada ciclo de reloj. De este modo trabaja al doble de velocidad del bus del sistema, sin necesidad de aumentar la frecuencia de reloj. Se presenta en módulos DIMM de 184 contactos en el caso de ordenador de escritorio y en módulos de 144 contactos para los ordenadores portátiles.\nLa nomenclatura utilizada para definir a los módulos de memoria de tipo DDR (esto incluye a los formatos DDR2, DDR3 y DDR4) es la siguiente: DDRx-yyyy PCx-zzzz; donde x representa a la generación DDR en cuestión; yyyy la frecuencia aparente o efectiva, en Megaciclos por segundo (MHz); y zzzz la máxima tasa de transferencia de datos por segundo, en Megabytes, que se puede lograr entre el módulo de memoria y el controlador de memoria. La tasa de transferencia depende de dos factores, el ancho de bus de datos (por lo general 64 bits) y la frecuencia aparente o efectiva de trabajo. La fórmula que se utiliza para calcular la máxima tasa de transferencia por segundo entre el módulo de memoria y su controlador, es la siguiente:\nTasa de transferencia en MB/s = (Frecuencia DDR efectiva) × (64 bits / 8 bits por cada byte)[5]​\nPor ejemplo:\n1 GB DDR-400 PC-3200: Representa un módulo de 1 GB (Gigabyte) de tipo DDR; con frecuencia aparente o efectiva de trabajo de 400 MHz; y una tasa de transferencia de datos máxima de 3200 MB/s.\n4 GB DDR3-2133 PC3-17000: Representa un módulo de 4 GB de tipo DDR3; frecuencia aparente o efectiva de trabajo de 2133 MHz; y una tasa de transferencia de datos máxima de 17000 MB/s.\nLos tipos disponibles son:\nPC1600 o DDR 200: funciona a un máx de 200 MHz.\nPC2100 o DDR 266: funciona a un máx de 266,6 MHz.\nPC2700 o DDR 333: funciona a un máx de 333,3 MHz.\nPC3200 o DDR 400: funciona a un máx de 400 MHz.\nPC3500 o DDR 433 funciona a un máx de 433 MHz.\nPC4500 o DDR 500: funciona a una máx de 500 MHz."}, {"name": "DDR2 SDRAM", "text": "Las memorias DDR 2 son una mejora de las memorias DDR (Double Data Rate), que permiten que los búferes de entrada/salida trabajen al doble de la frecuencia del núcleo, permitiendo que durante cada ciclo de reloj se realicen cuatro transferencias. Se presentan en módulos DIMM de 240 contactos. Los tipos disponibles son:\nPC2-3200 o DDR2-400: funciona a un máx de 400 MHz.\nPC2-4200 o DDR2-533: funciona a un máx de 533,3 MHz.\nPC2-5300 o DDR2-667: funciona a un máx de 666,6 MHz.\nPC2-6400 o DDR2-800: funciona a un máx de 800 MHz.\nPC2-8600 o DDR2-1066: funciona a un máx de 1066,6 MHz.\nPC2-9000 o DDR2-1200: funciona a un máx de 1200 MHz."}, {"name": "DDR3 SDRAM", "text": "Las memorias DDR 3 son una mejora de las memorias DDR 2, proporcionan significantes mejoras en el rendimiento en niveles de bajo voltaje, lo que lleva consigo una disminución del gasto global de consumo. Los módulos DIMM DDR 3 tienen 240 pines, el mismo número que DDR 2; sin embargo, los DIMMs son físicamente incompatibles, debido a una ubicación diferente de la muesca. Los tipos disponibles son:\nPC3-6400 o DDR3-800: funciona a un máx de 800 MHz.\nPC3-8500 o DDR3-1066: funciona a un máx de 1066,6 MHz.\nPC3-10600 o DDR3-1333: funciona a un máx de 1333,3 MHz.\nPC3-12800 o DDR3-1600: funciona a un máx de 1600 MHz.\nPC3-14900 o DDR3-1866: funciona a un máx de 1866,6 MHz.\nPC3-17000 o DDR3-2133: funciona a un máx de 2133,3 MHz.\nPC3-19200 o DDR3-2400: funciona a un máx de 2400 MHz.\nPC3-21300 o DDR3-2666: funciona a un máx de 2666,6 MHz."}, {"name": "DDR4 SDRAM", "text": "PC4-1600 o DDR4-1600: funciona a un máx de 1600 MHz.\nPC4-1866 o DDR4-1866: funciona a un máx de 1866,6 MHz.\nPC4-17000 o DDR4-2133: funciona a un máx de 2133,3 MHz.\nPC4-19200 o DDR4-2400: funciona a un máx de 2400 MHz.\nPC4-25600 o DDR4-2666: funciona a un máx de 2666,6 MHz."}, {"name": "DDR5 SDRAM", "text": "PC5-4800 o DDR5-4800: funciona a un máx de 4800 MHz.\nPC5-5200 o DDR5-5200: funciona a un máx de 5200 MHz.\nPC5-5600 o DDR5-5600: funciona a un máx de 5600 MHz.\nPC5-6000 o DDR5-6000: funciona a un máx de 6000 MHz.\nPC5-6200 o DDR5-6200: funciona a un máx de 6200 MHz."}]}, {"name": "Relación con el resto del sistema", "text": "Dentro de la jerarquía de memoria, la RAM se encuentra en un nivel después de los registros del procesador y de las cachés en cuanto a velocidad.\nLos módulos de RAM se conectan eléctricamente a un controlador de memoria que gestiona las señales entrantes y salientes de los integrados DRAM. Las señales son de tres tipos: direccionamiento, datos y señales de control. En el módulo de memoria esas señales están divididas en dos buses y un conjunto misceláneo de líneas de control y alimentación. Entre todas forman el bus de memoria que conecta la RAM con su controlador:\nBus de datos: son las líneas que llevan información entre los integrados y el controlador. Por lo general, están agrupados en octetos siendo de 8, 16, 32 y 64 bits, cantidad que debe igualar el ancho del bus de datos del procesador. En el pasado, algunos formatos de módulo, no tenían un ancho de bus igual al del procesador. En ese caso había que montar módulos en pares o en situaciones extremas, de a 4 módulos, para completar lo que se denominaba banco de memoria, de otro modo el sistema no funciona. Esa fue la principal razón para aumentar el número de pines en los módulos, igualando al ancho de bus de procesadores como el Pentium a 64 bits, a principios de los años 1990.\nBus de direcciones: es un bus en el cual se colocan las direcciones de memoria a las que se requiere acceder. No es igual al bus de direcciones del resto del sistema, ya que está multiplexado de manera que la dirección se envía en dos etapas. Para ello, el controlador realiza temporizaciones y usa las líneas de control. En cada estándar de módulo se establece un tamaño máximo en bits de este bus, estableciendo un límite teórico de la capacidad máxima por módulo.\nSeñales misceláneas: entre las que están las de la alimentación (Vdd, Vss) que se encargan de entregar potencia a los integrados. Están las líneas de comunicación para el integrado de presencia (Serial Presence Detect) que sirve para identificar cada módulo. Están las líneas de control entre las que se encuentran las llamadas RAS (Row Address Strobe) y CAS (Column Address Strobe) que controlan el bus de direcciones, por último están las señales de reloj en las memorias sincrónicas SDRAM.\nAlgunos controladores de memoria en sistemas como PC y servidores se encuentran embebidos en el llamado puente norte (North Bridge) de la placa base. Otros sistemas incluyen el controlador dentro del mismo procesador (en el caso de los procesadores desde AMD Athlon 64 e Intel Core i7 y posteriores). En la mayoría de los casos el tipo de memoria que puede manejar el sistema está limitado por los sockets para RAM instalados en la placa base, a pesar de que los controladores de memoria en muchos casos son capaces de conectarse con tecnologías de memoria distintas.\nUna característica especial de algunos controladores de memoria, es el manejo de la tecnología canal doble o doble canal (Dual Channel), donde el controlador maneja bancos de memoria de 128 bits, siendo capaz de entregar los datos de manera intercalada, optando por uno u otro canal, reduciendo las latencias vistas por el procesador. La mejora en el desempeño es variable y depende de la configuración y uso del equipo. Esta característica ha promovido la modificación de los controladores de memoria, resultando en la aparición de nuevos chipsets (la serie 865 y 875 de Intel) o de nuevos zócalos de procesador en los AMD (el 939 con canal doble, reemplazo el 754 de canal sencillo). Los equipos de gamas media y alta por lo general se fabrican basados en chipsets o zócalos que soportan doble canal o superior, como en el caso del zócalo (socket) 1366 de Intel, que usaba un triple canal de memoria, o su nuevo LGA 2011 que usa cuádruple canal.", "subsections": []}, {"name": "Detección y corrección de errores", "text": "Existen dos clases de errores en los sistemas de memoria, los fallos (Hard fails) que son daños en el hardware y los errores (soft errors) provocados por causas fortuitas. Los primeros son relativamente fáciles de detectar (en algunas condiciones el diagnóstico es equivocado), los segundos al ser resultado de eventos aleatorios, son más difíciles de hallar.\nEn la actualidad la confiabilidad de las memorias RAM frente a los errores, es suficientemente alta como para no realizar verificación sobre los datos almacenados, por lo menos para aplicaciones de oficina y caseras. En los usos más críticos, se aplican técnicas de corrección y detección de errores basadas en diferentes estrategias:\nLa técnica del bit de paridad consiste en guardar un bit adicional por cada byte de datos y en la lectura se comprueba si el número de unos es par (“paridad par”) o impar (“paridad impar”), detectándose así el error.\nUna técnica mejor es la que usa “código de autochequeo y autocorrector” (error-correcting code, ECC), que permite detectar errores de 1 a 4 bits y corregir errores que afecten a un solo bit. Esta técnica se usa solo en sistemas que requieren alta fiabilidad.\nPor lo general, los sistemas con cualquier tipo de protección contra errores tiene un coste más alto, y sufren de pequeñas penalizaciones en desempeño, con respecto a los sistemas sin protección. Para tener un sistema con ECC o paridad, el chipset y las memorias deben tener soporte para esas tecnologías. La mayoría de placas base no poseen dicho soporte.\nPara los fallos de memoria se pueden utilizar herramientas de software especializadas que realizan pruebas sobre los módulos de memoria RAM. Entre estos programas uno de los más conocidos es la aplicación Memtest86+ que detecta fallos de memoria.", "subsections": []}, {"name": "RAM registrada", "text": "Es un tipo de módulo usado frecuentemente en servidores, posee circuitos integrados que se encargan de repetir las señales de control y direcciones: las señales de reloj son reconstruidas con ayuda del PLL que está ubicado en el módulo mismo. Las señales de datos se conectan de la misma forma que en los módulos no registrados: de manera directa entre los integrados de memoria y el controlador.\nLos sistemas con memoria registrada permiten conectar más módulos de memoria y de una capacidad más alta, sin que haya perturbaciones en las señales del controlador de memoria, permitiendo el manejo de grandes cantidades de memoria RAM. Entre las desventajas de los sistemas de memoria registrada están el hecho de que se agrega un ciclo de retardo para cada solicitud de acceso a una posición no consecutiva y un precio más alto que los módulos no registrados.\nLa memoria registrada es incompatible con los controladores de memoria que no soportan el modo registrado, a pesar de que se pueden instalar físicamente en el zócalo. Se pueden reconocer visualmente porque tienen un integrado mediano, cerca del centro geométrico del circuito impreso, además de que estos módulos suelen ser algo más altos.[6]​\nDurante el año 2006 varias marcas lanzaron al mercado sistemas con memoria FB-DIMM que en su momento se pensaron como los sucesores de la memoria registrada, pero se abandonó esa tecnología en 2007 dado que ofrecía pocas ventajas sobre el diseño tradicional de memoria registrada y los nuevos modelos con memoria DDR3.[7]​", "subsections": []}, {"name": "Véase también", "text": "Acceso aleatorio\nCircuito impreso\nCircuito integrado\nDoble canal\nDRAM\nJoint Electron Device Engineering Council\nMemoria (informática)\nMemoria FRAM\nMemoria gráfica de acceso aleatorio\nMemoria principal\nMemoria de semiconductor\nMemoria de solo lectura\nMemoria volátil\nRanura de expansión\nRDRAM\nSerial Presence Detect\nSRAM\nTecnología de montaje superficial\nZócalo (electrónica)\nRAM electroquímica", "subsections": []}, {"name": "Referencias", "text": "↑ «Memoria RAM: ¿qué hay detrás?». IONOS Digitalguide. Consultado el 28 de marzo de 2022. \n↑ «Mostek Firsts». Archivado desde el original el 12 de enero de 2012. Consultado el 2009. \n↑ «Datasheet & Application Note Database, PDF, Circuits, Datasheets / Datasheet Archive». Archivado desde el original el 27 de septiembre de 2017. Consultado el 1 de abril de 2009. \n↑ «The HP Vectra 486 memory controller / Hewlett-Packard Journal /Find Articles at BNET». Consultado el 2009. \n↑ «Cómo funciona la memoria de una computadora». \n↑ https://web.archive.org/web/20120310085510/http://download.micron.com/pdf/datasheets/modules/ddr2/HTJ_S36C512_1Gx72.pdf\n↑ «Copia archivada». Archivado desde el original el 15 de febrero de 2011. Consultado el 11 de diciembre de 2011. ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Microsoft", "title": "Microsoft", "summary": "(Presidente del Consejo de Administración y director ejecutivo)\n(Vicepresidente del Consejo de Administración y presidente)\n(Asesor técnico)\n(2023)\n(7,8%)\n(6,6%)\n(3,6%)\nGitHub\nLinkedIn\nMetaswitch\nNuance Communications\nRiskIQ\nSkype Technologies\nXamarin\nXandr\nMicrosoft\n47°38′24″N 122°07′41″O﻿ / ﻿47.64, -122.12805555556\nTraf-O-Data\nMicrosoft\n[\n]\nMicrosoft Corporation es una  corporación tecnológica multinacional estadounidense con sede en Redmond, Washington. Los productos de software más conocidos de Microsoft son la línea de sistemas operativos Microsoft Windows, el conjunto de aplicaciones de productividad Microsoft 365, el motor de búsqueda Microsoft Bing y el navegador web Microsoft Edge. Sus productos de hardware emblemáticos son las consolas de videojuegos Xbox y la línea de computadoras personales con pantalla táctil Microsoft Surface. Microsoft ocupó el puesto 14 en la clasificación Fortune 500 de 2022 de las corporaciones más grandes de Estados Unidos por ingresos totales; era el mayor fabricante de software del mundo por ingresos en 2022. \nSe considera una de las cinco grandes empresas estadounidenses de tecnología de la información junto con Alphabet (empresa matriz de Google), Amazon, Apple y Meta Platforms (empresa matriz de Facebook).\nPaul Allen y Bill Gates la fundaron el 4 de abril de 1975 para desarrollar y comercializar intérpretes de BASIC para el Altair 8800, un microordenador diseñado en 1974 y basado en el procesador Intel 8080. A mediados de la década de 1980, dominó el mercado de los sistemas operativos para computadoras personales con MS-DOS, que continuó con Microsoft Windows. La salida a bolsa de 1986 y la posterior subida del precio de las acciones crearon tres multimillonarios y unos 12.000 millonarios entre los empleados de Microsoft. Desde la década de 1990, se ha diversificado cada vez más fuera del mercado de los sistemas operativos. Ha realizado una serie de adquisiciones corporativas, siendo la mayor la compra de LinkedIn por 26.200 millones de dólares en diciembre de 2016,[2]​ seguida de la compra de Skype Technologies por 8500 millones de dólares en mayo de 2011.[3]​\nMicrosoft es un actor dominante en el mercado de los sistemas operativos para ordenadores compatibles con IBM y en el de las suites ofimáticas. Sin embargo, ha perdido la mayor parte del mercado de sistemas operativos ante la llegada de Android en 2008.[4]​ La empresa también produce una amplia gama de otros productos de software para ordenadores de sobremesa y servidores, como la búsqueda en Internet (con Bing), el mercado de servicios digitales (a través de MSN), la realidad mixta (HoloLens), la computación en la nube (Azure) y el desarrollo de software (Visual Studio).[5]​\nSteve Ballmer sustituyó a Bill Gates como consejero delegado el 13 de enero del año 2000 y desarrolló una estrategia centrada en los dispositivos y los servicios. Comenzó su gestión con la adquisición de Peach Networks anunciada el 29 de febrero del 2000 para expandir los servicios de cable digital de Microsoft TV.[6]​[7]​ También entró por primera vez en el mercado de la producción de computadoras personales en junio de 2012 con el lanzamiento de la línea de tabletas Microsoft Surface; y la posterior configuración de Microsoft Mobile mediante la adquisición de la división de dispositivos y servicios de Nokia. Desde que Satya Nadella se convirtió en consejero delegado en 2014, la compañía ha reducido su énfasis en el hardware y se ha centrado en la computación en la nube y la inteligencia artificial, un movimiento que ha impulsado las acciones de la compañía a su valor más alto desde diciembre de 1999.[8]​[9]​\nEn 2018, Microsoft superó a Apple Inc. como la empresa que cotiza en bolsa más valiosa del mundo después de haber sido destronada por el gigante tecnológico en 2010.[10]​ En abril de 2019, Microsoft se convirtió en la tercera empresa pública estadounidense valorada en más de un billón de dólares después de que Apple y Amazon alcanzaran el billón de dólares de capitalización bursátil en 2018.[11]​\nEn la actualidad, Microsoft tiene presencia en los siguientes países: Irlanda, Alemania, Bélgica, Canadá, Dinamarca, Estados Unidos, Finlandia, Francia, Italia, México, Austria, Japón, Países Bajos, Reino Unido, Suecia, España, y Polonia; ofreciendo una gran variedad de productos y servicios. Microsoft también está presente en otros países, donde realiza funciones de soporte, como: Australia, Argentina, Brasil, Nueva Zelanda y República de la India.[12]​", "sections": [{"name": "Historia", "text": "Artículo principal:", "subsections": [{"name": "Orígenes", "text": "Tras el lanzamiento del Altair 8800, Bill Gates llamó a los creadores del nuevo microordenador, Micro Instrumentation and Telemetry Systems (Micro Instrumentación de Sistemas de Telemetría) (MITS), para ofrecerles una implementación del lenguaje de programación BASIC para el sistema. Tras la demostración, MITS accedió a distribuir Altair BASIC.[13]​ A raíz de ello Gates dejó la Universidad de Harvard, trasladándose a Albuquerque, Nuevo México, donde MITS estaba establecida, y en 1975 fundó Microsoft junto a Paul Allen. La primera oficina internacional de la compañía se abrió el 1 de noviembre de 1978 en Japón, bajo el nombre de \"ASCII Microsoft\" (actualmente conocida como Microsoft Japón).[14]​ El 1 de enero de 1979, Microsoft se trasladó a Bellevue, en Washington. El 11 de junio de 1980, Steve Ballmer se une a la compañía, quien sustituiría después a Bill Gates como segundo CEO de Microsoft.\nLos primeros productos de Microsoft tras su fundación, aparte de los intérpretes BASIC, fueron compiladores de COBOL y Fortran.[15]​[16]​\nEl primer sistema operativo que la compañía lanzó al público fue una variante de Unix en el año 1979. Adquirido de AT&T a través de una licencia de distribución, Microsoft le apodó Xenix, y alquiló la empresa Santa Cruz Operation para adaptar su sistema operativo a importantes plataformas.[17]​ Xenix fue cedido a Santa Cruz Operation, que adaptó el sistema para microprocesadores 80286 en 1985, bajo el nombre de SCO UNIX.\nDOS (Disk Operating System, Sistema operativo de disco en inglés) fue el sistema operativo que llevó a la compañía a su primer éxito.[18]​ En agosto de 1981, después de unas negociaciones fracasadas con Digital Research, IBM acordó con Microsoft proveer de una versión de un sistema operativo CP/M, el cual fuera pensado para el PC de IBM. Para esta idea, Microsoft compró a Seattle Computer Products un clon de CP/M llamado 86-DOS, el cual IBM renombró a PC-DOS. Posteriormente, el mercado presenció una inundación de clones del PC de IBM después de que Columbia Data Products clonase exitosamente la BIOS del IBM. Por un marketing agresivo de MS-DOS hacia los fabricantes de clones del IBM-PC, Microsoft se elevó desde un pequeño competidor hasta llegar a ser uno de los principales oferentes de software para computadoras personales de la industria.[19]​[20]​ La compañía se expandió hacia nuevos mercados con el lanzamiento del Ratón de Microsoft en 1983, producto que no fue fabricado originalmente por ellos. También destacar la creación de una división llamada Microsoft Press.[21]​"}, {"name": "MS-DOS y Windows de 16 bits", "text": "En agosto de 1985, Microsoft e IBM colaboraron en el desarrollo de una familia de sistemas operativos diferentes llamados OS/2.[22]​ El 20 de noviembre de 1985, Microsoft lanzó la primera versión para minoristas de su sistema operativo Microsoft Windows. Originalmente, Windows no era más que una extensión gráfica para MS-DOS.[23]​\nEl 13 de marzo de 1986, la compañía hizo una Oferta Pública de Venta, con un precio inicial de 21 dólares por acción. Al terminar el primer día, la acción ya tenía un valor efectivo de 28 dólares. En 1987, Microsoft lanzó su primera versión de OS/2 para OEMs.[24]​\nEn 1989, Microsoft introdujo su principal paquete ofimático, Microsoft Office, un paquete de aplicaciones ofimáticas integradas, como Microsoft Word y Microsoft Excel, el cual debutó en Apple Macintosh en junio.[25]​[13]​ El 22 de mayo de 1990, salió al mercado Windows 3.0,[26]​ la nueva versión del sistema operativo, el cual disponía de nuevas funciones, una interfaz de usuario gráfica más racional y un mejorado modo protegido para el procesador Intel 386.[26]​\nEn seis meses las ventas superaron los 2 millones de unidades.[27]​ Esto suponía que Windows ya generaba mayores beneficios que OS/2, por lo que la compañía decidió mover recursos desde OS/2 a Windows.[28]​ En los siguientes años OS/2 decayó, y Windows fue rápidamente favorecido como plataforma para PC.[29]​\nDurante la transición de MS-DOS hacia Windows, el éxito de Office permitió a la compañía tomar posición frente a las aplicaciones ofimáticas de la competencia, como WordPerfect y Lotus 1-2-3[30]​ Según la compañía Novell, propietaria durante un tiempo de WordPerfect, Microsoft usaba conocimiento no documentado del núcleo de MS-DOS y Windows para que Office funcionase mejor que los de las aplicaciones de la competencia. Mientras, Office se convertía en la suite ofimática dominante, con una cuota de mercado superior a la de sus competidores.[31]​\nEn 1993, Microsoft publicó Windows NT 3.1,[27]​ un sistema operativo de negocios con la interfaz de Windows 3.1 pero con un núcleo totalmente diferente.[27]​ En 1995, Microsoft puso en venta Windows 95,[27]​ una nueva versión del sistema operativo insignia de la compañía con una interfaz de usuario completamente nueva; entre sus novedades se destacan el nuevo Menú Inicio, un explorador de archivos mejorado, compatibilidad del hardware plug-and-play y soporte mejorado para multimedia y juegos. La nueva versión de Windows permitirá además nombres largos de archivos y la multitarea prioritaria de 32 bits, que permite usar a la vez varios programas. En los 4 primeros días, se vendieron 1 millón de copias de Microsoft Windows 95.[32]​ En este mismo año, salió al mercado Internet Explorer[33]​ que venía incluido junto al paquete Windows 95 Plus! (o Windows Plus!), una nueva versión de Windows 95. Tras adquirir la licencia del navegador NCSA Mosaic perteneciente a Spyglass, modificó el navegador y lo transformó renombrándolo Internet Explorer.[34]​\nEn marzo de 1995 salió Microsoft Bob,[35]​ una extensión de Windows 3.1 destinada al mercado doméstico que pretendía hacer más amigable el uso de la computadora, cambiando la interfaz por otro basado en objetos cotidianos (cajones, mesas, cuadros) y personajes a modo de asistentes (un perro, una pelota roja, etc.). A pesar de ser un rotundo fracaso,[35]​ muchos de sus conceptos fueron trasladados a otros programas de la compañía como, por ejemplo, los asistentes de ayuda del Office o las búsquedas de Windows XP. Es remarcable decir que Microsoft Bob fue desarrollado por Melinda Gates, y también que este fue su último proyecto en la compañía."}, {"name": "Desde 1995 hasta 2006: Internet y los problemas legales", "text": "A mediados de los 90, Microsoft inició una nueva expansión hacia las redes y el World Wide Web. El 24 de agosto de 1995, lanzó su principal servicio en línea y acceso a Internet, MSN (Microsoft Network),[36]​ con la intención de competir de forma directa con AOL (America Online). MSN se convirtió en la marca general de Microsoft para los servicios en línea.[37]​ La compañía continuó en su expansión hacia otros mercados. Ya en 1996, trabajó junto a la NBC para crear una nueva emisora de televisión por cable que ofreciera noticias y estuviera disponible en cualquier momento: la MSNBC.[38]​ Además, creó la revista Slate, que más tarde, el 21 de diciembre de 2004, sería adquirida por The Washington Post.[39]​ En noviembre del mismo año, Microsoft se introdujo en el mercado de los PDA en noviembre con Windows CE 1.0, una nueva versión hecha desde cero de su famoso sistema Windows, específicamente diseñado para sistemas con poca memoria y rendimiento, como pequeñas computadoras y equipos de mano. Más adelante, en 1997,[40]​ Internet Explorer 4.0 fue publicado para Mac OS y Windows, marcando el principio del fin de su competidor, Netscape Navigator.[41]​ En octubre, el Departamento de Justicia de los Estados Unidos archivó una moción de la Corte Federal por la que indicaban que había violado un acuerdo firmado en 1994, y exigía que se detuviera la venta de Internet Explorer junto a Windows tal y como se le obligaba a los fabricantes.[42]​\nA finales de 1997, Microsoft compra el servicio de webmail Hotmail (ahora Outlook.com)[43]​ que pasó a llamarse MSN Hotmail. Con esta compra, la compañía trató de hacer frente a AOL.[43]​\n1998 fue un año importante para Microsoft, Bill Gates designó a Steve Ballmer como presidente, sin embargo, Gates siguió manteniéndose en la presidencia del Consejo de Dirección de la empresa.[44]​ Windows 98 salió a la venta, la nueva versión de Windows era una actualización de Windows 95 que incorporaba nuevas características centradas en Internet y que era compatible con los nuevos tipos de dispositivos.[45]​ Un año después de la aparición de Windows 98, Microsoft lanza el 5 de mayo de 1999 Windows 98 SE, este nuevo sistema no era una actualización de Windows 98, sino un producto nuevo. Esta nueva versión corregía errores de anteriores versiones dándole mayor estabilidad, ampliaba su compatibilidad con los periféricos y con Windows NT y permitía la posibilidad de compartir una conexión a Internet por medio de la red local. También cabe destacar la inclusión de Internet Explorer 5, nueva versión del navegador. Por orden judicial, Microsoft se vio obligado a vender en algunas regiones una versión de este sistema operativo que diera opción para desinstalar Internet Explorer. Esto no era permitido en la versión anterior de Windows.[46]​[47]​\nEn 1999, Microsoft pagó 5000 millones de dólares a la compañía de telecomunicaciones AT&T Corp para utilizar su sistema operativo Windows CE en dispositivos diseñados para ofrecer a los consumidores servicios integrados de televisión por cable, teléfono y acceso rápido a Internet.[48]​\nEse mismo año, Microsoft desarrolla el programa de mensajería instantánea MSN Messenger, que tuvo un gran éxito en su lanzamiento. Con el lanzamiento de Windows Vista, MSN Messenger pasó a llamarse Windows Live Messenger.[49]​\nEl 17 de febrero de 2000, nace Windows 2000,[52]​ entre sus novedades, destaca el Active Directory, que permitía trabajar a las organizaciones a nivel global, con todas sus máquinas,[53]​[54]​ la incorporación del Administrador de Dispositivos, Windows Media Player y aumentaba la compatibilidad de los juegos bajo Windows NT. Sin embargo, este sistema estaba pensado para uso profesional y no tuvo un uso tan extendido en los hogares como en los negocios.[52]​\nEl 3 de abril, la justicia se pronunció en el caso de los Estados Unidos frente a Microsoft acusando a la compañía de practicar un \"monopolio abusivo\" y forzándola a dividir sus productos en 2 unidades separadas.[44]​ Esta sentencia dio un vuelco ante la corte federal de apelación, y fue resuelta por el Departamento de Justicia en 2001.[55]​\nWindows ME (Windows Millenium Edition) se pone a disposición del público el día 14 de septiembre del mismo año.[56]​ Windows ME sería el sustituto de Windows 98, sus principales novedades era la inclusión de la opción Restaurar Sistema, que permite devolver la configuración del equipo a un estado previo así como mejoras en cuanto a Internet.[57]​ El sistema no tuvo el éxito esperado.[57]​\nEste mismo año, Bill Gates, con el fin de poder centrarse en el desarrollo de nuevos productos y tecnologías, renunció como consejero delegado de la compañía siendo sustituido por Steve Ballmer.[58]​\nEl 25 de octubre de 2001, Microsoft estrenó Windows XP.[59]​ La primera versión de Windows que combina características tanto de su línea para computadoras caseras como para los negocios. XP; abreviatura de \"eXPeriencia\"[60]​ introduce una nueva interfaz gráfica de usuario, el primer cambio de la interfaz desde 1995.[61]​[60]​ Windows XP, sin embargo, recibió críticas por la cantidad de fallos de seguridad que fueron encontrados y presentaba una menor compatibilidad con los dispositivos y algunos programas.[62]​[63]​[64]​ Aun así, el lanzamiento de Windows XP significó un nuevo concepto de sistema operativo para las computadoras domésticas. Windows XP es, actualmente, el sistema x86 más extendido del planeta, con unos 400 millones de copias vendidas.\n[65]​\nMás adelante, con el lanzamiento de Xbox el 8 de noviembre del mismo año,[66]​ Microsoft se introdujo en el mercado de las videoconsolas, un mercado dominado por Nintendo y Sony.[67]​\nLa nueva solución empresarial de Microsoft se presentó el 24 de abril de 2003.[68]​ Dirigida a empresas, Windows Server 2003 era un 139% más rápido que su antecesor, Windows 2000 Server y un 200% frente a Windows NT 4.0.[68]​[69]​\nLa compañía tropezó con más problemas legales en marzo de 2004 cuando se emprendieron acciones legales contra Microsoft por parte de la Unión Europea por abuso dominante del mercado, tras ser juzgada, Microsoft se vio en la obligación de comercializar nuevas versiones de su sistema Windows XP. Estas nuevas versiones no incluían a Windows Media Player y se conocieron con el nombre de Windows XP Home Edition N y Windows XP Professional N.[70]​[71]​"}, {"name": "2006 hasta 2010: Windows Vista, Windows 7 y Windows Phone", "text": "En el año 2006, Bill Gates anunció el inicio de un período de transición, su puesto de Jefe de Arquitectura de Software podría ser ocupado por Ray Ozzie,[72]​ aunque permanecería como presidente de la compañía, al frente de la Junta Directiva y como consejero en los proyectos claves.\nTras numerosos retrasos,[73]​[74]​[75]​ el 29 de enero de 2007 la compañía lanza oficialmente Windows Vista. Se sacaron al mercado 6 ediciones diferentes:[76]​\nHome Basic: Pensada para hogares y usuarios con necesidades básicas.[76]​\nHome Premium: Pensada para hogares, trae una nueva interfaz, Windows Aero, con efectos visuales mejorados y un escritorio 3D con la utilidad Windows Flip 3D, nuevas tecnologías de diagnóstico y mejora del rendimiento del sistema.[77]​\nBusiness: Pensado para pequeñas empresas.[78]​\nUltimate: Combina las características de la edición Home Premium y la edición Business.[79]​\nEnterprise: Ideada para grandes empresas que operen en redes globales, incluye una mayor compatibilidad con aplicaciones y diferentes idiomas, así como Windows BitLocker para la protección de datos.[80]​\nStarter: Pensado para usuarios principiantes, es la edición menos completa de todas y la más simple. Se incluye en equipos de bajo costo y no se comercializa en la Unión Europea, Estados Unidos, Japón y Australia.[81]​\nA estas ediciones hay que sumarles las etiquetadas como N, que solo se distribuyen en Europa y que no incluyen el reproductor de Windows Media.[82]​ en general, la seguridad ha mejorado respecto a Windows XP, con herramientas como la protección de seguridad dinámica y Windows Defender. Además, Vista incluye un control parental de acceso a internet.[83]​ En cuanto a los fallos de seguridad, en los primeros 6 meses se han detectado menos fallos en Vista que en otros sistemas como XP.[84]​[85]​\nJunto con Windows Vista, salió a la venta la nueva versión de la suite ofimática de la compañía, Microsoft Office 2007. Entre sus novedades está la interfaz Ribbon, que sustituye las barras de herramientas y menús por pestañas.[86]​\nEl 1 de febrero del 2008, Microsoft anunció su intención de comprar a uno de sus mayores competidores, Yahoo, por 44.600 millones de dólares en efectivo o 31 dólares por acción.[87]​ Esta oferta, llega en momentos difíciles para Yahoo, que recientemente anunció el despido del 7% de su plantilla para intentar reestructurar la empresa.[87]​ Desde Yahoo, se ha indicado el estudio de la oferta por parte de la Dirección de la empresa.[88]​ Poco después, Yahoo decidió no aceptar la propuesta por considerar que la oferta de Microsoft \"subvalora enormemente a Yahoo\".[89]​\nAcuerdo Yahoo!-Microsoft\nPara competir directamente contra Google y tras un fracaso intento de compra de Yahoo! por parte de Microsoft en una OPA por un valor de 44.600 millones de dólares.[90]​ Las compañías anunciaron un acuerdo de 10 años. En este acuerdo, Microsoft recibirá un permiso exclusivo para integrar las tecnologías de búsqueda de Yahoo!, y también podrá utilizarla para sus propias plataformas de búsqueda. Bing será el motor de búsqueda exclusivo de los sitios de Yahoo! pero este último mantendrá la administración de las publicidades relacionadas. Sin embargo, no significa que la búsqueda realizada en Yahoo! se redirija a Bing. Yahoo de todos modos poseerá su experiencia de usuario en sus propiedades, incluida la búsqueda, pero los usuarios verán una nota que diga \"Powered by Bing\" en el fondo de los resultados de búsqueda.[91]​[92]​"}, {"name": "2011 a 2014: Rebranding, Windows 8, Surface, Outlook.com y Xbox One", "text": "Seguido del lanzamiento de los teléfonos inteligentes con sistema operativo Windows, Microsoft se enfocó en un cambio de imagen de sus productos desde 2011 a 2012; el logo de la compañía, productos, servicios y el sitio web de Microsoft adoptaron el concepto del diseño Metro. En junio de 2011 en la conferencia anual de Taiwán Computex Microsoft mostró al público su nueva versión de Windows, un sistema operativo diseñado para computadores de escritorio, portátiles y tabletas. Una versión para desarrolladores (Developer Preview) fue lanzada en septiembre 13 del mismo año y el 31 de mayo de 2012 fue lanzada la versión de prueba.\nPara el 26 de octubre de 2012, Microsoft lanzó Windows 8 junto con Microsoft Surface. Al año siguiente lanzó una gran actualización del sistema: Windows 8.1.\nEl 22 de noviembre de 2013, Microsoft lanzaría al mercado su nueva y tercera videoconsola de octava generación de la marca Xbox, la Xbox One, en la cual comenzara a comercializar en 13 países como en Reino Unido, Estados Unidos, Irlanda, Canadá, Alemania, España, Francia, Italia, Austria, Brasil, México, Australia y Nueva Zelanda. Más tarde a inicios del año 2014 estará a la venta en el resto de los mercados.[93]​\nEl 15 de septiembre de 2014, Microsoft adquirió Mojang, (empresa creadora del popular juego Minecraft) por 2,500 millones de dólares."}, {"name": "2015-2020: Unificación, Windows 10, HoloLens y Microsoft Edge", "text": "El 21 de enero de 2015, Microsoft anunció el lanzamiento de su primera pizarra interactiva, Microsoft Surface Hub. El 29 de julio de 2015, se lanzó Windows 10, con su hermano servidor, Windows Server 2016, lanzado en septiembre de 2016. En el primer trimestre de 2015, Microsoft fue el tercer mayor fabricante de teléfonos móviles, vendiendo 33 millones de unidades (7.2% de todas). Si bien una gran mayoría (al menos el 75%) de ellos no ejecuta ninguna versión de Windows Phone (Gartner no clasifica esos otros teléfonos como teléfonos inteligentes), en el mismo período de tiempo se fabricaron 8 millones de teléfonos inteligentes con Windows (2.5% de todos los teléfonos inteligentes) por todos los fabricantes (pero principalmente por Microsoft). La participación de Microsoft en el mercado de teléfonos inteligentes de Estados Unidos. En enero de 2016 fue de 2.7%. Durante el verano de 2015, la compañía perdió $ 7.6 mil millones relacionados con su negocio de telefonía móvil, despidiendo a 7.800 empleados.\nEl 1 de marzo de 2016, Microsoft anunció la fusión de sus divisiones de PC y Xbox, y Phil Spencer anunció que las aplicaciones de la Plataforma Universal de Windows (UWP) serían el foco para los juegos de Microsoft en el futuro. El 24 de enero de 2017, Microsoft presentó Intune for Education en la conferencia de tecnología educativa BETT 2017 en Londres. Intune for Education es un nuevo servicio de administración de dispositivos y aplicaciones basado en la nube para el sector educativo. En mayo de 2016, la compañía anunció que despedía a 1850 trabajadores y asumía un cargo por deterioro y reestructuración de $ 950 millones. En junio de 2016, Microsoft anunció un proyecto llamado Microsoft Azure Information Protection. Su objetivo es ayudar a las empresas a proteger sus datos a medida que se mueven entre servidores y dispositivos. En noviembre de 2016, Microsoft se unió a la Fundación Linux como miembro Platinum durante el Connect de Microsoft; evento desarrollador en Nueva York. El costo de cada membresía Platinum es de US $ 500,000 por año. Sin embargo, algunos analistas consideraron esto impensable diez años antes, ya que en 2001 el entonces CEO Steve Ballmer llamó a Linux \"cáncer\". Microsoft planeó lanzar una vista previa de Intune for Education \"en las próximas semanas\", con disponibilidad general programada para la primavera de 2017, con un precio de $ 30 por dispositivo, o mediante acuerdos de licencia por volumen.\nEn julio de 2017, Microsoft anuncia una reestructuración de 3000 despidos para centrarse en los servicios de gestión de datos y abandonar definitivamente el sistema operativo para dispositivos móviles.[94]​\nEn enero de 2018, Microsoft parchó Windows 10 para tener en cuenta los problemas de CPU relacionados con la violación de seguridad Meltdown de Intel. El parche provocó problemas con las máquinas virtuales de Microsoft Azure que dependen de la arquitectura de CPU de Intel. El 12 de enero, Microsoft lanzó PowerShell Core 6.0 para los sistemas operativos macOS y Linux. En febrero de 2018, Microsoft eliminó el soporte de notificaciones para sus dispositivos Windows Phone, lo que efectivamente finalizó las actualizaciones de firmware para los dispositivos descontinuados. En marzo de 2018, Microsoft retiró Windows 10 S para cambiarlo a un modo para el sistema operativo Windows en lugar de un sistema operativo separado y único. En marzo, la compañía también estableció pautas que censuran a los usuarios de Office 365 del uso de malas palabras en documentos privados. En abril de 2018, Microsoft lanzó el código fuente para el Administrador de archivos de Windows bajo la Licencia MIT para celebrar el 20 aniversario del programa. En abril, la compañía expresó su voluntad de adoptar iniciativas de código abierto al anunciar Azure Sphere como su propio derivado del sistema operativo Linux. En mayo de 2018, Microsoft se asoció con 17 agencias de inteligencia estadounidenses para desarrollar productos de computación en la nube. El proyecto se denomina \"Gobierno de Azure\" y tiene vínculos con el programa de vigilancia de la Infraestructura de Defensa de la Empresa Conjunta (JEDI). El 4 de junio de 2018, Microsoft anunció oficialmente la adquisición de GitHub por $ 7,5 mil millones, un acuerdo que se cerró el 26 de octubre de 2018. El 10 de julio de 2018, Microsoft reveló la plataforma Surface Go al público. Más adelante en el mes, convirtió Microsoft Teams a gratis. En agosto de 2018, Microsoft lanzó dos proyectos llamados Microsoft AccountGuard y Defending Democracy. También dio a conocer la compatibilidad de Snapdragon 850 para Windows 10 en la arquitectura ARM.\nEn agosto de 2018, Toyota Tsusho inició una asociación con Microsoft para crear herramientas de cultivo de peces utilizando el paquete de aplicaciones Microsoft Azure para tecnologías de Internet de las cosas (IoT) relacionadas con la gestión del agua. Desarrollado en parte por investigadores de la Universidad de Kindai, los mecanismos de la bomba de agua utilizan inteligencia artificial para contar la cantidad de peces en una cinta transportadora, analizar la cantidad de peces y deducir la efectividad del flujo de agua a partir de los datos que proporcionan los peces. Los programas informáticos específicos utilizados en el proceso pertenecen a las plataformas Azure Machine Learning y Azure IoT Hub. En septiembre de 2018, Microsoft suspendió Skype Classic. El 10 de octubre de 2018, Microsoft se unió a la comunidad Open Invention Network a pesar de tener más de 60.000 patentes. En noviembre de 2018, Microsoft acordó suministrar 100.000 auriculares Microsoft HoloLens al ejército de los Estados Unidos para \"aumentar la letalidad al mejorar la capacidad de detectar, decidir y participar antes que el enemigo\". En noviembre de 2018, Microsoft presentó Azure Multi-Factor Authentication para Microsoft Azure. En diciembre de 2018, Microsoft anunció Project Mu, una versión de código abierto del núcleo de la Interfaz de firmware extensible unificada (UEFI) que se utiliza en los productos Microsoft Surface e Hyper-V. El proyecto promueve la idea de Firmware como Servicio. En el mismo mes, Microsoft anunció la implementación de código abierto de Windows Forms y Windows Presentation Foundation (WPF) que permitirá un mayor movimiento de la empresa hacia el lanzamiento transparente de marcos clave utilizados en el desarrollo de aplicaciones y software de escritorio de Windows. Diciembre también vio a la compañía discontinuar el proyecto de Microsoft Edge a favor de los backends de Chromium para sus navegadores.\n20 de febrero de 2019 Microsoft Corp dijo que ofrecerá su servicio de seguridad cibernética AccountGuard a 12 nuevos mercados en Europa, incluidos Alemania, Francia y España, para cerrar las brechas de seguridad y proteger a los clientes en el espacio político de la piratería. En febrero de 2019, cientos de empleados de Microsoft protestaron por la ganancia de guerra de la compañía de un contrato de $ 480 millones para desarrollar auriculares de realidad virtual para el Ejército de los Estados Unidos.\n18 de diciembre de 2020 Microsoft anuncia que empezará una nueva línea de microprocesadores[95]​ creada por la compañía. Estos procesadores son creados para reemplazar los actuales Intel en la gama Surface y en los servidores Azure. Este nuevo cambio en el desarrollo de Microsoft está afectando gravemente a Intel dejando una pérdida de ventas bastante grande."}, {"name": "2020 - presente: Adquisiciones, Xbox Series X/S y Windows 11", "text": "El 15 de enero de 2020, Microsoft lanzó la versión en Chromium de Microsoft Edge\nEl 26 de marzo de 2020, Microsoft anunció que iba a adquirir Affirmed Networks por alrededor de $ 1.35 mil millones. Debido a la pandemia de COVID-19, Microsoft cerró todas sus tiendas minoristas por más de un año debido a problemas de salud. El 22 de julio de 2020, Microsoft anunció planes para cerrar su servicio Mixer, planeando trasladar a los socios existentes a Facebook Gaming. El 31 de julio de 2020, se informó que Microsoft estaba en conversaciones para adquirir TikTok después de que la administración de Trump ordenara a ByteDance vender la propiedad de la aplicación a los EE. UU. El 3 de agosto de 2020, después de la especulación sobre el acuerdo, Donald Trump declaró que Microsoft podría comprar la aplicación, sin embargo, debería completarse antes del 15 de septiembre de 2020 y que el Departamento del Tesoro de los Estados Unidos debería recibir una parte si fuera a irse a través. El 5 de agosto de 2020, Microsoft detuvo su prueba de transmisión de juegos xCloud para dispositivos iOS. Según Microsoft, el futuro de xCloud en iOS sigue sin estar claro y potencialmente fuera de las manos de Microsoft. Apple ha impuesto un límite estricto a los \"clientes de escritorio remoto\", lo que significa que las aplicaciones solo pueden conectarse a un dispositivo anfitrión o consola de juegos propiedad del usuario. El 21 de septiembre de 2020, Microsoft anunció su intención de adquirir ZeniMax Media empresa matriz de Bethesda Softworks por aproximadamente $ 7.5 mil millones, y se espera que el acuerdo se produzca en la segunda mitad del año fiscal 2021. El 9 de marzo de 2021, se finalizó la adquisición y ZeniMax Media pasó a formar parte de la división Xbox Game Studios de Microsoft. El 22 de septiembre de 2020, Microsoft anunció que tenía una licencia exclusiva para usar el generador de lenguaje de inteligencia artificial GPT-3 de OpenAI. La versión anterior de GPT-3, llamada GPT-2, fue noticia por ser \"demasiado peligrosa para publicar\" y tenía numerosas capacidades, incluido el diseño de sitios web, la prescripción de medicamentos, la respuesta a preguntas y la redacción de artículos. El 10 de noviembre de 2020, Microsoft lanzó las consolas de videojuegos Xbox Series X y Xbox Series S.\nEl 12 de abril de 2021, Microsoft anunció que adquirirán Nuance Communications por $19,700 millones de dólares. El CEO de Nuance, Mark Benjamín, estará dentro de la compañía. La compra de Nuance sería la segunda adquisición más grande para Microsoft, después de LinkedIn por 26,000 mil millones de dólares. El 27 de abril, en parte debido a las sólidas ganancias trimestrales impulsadas por la pandemia de COVID-19, la valoración de Microsoft llegó a cerca de $ 2 billones. La creciente necesidad de trabajo remoto y educación a distancia impulsó la demanda de servicios de computación en la nube y aumentó las ventas de juegos de la compañía. El 24 de junio, Microsoft anuncia Windows 11 durante un livestream, esto provocó una confusión después de que Microsoft anteriormente anunciara que Windows 10 sería la última versión del sistema operativo. Windows 11 Se lanzó el 5 de octubre de 2021. El 7 de septiembre de 2021 Microsoft anuncia la adquisición de Clipchamp, una start-up australiano creadora de un editor de videos en línea del mismo nombre, en su comunicado de prensa indican que desean conocer el mercado de los creadores de contenido. En octubre de 2021, Microsoft anunció que comenzó a implementar la compatibilidad con el cifrado de extremo a extremo (E2EE) para las llamadas de Microsoft Teams con el fin de asegurar la comunicación comercial mientras se usa el software de videoconferencia. Los usuarios pueden asegurarse de que sus llamadas estén encriptadas y pueden utilizar un código de seguridad que ambas partes en una llamada deben verificar en los extremos respectivos. El 7 de octubre, Microsoft adquirió Ally.io, un servicio de software que mide el progreso de las empresas frente a los OKR. Microsoft planea incorporar Ally.io en su familia Viva de productos de experiencia para empleados.\nEl 18 de enero de 2022, Microsoft anunció la adquisición del desarrollador y holding de videojuegos estadounidense Activision Blizzard en un acuerdo en efectivo con un valor de $ 68 700 millones. Activision Blizzard ha sido el productor de franquicias, que incluyen, Warcraft, Diablo, Call of Duty, StarCraft, Candy Crush Saga, Crash Bandicoot, Spyro The Dragon, Skylanders, Overwatch, entre otras. Activision Blizzard y Microsoft publicaron declaraciones diciendo que la adquisición era para beneficiar a sus negocios en el metaverso, muchos vieron la adquisición de estudios de videojuegos por parte de Microsoft como un intento de competir contra Meta Platforms, con TheStreet refiriéndose a Microsoft queriendo convertirse en \"el Disney del metaverso\". Microsoft no ha publicado declaraciones sobre las controversias legales recientes de Activision con respecto al abuso de los empleados, pero los informes han alegado que el director ejecutivo de Activision, Bobby Kotick, uno de los principales objetivos de la controversia, dejará la empresa después de que finalice la adquisición. Se espera que el acuerdo se cierre a mediados de 2023 seguido de una revisión de la Comisión Federal de Comercio de EE. UU y de otras reguladoras a nivel internacional.\nMicrosoft reportó su crecimiento en ingresos más lento en 5 años en el tercer trimestre de 2022.[96]​ La fortaleza del dólar y la disminución en las ventas de computadoras personales son los principales motivos detrás de esta desaceleración. Como resultado, los ingresos netos disminuyeron en un 14%.[97]​\nEn diciembre de 2022, Microsoft anunció un nuevo acuerdo de 10 años con la Bolsa de Valores de Londres para productos que incluyen Microsoft Azure; Microsoft adquirió ~4% de esta última empresa como parte del trato.[98]​\nEn enero de 2023, el director ejecutivo Satya Nadella anunció que Microsoft despediría a unos 10 000 empleados.[99]​ El anuncio se produjo un día después de organizar un concierto de Sting para 50 personas, incluidos ejecutivos de Microsoft, en Davos, Suiza.[100]​\nEl 23 de enero de 2023, Microsoft anunció un nuevo acuerdo de inversión multianual y multimillonario con OpenAI, desarrollador de ChatGPT.[101]​\nEl 13 de octubre de 2023, Microsoft cerró la compra de Activision Blizzard por 68.700 millones de dólares, siendo ahora el nuevo propietario de Call of Duty, World of Warcraft y Diablo.[102]​"}]}, {"name": "Otros productos", "text": "Junto a Windows y Office, Microsoft cuenta con una amplia gama de productos entre los que destacan:\n Microsoft Quantum Development Kit, lenguaje de programación en Q#.\nBiztalk Server: Automatización y gestión de procesos empresariales.[103]​\nExchange: Servidor de correo electrónico que incluye además un servicio de mensajería y un calendario. Una de sus características más importantes es su integración con Microsoft Office.[104]​\nInternet Security and Acceleration Server (ISA): Servidor firewall corporativo, multicapa y caché.[105]​\nOperations Manager: Monitorización de sistemas Windows Server y aplicaciones.NET.[106]​\nSharepoint Portal Server: Integrada en Office, proporciona herramientas para la colaboración, administración de contenido e implementación de procesos empresariales.[107]​\nSQL Server: Plataforma de base de datos que ofrece herramientas de administración de datos empresariales.[108]​\nSystems Management Server: Gestión de sistemas (inventarios, control remoto, distribución de software...).[109]​\nMicrosoft Project: Administrador de proyectos empresariales.[110]​\nMicrosoft Security Essentials: Antivirus gratuito, conocida anteriormente como Morro.\nMicrosoft Visual Studio, que incluye Visual Basic, Visual C++, Visual C#, Visual J#... Proporciona herramientas para desarrolladores de aplicaciones informáticas.[111]​\nMicrosoft Internet Explorer: Navegador web descontinuado, cuenta con versiones para los sistemas operativos Windows, Apple Macintosh y Solaris Unix. Fue reemplazado por Microsoft Edge en 2015.[112]​\nMicrosoft Edge: Navegador web, cuenta con versiones para los sistemas operativos Windows, macOS y Linux. Anteriormente utilizaba EdgeHTML. En 2019, Microsoft lo modificó para que use Blink.[113]​\nMicrosoft Xbox (y sus sucesores Xbox 360 y Xbox One): Videoconsola de sexta, séptima y octava generación respectivamente.\nMicrosoft PixelSense: Permite el manejo de contenidos digitales con los movimientos de las manos.\nSkype: Permite realizar llamadas VoIP, llamadas y Videollamada. Disponible para móviles, tabletas y ordenadores.[114]​\nCampaign Cloud: Plataforma construida con la computación de la nube para campañas políticas en línea.\nOutlook: Aplicación para enviar correos electrónicos de la suite de Office su origen se remonta a 1989 la versión más reciente es de 2016", "subsections": [{"name": "Productos descontinuados", "text": "Zune: Reproductor de música digital.\nWindows Live Messenger: Cliente de mensajería instantánea, anteriormente llamado Windows MSN Messenger.[115]​\nMicrosoft Encarta Enciclopedia electrónica, que se distribuye tanto desde una web como desde un programa.[116]​[117]​\nWindows Phone fue sustituido por Windows 10 Mobile: Sistema operativo para teléfonos inteligentes y PDAs.[118]​\nMicrosoft Works: Proporciona herramientas de productividad casera, incluye un editor de texto, una hoja de cálculo, un gestor de bases de datos y un planificador de proyectos.[119]​\nMicrosoft Digital Image: Programa de retoque fotográfico.[120]​"}]}, {"name": "Divisiones", "text": "", "subsections": [{"name": "Office Experience Group", "text": "La División de Office Experience Group (OXO) se encarga en el desarrollo de la suite de ofimática Microsoft Office. Microsoft Office incluye varios programas, entre los que destacan Word (procesador de textos), Access (aplicación para base de datos), Excel (hoja de cálculo), Outlook (agenda electrónica), frecuentemente usado con Exchange Server), PowerPoint (software de presentación de diapositivas) y Publisher (realización de diferentes publicaciones). A partir de la versión 2003, se incluyen nuevos programas como Visio, Project, MapPoint, InfoPath y OneNote.[121]​ Cabe destacar que, anterior al desarrollo de Excel, Microsoft ya comercializaba un programa de hojas de cálculo llamado Multiplan para el sistema operativo CP/M.[14]​\nLa división se centra en el desarrollo de aplicaciones para gestiones empresariales. Fue creada en el año 2001 tras la adquisición de la empresa Great Plains, empresa de software.[122]​ Tras esto, Microsoft adquirió Navision para tener una entrada similar en Europa.[123]​ El resultado de esta operación fue la publicación en 2006 Microsoft Dynamics NAV, software Planificación de recursos empresariales de planificación de recursos desarrollado inicialmente por Navision, empresa que además comercializaba las aplicaciones Axapta y Solomon, orientadas a mercados similares. Todas estas aplicaciones se combinaron dentro de su software ERP.[124]​\nDentro de esta división, se encuentra la Mac Business Unit (MBU),[125]​ la división de Microsoft encargada del desarrollo de programas para la plataforma Mac OS X, por ejemplo, Office para Mac."}, {"name": "División Windows and Devices", "text": "Anteriormente con el nombre de Retail and Compusition[126]​ (en inglés, Platform Products and Services Division)[127]​ produce el producto estrella de la compañía, Windows. Además, es la encargada del servicio MSN.\nTambién desarrolla Microsoft Visual Studio, el conjunto de aplicaciones y herramientas de programación de la compañía. El producto se caracteriza por su fácil unión con las APIs de Windows, aunque debe ser configurado especialmente en el caso de que sea usado con librerías que no son de Microsoft. La versión actual es Visual Studio 2012. La versión anterior, Visual Studio 2010 tuvo un gran desarrollo respecto a sus predecesores, Visual Studio.Net 2003, nombrado posteriormente a .NET initiative, una iniciativa de Marketing que cubre un conjunto de tecnologías.\nLa División también se enfoca en la producción de hardware, creando productos como Microsoft HoloLens con el software de Windows Holographic, además de fabricar ratones, teclados, gamepads, la línea de tabletas Surface y de la línea de productos de Xbox.\nEl 5 de febrero de 2020 Microsoft anuncia la fusión de las divisiones Retail and Compusition y de Device and Entertainment reestructurándose internamente nombrándose Windows and Devices quien será dirigido por Panos Panay con el propósito de agilizar el desarrollo de los productos a largo plazo, manteniendo el rol de desarrollo de los próximos sistemas operativos Windows y de las próximas versiones de Microsoft Surface.[128]​"}, {"name": "LinkedIn Corporation", "text": "Es una división de Microsoft, adquirida desde el 13 de junio de 2016. La división es una comunidad social destacada por su red social del mismo nombre, enfocándose hacia las empresas, negocios y el empleo. Permitiendo al usuario tener la necesidad de navegar en diferentes perfiles empresariales encontrando los puestos de trabajo que más dese, también permite buscar perfiles de diferentes usuarios. Sin embargo, la corporación también ofrece herramientas digitales en línea para estudiantes y empleados de oficina con sus filiales Lynda.com, SlideShare y Connectifier."}, {"name": "Skype Technologies", "text": "La división Skype es una empresa luxemburguesa conocido por desarrollar la aplicación que utiliza el mismo nombre de la empresa, mostrando la capacidad de comunicarse a base de texto, audio, y vídeo a través de Internet (VoIP). La empresa fue adquirida por Microsoft el 10 de mayo de 2011, formando parte de las divisiones de la corporación."}, {"name": "Microsoft Gaming", "text": "La propia compañía desarrolla y publica sus propios videojuegos tanto para las videoconsolas Xbox como para Windows, con la ayuda de su principal filial Xbox Game Studios, así como de ZeniMax Media y Activision Blizzard.[129]​ Algunos juegos destacados producidos por Microsoft son Age of Empires, Banjo-Kazooie, Battletoads, Bilnx, Crackdown, Fable, Forza Motorsport, Gears of War, Halo, Killer Instinct, Minecraft, Ori, Perfect Dark, Zoo Tycoon, State of Decay, Solitario Microsoft y Microsoft Flight Simulator (simulador de vuelo) entre otros títulos."}, {"name": "Microsoft Press", "text": "Microsoft Press es el brazo editorial de Microsoft, la publicación de libros por lo general se ocupa de las distintas tecnologías de Microsoft actual. Microsoft Press presentó por primera vez los libros El Libro de Apple Macintosh Cary Lu y reflexiones para el IBM PC por Peter Norton en 1984 en la Costa Oeste Computer Faire. El editor fue a liberar libros reconocibles por otros autores como Charles Petzold, Steve McConnell, Mark Russinovich y Jeffrey Richter. Microsoft Press distribuye sus títulos a través de la Safari Books Online e-servicio de referencia."}, {"name": "Microsoft Mobile (2014 - 2016)", "text": "Microsoft Mobile fue una división de Microsoft, con sede en Finlandia, dedicada al diseño y fabricación de teléfonos móviles. Comercializa la gama Lumia. Tiene su origen en la compra por parte de Microsoft de la división de Dispositivos y Servicios de Nokia, completada el 25 de abril de 2014.[130]​ En octubre de 2017 fue cerrado la división tras las bajas ventas del producto Lumia."}]}, {"name": "Cultura de negocios", "text": "Redmond recluta a jóvenes universitarios desarrolladores de software y los mantiene en la empresa. La toma de decisiones se lleva a cabo por desarrolladores. Se podría decir que los desarrolladores de software en Microsoft están considerados como las \"estrellas\" de la compañía, mientras que en otras empresas como en IBM, estas son los agentes de venta.[131]​[132]​\nMicrosoft realiza pruebas a los productos que fabrica en situaciones reales.[133]​ La compañía es también conocida por su proceso de contratación, llamado \"Microsoft interview\" («entrevista de Microsoft»), este proceso ha sido imitado por otras compañías.[134]​ Por diversión, Microsoft acoge en el Campus de Redmond el rompecabezas de Microsoft, un juego de competición en el que varios equipos compiten para resolver una serie de puzles.[135]​\nEn 2006, los empleados de Microsoft, sin incluir a Bill Gates, donaron cerca de 2500 millones de dólares a ONGs, convirtiendo a la compañía en la primera del mundo en donaciones por empleado.[136]​ En Estados Unidos, Microsoft iguala las donaciones que, hechas por sus empleados, en total, anualmente dona cerca de 12 mil millones de dólares.[137]​ En 2004, Bill Gates encabezó la lista de los mayores filántropos del mundo, donando cerca de 30 mil millones de dólares.[138]​ En el año 2006, Gates y su esposa, Melinda Gates, fueron galardonados con el Premio Príncipe de Asturias a la Cooperación Internacional, el jurado valoró \"el ejemplo que representan de generosidad ante los males que asuelan el mundo\".[139]​", "subsections": []}, {"name": "Cultura de usuario", "text": "En Microsoft Developer Network (o MSDN) se encuentran disponibles referencias técnicas para desarrolladores y artículos de varias revistas de Microsoft como Microsoft Systems Journal. MSDN además permite la suscripción para usuarios y compañías. Existen además suscripciones más caras que ofrecen acceso a versiones beta antes de su publicación.[141]​[142]​ En años recientes, Microsoft lanzó un sitio web para la comunidad de desarrolladores y usuarios llamado Channel9, con herramientas modernas como un foro y una wiki.[143]​ Otra web que proporciona diariamente videos y otros servicios, On10.net, fue publicada el 3 de marzo de 2006.[144]​\nLa mayor parte del soporte técnico que ofrece Microsoft se hace a través de grupos de noticias de Usenet. Existen varios grupos de noticias para cada producto de la empresa, y a menudo están supervisados por empleados de la compañía.[145]​ Los usuarios que colaboran y ayudan pueden ser elegidas por otros usuarios o empleados de Microsoft para que se les conceda el estatus de Microsoft Most Valuable Professional (MVP), estos usuarios tienen además posibilidades de ganar premios u otros beneficios.[146]​[147]​", "subsections": []}, {"name": "Campus de Redmond", "text": "La sede principal de Microsoft se encuentra en la ciudad de Redmond, a 21 kilómetros de Seattle. En ella se encuentra el Campus de Redmond de Microsoft, un complejo de más de 80 edificios donde se encuentran sus trabajadores, entre los que se encuentran, junto a programadores; empleados de limpieza, jardineros y cocineros, entre otros. El Campus cuenta con oficinas, viviendas, un museo, un paseo conmemorativo de cada producto lanzado por la empresa y un lago llamado \"Bill\" en honor a Gates. En total en estas instalaciones viven cerca de 45.000 personas.[148]​[131]​\nLa vida en el Campus se rige por unas normas estrictas, como la prohibición de fumar dentro del edificio y a menos de diez metros de la entrada y en cuanto a la distribución de los despachos, los despachos que estén cerca de la ventana son reservados para los trabajadores con más experiencia, los interiores quedan para los que tengan menos experiencia. También se permite a los trabajadores personalizar sus habitaciones, pero se prohíbe pintar las paredes, ya que son frecuentes los traslados de habitaciones.[131]​", "subsections": []}, {"name": "Asuntos corporativos", "text": "", "subsections": [{"name": "Estructura corporativa", "text": "La empresa es dirigida por un Consejo de administración compuesto por diez personas, la mayoría de ellas no guarda relación directa con ella. Los actuales miembros de la junta directiva son: Steve Ballmer, James Cash, Dina Dublon, Bill Gates, Raymond Gilmartin, Reed Hastings, David Marquardt, Charles Noski, Helmut Panke, y Jon Shirley.[149]​ Los diez miembros de la junta directiva son elegidos cada año en la junta de accionistas, y los que no obtienen una mayoría de votos debe presentar una renuncia al Consejo, que posteriormente debe elegir si acepta o no la dimisión. Hay cinco comisiones dentro de la junta que supervisan cuestiones más específicas. Estos comités incluyen el Comité de Auditoría, que se ocupa de las cuestiones de la contabilidad con la empresa incluida la auditoría y presentación de informes, la Comisión de Compensación, que aprueba la compensación recibida por el presidente y los empleados de la empresa, el Comité de Finanzas, que se ocupa de los asuntos financieros, como proponer las fusiones y adquisiciones, El Comité de Nombramientos y Gobernanza, que se ocupa de diversas cuestiones de las empresa, en particular el nombramiento de la junta directiva y el Comité de Cumplimiento Antimonopolio, que trata de impedir las prácticas de la compañía de violar las leyes antimonopolio.[150]​[151]​\nExisten otros aspectos en la estructura organizativa de Microsoft. Para asuntos globales existe el equipo ejecutivo, compuesto por dieciséis funcionarios de la empresa en todo el mundo, que se encargan de diversas funciones. Además del equipo ejecutivo está también el Consejo de Personal Corporativo, que se ocupa de todas las funciones claves del personal de la empresa, incluyendo la aprobación de las políticas corporativas. Otros ejecutivos son el presidentes y vicepresidentes de las distintas divisiones de productos, los dirigentes de la sección de marketing, y el Gerente de Informática, entre otros.[152]​[153]​"}, {"name": "Acciones", "text": "Cuando la compañía lanzó el 13 de marzo de 1986 su Oferta Pública de Venta, el precio de las acciones fue de 21 dólares por acción.[154]​[155]​ Al cierre del primer día, las acciones habían cerrado en 28 dólares.[155]​ El cierre inicial y subsiguiente aumento en los años siguientes convirtió en millonarios a varios de sus empleados que poseían acciones de la empresa.[156]​[157]​[158]​ El precio de las acciones llegó a su máximo en 1999, con un valor en torno a los 119 dólares por acción. La empresa sin embargo dejó de ofrecer dividendos hasta el año 2003.[156]​[155]​ A partir de ese año, el valor de las acciones ha ido cayendo hasta situarse en 25,90 dólares (noviembre de 2010).[159]​"}, {"name": "Diversidad", "text": "Microsoft ha recibido diversos reconocimientos por sus políticas contra la discriminación por orientación sexual, en el año 2001, la agrupación Los Angeles Gay & Lesbian Center galardonó a Microsoft con el premio Corporate Vision Award, que es otorgado anualmente a la persona u organización que destaque en su apoyo a los homosexuales.[160]​\nEn 2005, Microsoft recibió una calificación de 100% en el \"Índice de Igualdad Corporativa\" de la Campaña de Derechos Humanos, una clasificación de las empresas según sus políticas en materia LGBT(lesbianas, gais, bisexuales y transexuales). Esta calificación se ha obtenido en parte gracias a la labor del grupo Gay and Lesbian Employees at Microsoft (empleados gais y lesbianas de Microsoft), conocido con las siglas de GLEAM, Microsoft introdujo en sus políticas contra la discriminación la libertad de género y condicións en abril de 2005. Experimentando un aumento en su calificación desde el 86% en 2004 hasta el 100% en 2005.[cita requerida]\nEn el mismo informe del año 2006, Microsoft consiguió por segundo año consecutivo la calificación de 100.[161]​[162]​\nEn abril de 2005, Microsoft recibió críticas por retirar el apoyo a Washington del proyecto de ley HB 1515, que ampliaba las leyes contra la discriminación a las personas por su orientación sexual. Microsoft fue acusado de ceder a las presiones locales del pastor evangélico Ken Hutcherson, que se reunió con un alto ejecutivo de la empresa amenazándole con boicotear los productos de la compañía. Microsoft reveló que estaba pagando al evangélico conservador Ralph Reed de la compañía Century Strategies 20000 dólares al mes.[163]​ Más de 2000 empleados firmaron una petición pidiendo a Microsoft el restablecimiento del apoyo al proyecto de ley.[164]​ Bajo estas duras críticas desde dentro y fuera de Microsoft, se decidió apoyar el proyecto de ley de nuevo en mayo de 2005.[165]​[166]​[167]​\nMicrosoft contrata a trabajadores tanto extranjeros como nacionales, y se declara en contra de las limitaciones sobre los visados H1B; que permiten a las empresas de los Estados Unidos contratar trabajadores extranjeros. Bill Gates denuncia que las limitaciones al visado H1B hacen difícil contratar empleados para la compañía.[168]​[169]​"}, {"name": "Logotipos y eslóganes", "text": "En 1982, Microsoft estrenó logotipo, llamado \"Bibblet\", que se caracterizaba por tener una letra \"O\" extravagante.[170]​\nEn 1987, Microsoft adoptó su anterior logotipo, llamado el \"Pacman Logo\" y diseñado por Scott Baker.[171]​[172]​[173]​ A este logotipo se le añadió, desde el año 1992 hasta el 2002, el eslogan \"Where do you want to go today?\" (¿Hasta dónde quieres llegar hoy?).[174]​[175]​ Ya en el año 2005, se ha añadido el eslogan \"Your potential, our passion\" (\"Tu potencial, nuestra pasión\"), al logotipo de la compañía.[176]​\nEl 23 de agosto de 2012, Microsoft reveló su nuevo logotipo que consiste en 4 cuadrados de colores rojo, verde, azul y amarillo; haciendo alusión al anterior logo de Windows y a la vez a la nueva interfaz que se viene aplicando a sus productos; representando el rojo a Office, el azul a Windows, el verde a Xbox, y el amarillo a Bing. A su costado, la palabra Microsoft en tipo de letra Segoe UI."}]}, {"name": "Críticas y controversias", "text": "Desde 1980, Microsoft ha sido objeto de controversia en la industria informática. Sus tácticas de negocios han sido objeto de crítica, a menudo descritas por la propia empresa con el lema de \"Adoptar, extender y extinguir\". Microsoft inicialmente adopta un estándar o producto, para después producir versiones de sus productos incompatibles con el estándar, que termina extinguiéndose e impide a la competencia utilizar la nueva versión del producto.[177]​ Estas tácticas han dado lugar a que diversas empresas y gobiernos interpongan demandas contra la empresa, en general, fue demandada varias veces.[178]​[179]​[180]​[181]​[182]​\nMicrosoft ha sido llamada como una \"mano de acero en guante de seda\", en referencia a las acusaciones a la empresa por el trabajo realizado por sus empleados ya que este puede ser perjudicial para la salud. Esta descripción se usó por primera vez en un artículo de la revista Seattle Times en el año 1989 y posteriormente ha sido empleada por empleados de Microsoft para describir a la compañía.[183]​[184]​\nLos partidarios del software libre se muestran preocupados por la formación de la Trusted Computing Platform Alliance (TCPA), formada por un grupo de empresas entre las que destacan Microsoft e Intel que ha impulsado, alegando que de esta forma se producirá un aumento de la seguridad y privacidad en la computadora de los usuarios, una estrategia denominada Trusted Computing. La TCPA ha sido vista por sus detractores como un medio para permitir a los desarrolladores de software para imponer algún tipo de restricción en su software.[cita requerida]\nLos detractores de Microsoft también discrepan con la promoción de la Gestión de derechos digitales (DRM) y el Coste total de propiedad (CTP). La Gestión de los derechos digitales es una tecnología que permite a los proveedores de contenido a imponer restricciones a los métodos y a la forma en que sus productos son usados. Los detractores del DRM sostienen que esta tecnología puede infringir el uso legítimo y de otros derechos, Dado que restringe actividades legales como la remezcla o la reproducción de material para su uso en presentaciones de diapositivas.[186]​\nCríticas más recientes están relacionadas con los derechos de autor (véase el Caso Pónosov) y la censura de Internet en la República Popular China.\nMicrosoft, junto a otras empresas como Google, Yahoo, Cisco, AOL y Skype entre otras, colaboraron con el gobierno de China implementando un sistema de censura.[187]​[188]​\nOrganizaciones en defensa de los derechos humanos como Human Rights Watch (HRW) y Reporteros sin fronteras han criticado[189]​\na estas compañías y considerando como irónico que estas empresas cuya existencia depende de la libertad de información tomen actitudes censoras.\nMicrosoft fue señalada, entre otras compañías desarrolladoras de productos de tecnología informática de punta, como una de las involucradas dentro del programa de vigilancia electrónica de alto secreto (Top Secret) PRISM, a cargo de la Agencia de Seguridad Nacional (NSA) de los Estados Unidos, según los informes y documentos filtrados por el ex informante y empleado de la Agencia Central de Inteligencia (CIA), Edward Snowden en junio de 2013 (véase datos acerca de la vigilancia mundial).[190]​[191]​\nEn 2014, la privacidad de Microsoft se puso en entredicho, la SEA (Syrian Electronic Army) filtró un documento donde se mostraban los pagos que había recibido Microsoft por venderle datos de usuarios al FBI. Esta filtración hizo saltar la polémica entre los internautas, además, se le sumaba el reconocimiento por parte de Microsoft de haber leído el correo Hotmail de un exempleado sin tener una orden judicial.[cita requerida]\nEn este último caso, se acusó también a Microsoft de hipócrita por realizar este tipo de prácticas, ya que tiene varias campañas contra Google con su Gmail debido a que esta tiene robots encargados de buscar palabras claves para mostrar publicidad y así mantener el servicio. Aun así, casi todas las grandes empresas de Internet se reservan el derecho de leer el correo de sus usuarios (Microsoft, Google, Yahoo y Apple), pero hasta la fecha el único caso confirmado es el de Microsoft, aunque en su momento se acusó a Google de lo mismo. Microsoft, por su parte, actualizó sus políticas de privacidad, aunque en ningún momento se renuncia al derecho de poder leerlo.[192]​\nEl 19 de julio de 2024, una interrupción global de TI afectó los servicios de Microsoft y afectó a empresas, aerolíneas e instituciones financieras en todo el mundo. La interrupción se debió a una actualización defectuosa del software de ciberseguridad de CrowdStrike, que provocó que los sistemas de Microsoft fallaran y causaran interrupciones en varios sectores. A pesar de que el director ejecutivo de CrowdStrike, George Kurtz, aclaró que el problema no era un ataque cibernético, el incidente tuvo consecuencias generalizadas, provocando retrasos en los viajes aéreos, las transacciones financieras y los servicios médicos en todo el mundo. Microsoft declaró que la causa subyacente se había solucionado, pero reconoció impactos residuales continuos en algunas aplicaciones y servicios de Microsoft 365.[193]​[194]​", "subsections": []}, {"name": "Galería", "text": "1975-1980\n1982-1987\n1987-2012\nDesde 2012", "subsections": []}, {"name": "Referencias", "text": "↑ «Microsoft Corporation Form 10-K». U.S. Securities and Exchange Commission. 27 de julio de 2023. pp. 9, 58, 60. \n↑ Warren, Tom (8 de diciembre de 2016). «Microsoft finalizes $26 billion LinkedIn acquisition, reveals what’s next». The Verge (en inglés). Consultado el 24 de diciembre de 2021. \n↑ «The global marketplace for Flexible Office Space & Office Space Rental». www.officefreedom.com. Consultado el 24 de diciembre de 2021. \n↑ Keizer, Gregg (14 de julio de 2014). «Microsoft gets real, admits its device share is just 14%». Computerworld (en inglés). Consultado el 24 de diciembre de 2021. \n↑ «And Microsoft Is Giving Up On The Software Business!». Business Insider Australia (en inglés australiano). 23 de agosto de 2013. Archivado desde el original el 2 de agosto de 2017. Consultado el 24 de diciembre de 2021. \n↑ Blodget, Henry (23 de agosto de 2013). «And Microsoft Is Giving Up On The Software Business!». Insider (en inglés). Consultado el 26 de agosto de 2022. \n↑ «Microsoft To Acquire Peach Networks». Microsoft (en íngles). 29 de febrero de 2000. Archivado desde el original el 23 de diciembre de 2006. Consultado el 26 de eagosto del 2022. \n↑ «Microsoft shares at new high as cloud focus pays off». BBC News (en inglés británico). 21 de octubre de 2016. Consultado el 24 de diciembre de 2021. \n↑ «Microsoft's cloud focus could mean yet more layoffs». Engadget (en inglés estadounidense). Consultado el 24 de diciembre de 2021. \n↑ Pozzi, Sandro (1 de diciembre de 2018). «Microsoft supera a Apple como la mayor compañía cotizada». El País. ISSN 1134-6582. Consultado el 24 de diciembre de 2021. \n↑ EFE. «Microsoft supera el billón de dólares en Wall Street». El Sol de México | Noticias, Deportes, Gossip, Columnas. Consultado el 24 de diciembre de 2021. \n↑ Lu, Marcus (9 de febrero de 2022). «Infographic: American Companies That Failed i China». Visual Capitalist (en inglés). Consultado el 21 de febrero de 2022. \n↑ a b (en inglés)«Información para estudiandes, claves históricas de Microsoft». 1 de octubre de 2005. Archivado desde el original el 19 de julio de 2008. \n↑ a b (en inglés)«microsoft's timeline from 1975 - 1990». Archivado desde el original el 14 de mayo de 2008. Consultado el 2007. \n↑ «Microsoft» (en portugués). CESGA. p. 1. Archivado desde el original el 8 de abril de 2007. Consultado el 1 de abril de 2008. \n↑ «History of Microcomputers 1977-1980» (en inglés). Pcbiography. 5 de marzo de 2002. p. 1. Archivado desde el original el 28 de abril de 2008. Consultado el 6 de abril de 2008. \n↑ «Qué significa Xenix - Información y significado de Xenix». Consultado el 20 de abril de 2007. \n↑ «El éxito de Microsoft se fraguó cuando IBM decidió usar su sistema operativo». 7 de noviembre de 2002. Consultado el 2007. \n↑ (en inglés)Smart Computing, ed. (1999). «Booting Your PC: Getting Up Close & Personal With A Computer’s BIOS». Consultado el 2 de septiembre de 2006. \n↑ (en inglés)«MS DOS and PC DOS». Lexikon's History of Computing. Archivado desde el original el 24 de junio de 2006. Consultado el 5 de julio de 2006. \n↑ (en inglés)Smart Computing, ed. (2002). Microsoft to Microsoft disk operating system (MS-DOS). Consultado el 5 de julio de 2006. \n↑ (en inglés) Manek Dubash (19 de julio de 2005). «Techworld Article:OS/2 users must look elsewhere». Techworld (IDG). Consultado el 5 de julio de 2005. \n↑ «Windows: 20 años en las tiendas». elmundo.es. 21 de noviembre de 2005. \n↑ (en inglés)«Microsoft Systems Journal». 1986. Consultado el 2007. \n↑ «Historial de Microsoft - 1989». La historia de Microsoft. Microsoft. 14 de mayo de 2009. Archivado desde el original el 12 de diciembre de 2023. Consultado el 12 de diciembre de 2023. «El 19 de junio de 1989 Office para Macintosh está disponible. Las aplicaciones macintosh incluyen: Word 4.00, Excel 2.20, PowerPoint 2.01 y Mail 1.37. Las cuatro aplicaciones proporcionan las herramientas para realizar tareas empresariales esenciales de la mayoría de los profesionales empresariales. *esta es la primera versión de Office*». \n↑ a b «El exitoso Windows 3.0». Consultado el 6 de abril de 2008 de 2007.  La referencia utiliza el parámetro obsoleto |añoacceso= (ayuda)\n↑ a b c d «Definición de Windows». Consultado el 6 de abril de 2008. \n↑ David Both (3 de julio de 2006). «History» (en inglés). OS2. Archivado desde OS/2 el original el 20 de julio de 2006. Consultado el 12 de abril de 2008. \n↑ (en inglés) McCracken, Harry (13 de septiembre de 2000). A Peek at Office Upgrade. PCWorld.com. Archivado desde el original el 7 de septiembre de 2005. Consultado el 4 de julio de 2006. \n↑ (en inglés) «Microsoft Company 15 September 1975». The History of Computing Project. Archivado desde el original el 23 de julio de 2005. Consultado el 11 de agosto de 2005. \n↑ «noticias Crónicas de la Informática». Consultado el 6 de abril de 2008. \n↑ «Bill Gates: Cómo hizo historia 2004». noticiasdot. 26 de agosto de 2004. Archivado desde el original el 6 de julio de 2008. Consultado el 9 de abril de 2008. \n↑ «Hasta la vista, Netscape». El Mundo (España). 29 de diciembre de 2007. Consultado el 9 de abril de 2008. \n↑ «25 AÑOS DE ‘MS’». El Mundo (España). 29 de diciembre de 2007. Consultado el 9 de abril de 2008. \n↑ a b «Los 10 grandes fracasos». fmtiempo. 16 de octubre de 2007. p. 3. Consultado el 10 de abril de 2008. \n↑ «MSN Encarta». Encarta. Archivado desde el original el 8 de marzo de 2008. Consultado el 10 de abril de 2008. \n↑ «Sala de prensa de Microsoft». Microsoft. 18 de marzo de 2005. Consultado el 10 de abril de 2008. \n↑ «Microsoft timeline from 1991» (en inglés). Thocp. Archivado desde el original el 23 de julio de 2005. Consultado el 10 de abril de 2008. \n↑ \"The Washington Post\" compra revista online \"Slate\" (22/12/2004) noticiasdot.com\n↑ «Preguntas y respuestas de Windows CE». Microsoft. 27 de octubre de 2000. Consultado el 10 de abril de 2008. \n↑ Criado, Miguel Angel (2 de enero de 2008). Adiós al viejo rey de todos los navegadores. Público. Consultado el 12 de abril de 2008. \n↑ Amor, Pablo (18 de marzo de 2002). «'Caso Microsoft': Diario de un proceso interminable». Cinco Días. Consultado el 12 de abril de 2008. \n↑ a b Microsoft compra Hotmail (2/1/1998)\n↑ a b Parrado, Julio (14 de enero de 2000). «Bill Gates cede la dirección de Microsoft a su «número dos» Steve Ballmer». El Mundo. Consultado el 12 de abril de 2008. \n↑ Cernuda, Olalla (24 de julio de 1998). «Windows 98 ya «navega» desde ayer en las computadoras españolas». El Mundo. Consultado el 12 de abril de 2008. \n↑ «Versiones de Windows (de Windows 1.0 a Windows 98 SE).». Consultado el 12 de abril de 2008. \n↑ «Definición de Windows 98». Consultado el 12 de abril de 2008. \n↑ Mauricio Angulo (21 de febrero). «Una de patentes: AT&T vs Microsoft». Archivado desde el original el 7 de marzo de 2008. Consultado el 12 de abril de 2008. \n↑ «Windows Live Messenger». Microsoft Corporation. p. 1. Archivado desde el original el 5 de abril de 2008. Consultado el 6 de abril de 2008. \n↑ «Historia de Windows» (gif). Consultado el 13 de abril de 2008. \n↑ «Windows history» (en inglés). Consultado el 13 de abril de 2008. \n↑ a b Microsoft lanza su Windows 2000 en medio de la polémica. El Mundo (España). 18 de febrero de 2000. Consultado el 13 de abril de 2008. \n↑ «El éxito del mercado de servidores: Windows 2000 (2000 - 2001)» (gif). Consultado el 13 de abril de 2008. \n↑ «Definición de Directorio Activo» (gif). Consultado el 13 de abril de 2008. \n↑ Parrado, Julio (28 de noviembre de 2000). Microsoft apela a los tribunales para evitar su división en varias compañías. El Mundo (España). Consultado el 13 de abril de 2008. \n↑ «Windows Millenium - ¿Qué es? ¿Me funcionará?». Consultado el 14 de abril de 2008. \n↑ a b El fracaso de Windows Millennium Edition (2000, 2001) alegsa.com.ar\n↑ Bill Gates anuncia que abandonará en dos años la gestión diaria de Microsoft para dedicarse a su fundación. Libertad Digital. 14 de junio de 2007. Consultado el 14 de abril de 2008. \n↑ Microsoft lanza Windows XP. DiarioTi. 26 de octubre de 2001. Archivado desde el original el 20 de abril de 2008. Consultado el 14 de abril de 2008. \n↑ a b «Historia de Windows» (doc). Archivado desde el original el 10 de octubre de 2008. Consultado el 19 de abril de 2008. \n↑ «Windows XP y su nueva interfaz». La Nación. 29 de diciembre de 2007. Consultado el 19 de abril de 2008. \n↑ «Curso de Windows XP, Novedades de Windows». Consultado el 20 de mayo de 2008. \n↑ Microsoft advierte de otro fallo de seguridad \"importante\" en Windows XP y Server 2003. Libertad Digital. 12 de mayo de 2004. Consultado el 20 de mayo de 2008. \n↑ Microsoft alerta de seis fallos de seguridad en Windows, tres de ellos críticos. ABC. 11 de julio de 2007. Consultado el 20 de mayo de 2008. \n↑ «Información de sistemas operativos». Archivado desde el original el 28 de octubre de 2011. Consultado el 4 de septiembre de 2011. \n↑ Lanzamiento de Xbox el 8 de noviembre. diario TI. 21 de mayo de 2001. Archivado desde el original el 5 de junio de 2008. Consultado el 20 de mayo de 2008. \n↑ «Xbox 360 en el mercado de videojuegos». Consultado el 20 de mayo de 2008. \n↑ a b Microsoft lanza el nuevo Windows Server 2003, dos veces más veloz que la versión anterior (24/04/2003) cincodias.com\n↑ Las 10 ventajas principales de Windows Server 2003 microsoft.com (10/7/2007)\n↑ Sanciones de la Unión Europea a Microsoft lukor.com\n↑ Microsoft y la CE acuerdan el nombre de la versión reducida de Windows (28/3/2005) elmundo.com\n↑ (en inglés)Un largo adiós: Bill Gates prepara su retiro en dos años (21/07/2006) microsoft.com\n↑ Microsoft retrasa el lanzamiento de Windows Vista para particulares hasta enero de 2007 (22/03/2006) elpais.com\n↑ ¿Nuevo retraso de Windows Vista? (03/05/2006) elmundo.com\n↑ Windows Vista podría retrasarse hasta mediados de 2007 Archivado el 19 de noviembre de 2009 en Wayback Machine. clarin.com\n↑ a b Diferentes ediciones de Windows Vista microsoft.com\n↑ Windows Vista Home Premium microsoft.com\n↑ Windows Vista Business microsoft.com\n↑ Windows Vista Ultimate microsoft.com\n↑ Windows Vista Enterprise microsoft.com\n↑ Windows Vista Starter microsoft.com\n↑ Windows Vista Business N microsoft.com\n↑ Windows Vista, más seguro microsoft.com\n↑ «Estadísticas de fallos XP Vs. Vista durante los seis primeros meses de Vista». noticias3d.com. 25 de junio de 2007. p. 1. Consultado el 9 de abril de 2008. \n↑ «Comparando el índice de fallos de seguridad en XP+Vista y Mac OS X». Geek.ms. 21 de diciembre de 2007. p. 1. Consultado el 9 de abril de 2008. \n↑ Office 2007 de Microsoft® Lenovo\n↑ a b Microsoft quiere comprar a Yahoo (1/2/2008) BBC\n↑ «Yahoo dice que su directorio estudiará propuesta de Microsoft». Archivado desde el original el 10 de agosto de 2018. \n↑ Rechaza Yahoo oferta de Microsoft Archivado el 4 de julio de 2008 en Wayback Machine. (9/2/2008) El universal\n↑ «Acuerdo entre Microsoft y Yahoo». euroresidentes.com. 19 de julio de 2009. \n↑ «Microsoft y Yahoo! se alían para plantar cara a Google». elpais.com. 29 de julio de 2009. \n↑ (En inglés) «Choice. Value. Innovation.». Archivado desde el original el 15 de enero de 2010. Consultado el 7 de enero de 2010. \n↑ «Microsoft lanza el 22 de noviembre su nueva consola Xbox». BBC News. 4 de septiembre de 2013. Consultado el 4 de diciembre de 2019. \n↑ «Microsoft anuncia 3000 nuevos despidos.» El País.\n↑ «Microsoft toma la decisión de desarrollar sus propios Chips ARM». 19 de diciembre de 2020. \n↑ Weise, Karen (25 de octubre de 2022). «Microsoft Reports Slowest Revenue Growth in Five Years». The New York Times. Consultado el 26 de octubre de 2022. \n↑ Sánchez-Vallejo, María Antonia (25 de octubre de 2022). «Microsoft registra en el tercer trimestre el crecimiento más lento de los últimos cinco años». El País. Consultado el 4 de febrero de 2023. \n↑ Kharpal, Matt Clinch,Arjun. «Microsoft buys near 4% stake in London Stock Exchange Group as part of 10-year cloud deal». CNBC (en inglés). Consultado el 4 de febrero de 2023. \n↑ Weise, Karen (18 de enero de 2023). «Microsoft to Lay Off 10,000 Workers as It Looks to Trim Costs». The New York Times (en inglés estadounidense). ISSN 0362-4331. Consultado el 4 de febrero de 2023. \n↑ «Microsoft under fire for hosting private Sting concert for its execs in Davos the night before announcing mass layoffs». Fortune (en inglés). Consultado el 4 de febrero de 2023. \n↑ Capoot, Ashley. «Microsoft announces new multibillion-dollar investment in ChatGPT-maker OpenAI». CNBC (en inglés). Consultado el 4 de febrero de 2023. \n↑ Warren, Tom (13 de octubre de 2023). «Microsoft completes Activision Blizzard acquisition, Call of Duty now part of Xbox». The Verge (en inglés). Consultado el 13 de octubre de 2023. \n↑ «¿Qué es BizTalk Server 2006?». Microsoft Corporation. Consultado el 8 de abril de 2008. \n↑ «Exchange 2007 Preguntas frecuentes». Microsoft Corporation. Consultado el 8 de abril de 2008. \n↑ «Internet Security and Acceleration (ISA) Server» (en inglés). Microsoft Corporation. Consultado el 8 de abril de 2008. \n↑ «Descripción de Microsoft Operations Manager 2000». Microsoft Corporation. Consultado el 8 de abril de 2008. \n↑ «Introducción a Microsoft Office SharePoint Server 2007». Microsoft Corporation. Archivado desde el original el 8 de abril de 2008. Consultado el 8 de abril de 2008. \n↑ «Información del Producto de Microsoft SQL Server 2005». Microsoft Corporation. Consultado el 8 de abril de 2008. \n↑ «Descripción general de Systems Management Server 2003». Microsoft Corporation. Consultado el 8 de abril de 2008. \n↑ «Preguntas más frecuentes acerca de Microsoft Office Project 2007». Microsoft Corporation. Archivado desde el original el 10 de abril de 2008. Consultado el 8 de abril de 2008. \n↑ Visual Studio 2005\n↑ Página de Internet Explorer microsoft.com\n↑ Descarga el navegador web Microsoft Edge | Microsoft Consultado el 11 de agosto de 2021\n↑ «Skype ha sido comprado por Microsoft». Archivado desde el original el 28 de enero de 2012. Consultado el 22 de febrero de 2012. \n↑ «Windows Live» (en inglés). Microsoft Corporation. Archivado desde el original el 9 de mayo de 2008. Consultado el 8 de abril de 2008. \n↑ Página de inicio de Encarta microsoft.com\n↑ «MSN Encarta : Enciclopedia en línea, diccionario, atlas y mucho más». web.archive.org. 27 de octubre de 2009. Archivado desde el original el 27 de octubre de 2009. Consultado el 13 de noviembre de 2017. \n↑ «Smartphones y Pocket PC con tecnología Windows Mobile 5.0». Microsoft Corporation. Consultado el 8 de abril de 2008. \n↑ «Información del producto Works 9». Microsoft Corporation. Consultado el 8 de abril de 2008. \n↑ «Microsoft Picture It! Premium 2005» (en inglés). Microsoft Corporation. Consultado el 8 de abril de 2008. \n↑ «Preguntas más frecuentes acerca de Office Professional Enterprise Edition 2003». Microsoft Corporation. p. 1. Consultado el 5 de abril de 2008. \n↑ Microsoft adquiere una empresa de software por 1.100 millones de dólares Archivado el 21 de abril de 2008 en Wayback Machine. (baquia.com)\n↑ Microsoft adquiere Navision por 1.500 millones de euros (cincodias.com)\n↑ Prweb (13 de enero de 2006). «Microsoft Dynamics AX: ERP y el mercado de las integraciones, implementaciones y customizaciones nuevamente». Ambosmedios.com. p. 1. Archivado desde el original el 21 de abril de 2008. Consultado el 6 de abril de 2008. \n↑ «MacBU moving into Microsoft Business Division». AppleInsider. 26 de mayo de 2010. \n↑ «Ejecutivos de Microsoft». Microsoft Corporation. p. 1. Consultado el 6 de abril de 2008. \n↑ «Microsoft College Careers - Platform Products and Services Division» (en inglés). Microsoft Corporation. p. 1. Consultado el 20 de mayo de 2008. \n↑ Miranda, Luis (5 de febrero de 2020). «Microsoft fusiona sus equipos de Windows y dispositivos con Panos Panay al frente». Hipertextual. Consultado el 13 de febrero de 2020. \n↑ Warren, Tom (26 de octubre de 2023). «Microsoft reorgs its Xbox and marketing teams to prepare for an AI and gaming future». The Verge (en inglés). Consultado el 27 de octubre de 2023. \n↑ «Nokia - Nokia». \n↑ a b c El guardián gallego de Bill Gates En este artículo se muestra el proceso por el que Microsoft incorpora a jóvenes a su sede en Redmond. (23/04/2007) elpais.com\n↑ Charles, John (Enero/Febrero 1998). «Indecent proposal? Doing Business With Microsoft». IEEE Software: 113-117. * Jennifer Edstrom; Marlin Eller (1998).  N.Y. Holt, ed. Barbarians Led by Bill Gates: Microsoft from inside. ISBN 0-8050-5754-4. * Fred Moody (1995).  Viking, ed. I Sing the Body Electronic: A Year With Microsoft on the Multimedia Frontier. ISBN 0-670-84875-1. * Michael A. Cusumano; Richard W. Selby (1995).  Free Press, ed. Microsoft Secrets: How the World's Most Powerful Software Company Creates Technology, Shapes Markets and Manages People. ISBN 0-684-85531-3. \n↑ (en inglés) Microsoft tests its own 'dog food' (21/7/2003) Zdnet\n↑ (en inglés) Square Manhole Covers and Crazy Questions Archivado el 29 de junio de 2017 en Wayback Machine. (21/5/2003) g4tv.com\n↑ (en inglés) Microsoft PuzzleHunt Redmond, WA, slightly more often than yearly\n↑ (en inglés) Microsoft and Its Employees Surpass $2.5 Billion Mark Through Charitable Donations (21/9/2006) microsoft.com\n↑ «Informe sobre la política ciudadana de Microsoft». 20minutos.es. 2003-09. Archivado desde el original el 8 de febrero de 2006. Consultado el 8 de abril de 2008. \n↑ «Bill Gates, el hombre más generoso de 2004». infobae.com. 5 de mayo de 2006. Archivado desde el original el 27 de octubre de 2012. Consultado el 8 de abril de 2008. \n↑ Fernández D. (5 de mayo de 2006). «Príncipe de Asturias para Bill Gates por «generoso»». 20minutos.es. Consultado el 8 de abril de 2008. \n↑ «Microsoft Building 92 - Microsoft Maps and Buildings». campusbuilding.com. \n↑ (en inglés) Suscripciones a MSDN microsoft.com\n↑ Microsoft Systems Journal Homepage microsoft.com\n↑ Microsoft's Channel 9 and Cultural Rules (04/11/2005) webpronews.com\n↑ «on10.net». Archivado desde el original el 28 de abril de 2006. \n↑ «Mensajes del grupo de Usenet microsoft.public.es.windowsxp». Archivado desde el original el 10 de agosto de 2011. Consultado el 2007. \n↑ Que es un MVP? msdn.com\n↑ Como logro ser reconocido como MVP? msdn.com\n↑ «El cuartel de Bill Gates». 24 de noviembre de 2004. \n↑ (en inglés)Microsoft PressPass – Microsoft Board of Directors\n↑ (en inglés)Microsoft 2005 Proxy Statement\n↑ (en inglés)Microsoft Corporation Corporate Governance Guidelines (1/8/2008)\n↑ (en inglés)Microsoft 2004 Citizenship Report\n↑ (en inglés)Microsoft Corporation Annual Report 2005(doc)\n↑ (en inglés)«Microsoft Stock and Shareholder Frequently Asked Questions». \n↑ a b c (en inglés)«Microsoft Pre-Split and Post-Split Closing Stock Prices». Archivado desde el original el 10 de octubre de 2009. (xls)\n↑ a b Los millonarios ex-Microsoft vuelven al ruedo político/económico Archivado el 21 de abril de 2008 en Wayback Machine. (31/05/2005) baquia.com\n↑ Microsoft elimina las stock options y con ellas el sueño de aspirantes a «millonario»(10/7/2003) abc.es\n↑ (en inglés)\"The Microsoft Millionaires Come of Age (29/5/2005) The New York Times\n↑ «Bill Gates y Steve Ballmer explican su venta masiva de acciones de Microsoft - Economía - elmundo.es». www.elmundo.es. \n↑ Premio para Microsoft por apoyo a homosexuales. 19 de diciembre de 2001. Archivado desde el original el 20 de mayo de 2008. Consultado el 28 de mayo de 2008. \n↑ «Gay, Lesbian, Bisexual and Transgender Employees at Microsoft» (en inglés). Consultado el 1 de junio de 2008. \n↑ «Corporate Equality Index: A Report Card on Gay, Lesbian, Bisexual and Transgender Equality in Corporate America» (pdf) (en inglés). hrc.com. Archivado desde el original el 8 de febrero de 2007. Consultado el 1 de junio de 2008. nota: El enlace al fichero original se encuentra roto por lo que se enlaza a una copia en el Internet Archive\n↑ Jamieson, Robert (27 de abril de 2007). Payments to Reed sully Microsoft (en inglés). Archivado desde el original el 14 de enero de 2009. Consultado el 26 de mayo de 2008. \n↑ «How Microsoft Changed Its Mind» (en inglés). businessweek.com. 12 de mayo de 2005. Consultado el 26 de mayo de 2008. \n↑ Microsoft respaldará los derechos de los gay. Archivado desde el original el 8 de enero de 2009. Consultado el 26 de mayo de 2008. \n↑ Anti-gay church vows to take control of Microsoft (en inglés). 17 de noviembre de 2007. Archivado desde el original el 10 de abril de 2008. Consultado el 26 de mayo de 2008. \n↑ Kaushik, Sandeep (25 de abril de 2005). Microsoft Caves on Gay Rights (en inglés). Consultado el 26 de mayo de 2008. \n↑ Bill Gates pide más visas de trabajo para extranjeros. 13 de diciembre de 2008. Archivado desde el original el 17 de abril de 2008. Consultado el 29 de mayo de 2008. \n↑ Mark, Roy (27 de abril de 2005). Gates Rakes Congress on H1B Visa Cap (en inglés). Consultado el 29 de mayo de 2008. \n↑ «Logotipo Bibblet de Microsoft, creado en 1982». Archivado desde el original el 24 de agosto de 2006. \n↑ (en inglés)«Microsoft Logo Design and History». Archivado desde el original el 12 de marzo de 2008. Consultado el 16 de marzo de 2008. \n↑ (en inglés)«Microsoft 1978». 15 de agosto de 2005. Archivado desde el original el 25 de enero de 2010. Consultado el 16 de marzo de 2008. \n↑ «Logotipo Pacman, logotipo usado por Microsoft desde el año 1986». \n↑ «Logotipo \"Pacman\" con el eslogan \"Where do you want to go today?\"». Archivado desde el original el 3 de octubre de 2008. \n↑ (en inglés)«The Rise and Rise of the Redmond Empire». Diciembre de 1998. \n↑ «Logotipo de Microsoft con el Slogan \"Your potential, our passion\"». Archivado desde el original el 8 de octubre de 2009. \n↑ Rodger, Will (9/11/19980). MIntel exec: MS wanted to 'extend, embrace and extinguish' competition (en inglés). Archivado desde el original el 6 de julio de 2008. Consultado el 20 de mayo de 2008. \n↑ Novell inicia acciones antimonopolio contra Microsoft por WordPerfect. 12 de noviembre de 2004. Consultado el 20 de mayo de 2008. \n↑ Microsoft Corp. Licenses Burst.com Patents & Settles Suit (en inglés). burst.com. 11 de marzo de 2005. Archivado desde el original el 4 de marzo de 2008. Consultado el 21 de mayo de 2008. \n↑ «Commission Decision of 24.03.2004 relating to a proceeding under Article 82 of the EC Treaty (Case COMP/C-3/37.792 Microsoft)» (pdf) (en inglés). Microsoft Corporation. Archivado desde el original el 28 de octubre de 2008. Consultado el 21 de mayo de 2008. \n↑ «Guía para entender el juicio a Microsoft». terra.es. Archivado desde el original el 1 de diciembre de 2007. Consultado el 25 de mayo de 2008. \n↑ Microsoft defiende ante la UE que todos los sistemas operativos tienen sus propios reproductores. elpais.com. 24 de abril de 2006. Consultado el 22 de mayo de 2008. \n↑ Paul Andrews (23 de abril de 1989). «Inside Microsoft - A 'Velvet Sweatshop' or a High-Tech Heaven?» (en inglés). The Seattle Times. Archivado desde el original el 29 de junio de 2012. Consultado el 23 de mayo de 2008. \n↑ «Microsoft Systems Journal 1997, Editor's note» (en inglés). Microsoft Systems Journal. Agosto de 1997. Consultado el 23 de mayo de 2008.  La referencia utiliza el parámetro obsoleto |mes= (ayuda)\n↑ Richard Stallman (2002). «¿Puede confiar en su computadora?». Consultado el 23 de mayo de 2008. \n↑ David Chisnall (4 de mayo). «DRM: Digital Rights or Digital Restrictions?» (en inglés). InformIT. Consultado el 25 de mayo de 2008. \n↑ Gutiérrez, Oscar (22 de junio de 2006). Google, Yahoo y Microsoft colaboran con la censura china. Archivado desde el original el 21 de abril de 2008. Consultado el 25 de mayo de 2008. \n↑ «Google, Microsoft y Yahoo! bloquean en China la prensa extranjera». elmundo.es. 10 de agosto de 2006. p. 1. Consultado el 6 de abril de 2008. \n↑ «China: Internet Companies Aid Censorship» (en inglés). Hrw. 10 de agosto de 2006. p. 1. Consultado el 6 de abril de 2008. \n↑ «Edward Snowden says motive behind leaks was to expose 'surveillance state'». The Washington Post (en inglés). 9 de junio de 2013. Consultado el 10 de junio de 2013. \n↑ Gellman, Barton; Blake, Aaron; Miller, Greg (9 de junio de 2013). «Edward Snowden comes forward as source of NSA leaks» (en inglés). The Washington Post. Consultado el 10 de junio de 2013. \n↑ «La privacidad de Microsoft en entredicho: pagos al FBI y accesos a la cuenta de un blogger sospechoso de filtraciones». Xatakawindows. 21 de marzo de 2014. Consultado el 10 de abril de 2014. \n↑ «Microsoft Cloud Technical Outage Updates». Bloomberg. 19 de julio de 2024. Consultado el 19 de julio de 2024. \n↑ «Internet Global Outage: CrowdStrike and Microsoft Downtime». Associated Press. 19 de julio de 2024. Consultado el 19 de julio de 2024. ", "subsections": []}, {"name": "Enlaces externos", "text": " Portal:Estados Unidos. Contenido relacionado con Estados Unidos.\n Portal:Washington. Contenido relacionado con Washington.\n Portal:Informática. Contenido relacionado con Informática.\nSitio web oficial (en español)\nPágina web de Windows\nFundación Bill y Melinda Gates\nMicrosoft en Facebook\nMicrosoft en Instagram\nMicrosoft en X (antes Twitter)\nMicrosoft en YouTube.\nMicrosoft en TikTok\nMicrosoft en Pinterest\nMicrosoft en Threads\nMicrosoft en LinkedIn", "subsections": []}]}
