{"url": "https://es.wikipedia.org/wiki/Teclado_(inform%C3%A1tica)", "title": "Teclado (informática)", "summary": "En informática, un teclado es un dispositivo de entrada, en parte inspirado en el teclado de las máquinas de escribir, que utiliza un sistema de puntadas o márgenes, para que actúen como palancas mecánicas o interruptores electrónicos que envían toda la información a la computadora o al teléfono móvil. Presenta teclas alfanuméricas (letras y números), de puntuación (punto, coma, dos puntos entre otras) y teclas especiales (las cuales cumplen ciertas funciones o se combinan en conjunto para lograr una función y evitar el uso del ratón).\nPor ejemplo:\nTeclas de edición\nTeclas de dirección", "sections": [{"name": "Historia", "text": "", "subsections": [{"name": "Primeros teclados", "text": "Además de teletipos y máquinas de escribir eléctricas como la IBM Selectric, los primeros teclados solían ser un terminal de computadora que se comunicaba por puerto serial con la computadora. Además de las normas de teletipo, se diseñó un estándar de comunicación serie, según el tiempo de uso basado en el juego de caracteres ANSI, que hoy sigue presente en las comunicaciones por módem y con impresora (las primeras computadoras carecían de monitor, por lo que solían comunicarse, o bien por luces en su panel de control, o bien enviando la respuesta a un dispositivo de impresión). Se usaba para ellos las secuencias de escape, que se generaban por combinaciones entre teclas, siendo una de las más usadas la tecla Ctrl.\nLa llegada de la computadora doméstica trae una inmensa variedad de teclados, tecnologías y calidades (desde los muy reputados por duraderos del Dragon 32 a la fragilidad de las membranas de los equipos Sinclair), aunque la mayoría de equipos incorporan la placa madre bajo el teclado, y es la CPU o un circuito auxiliar (como el chip de sonido General Instrument AY-3-8910 en los MSX) el encargado de leerlo. Son casos contados los que recurren o soportan comunicación serial (curiosamente es la tecnología utilizada en el Sinclair Spectrum 128 para el keypad numérico). Solamente los MSX establecerán una norma sobre el teclado, y los diferentes clones del TRS-80 seguirán el diseño del clonado."}, {"name": "Los teclados de IBM", "text": "Artículo principal:\nEl éxito de las computadoras personales de IBM en los años 1982 creó un estándar imitado por gran parte de la industria, esta estandarización también afectó a los teclados. Mientras que el teclado del IBM PC y la primera versión del IBM AT no tuvo influencia más allá de los clónicos PC, el Multifunción II (o teclado extendido AT de 101/102 teclas) aparecido en 1987 refleja y estandariza de facto el teclado moderno.\nTeclado XT de 83 teclas: se usaba en el PC XT (8086/88).\nTeclado AT de 84 teclas: usado con los PC AT (286/386).\nTeclado expandido de 101/102 teclas: es el teclado actual, con un mayor número de teclas.\nCon cuatro bloques diferenciados: un bloque alfanumérico con al menos una tecla a cada lado de la barra espaciadora para acceder a símbolos adicionales; sobre él una hilera de 10 o 12 teclas de función; a la derecha un teclado numérico, y entre ambos grandes bloques, las teclas de cursor y sobre ellas varias teclas de edición. Con algunas variantes este será el esquema usado por los Atari ST, los Commodore Amiga (desde el Commodore Amiga 500), los Sharp X68000, las estaciones de trabajo SUN y Silicon Graphics y los Acorn Archimedes/Acorn RISC PC. Solamente los Mac siguen con el esquema bloque alfanumérico + bloque numérico. Pero también producen teclados extendidos AT, sobre todo para los modelos con emulación PC por hardware."}, {"name": "El teclado Windows 7-10", "text": "Microsoft, además de hacerse un hueco en la gama de calidad alta y de presentar avances ergonómicos como el Microsoft Natural Keyboard, añade tres nuevas teclas tras del lanzamiento de Windows 95. A la vez se generalizan los teclados multimedia que añaden teclas para controlar en la PC el volumen, el lector de CD-ROM o el navegador, incorporan en el teclado altavoces, calculadora, almohadilla sensible al tacto o bola trazadora."}]}, {"name": "Teclado estándar", "text": "En 1987, IBM desarrolló el MF-II (Multifunción II o teclado extendido) a partir del AT. Sus características son que usa la misma interfaz que el AT, añade muchas teclas más, se ponen ledes y soporta el Scan Code set 3, aunque usa por defecto el 2. De este tipo hay dos versiones, la americana con 101 teclas y la europea con 102.4\nEl teclado está dividido en cuatro bloques:\nBloque de funciones: va desde la tecla F1 a F12, en tres bloques de cuatro: de F1 a F4, de F5 a F8 y de F9 a F12. Funcionan de acuerdo al programa o aplicación que esté abierto. Por ejemplo, en muchos programas al presionar la tecla F1 se accede a la ayuda asociada a ese programa. Además, a la izquierda de este bloque suele estar la tecla Esc.\nBloque alfanumérico: está ubicado en la parte inferior del bloque de funciones, contiene los números arábigos del 1 al 0 y el alfabeto organizado como en una máquina de escribir, además de algunas teclas especiales, como por ejemplo Tab ↹ (tabulador), ⇪ Bloq Mayús (Bloq Mayús), ⇧ Mayús (tecla Shift), Ctrl, ⊞ Win (tecla Windows), Alt, espaciador, Alt Gr, ↵ Entrar (tecla Enter, entrar o Intro).\nBloque especial: está ubicado a la derecha del bloque alfanumérico, contiene algunas teclas especiales como Impr Pant o PetSis, Bloq Despl, Pausa, Insert, Supr, Inicio, Fin, RePág, AvPág, y las flechas direccionales que permiten mover el punto de inserción en las cuatro direcciones (↑, ↓, ←, →).\nBloque numérico: está ubicado a la derecha del bloque especial, se activa al presionar la tecla Bloq Num, contiene los números arábigos organizados como en una calculadora con el fin de facilitar la digitación de cifras. Además, contiene el punto como separador decimal ., y los signos de las cuatro operaciones básicas: suma +, resta -, multiplicación * y división /; también contiene una tecla de Intro o ↵ Entrar. Algunos modelos han incluido ambos separadores decimales, la coma y el punto, en su distribución, como por ejemplo el ordenador Nec PC-9801.Teclado del ordenador NEC PC-9801.", "subsections": []}, {"name": "Tipos de teclados", "text": "", "subsections": [{"name": "Según su forma física", "text": "Teclado ergonómico\nDiseñados para dar una mayor comodidad para el usuario, ayudándole a tener una posición más relajada de los brazos.\nTeclado multimedia\nAñade teclas especiales que llaman a algunos programas en el computador, a modo de acceso directo, como pueden ser el programa de correo electrónico, la calculadora, el reproductor multimedia, etc.\nTeclado flexible\nEstos teclados son de plástico suave o silicona que se puede doblar sobre sí mismo. Durante su uso, estos teclados pueden adaptarse a superficies irregulares, y son más resistentes a los líquidos que los teclados estándar. Estos también pueden ser conectados a dispositivos portátiles y teléfonos inteligentes. Algunos modelos pueden ser completamente sumergidos en agua, por lo que hospitales y laboratorios los usan, ya que pueden ser desinfectados.[1]​\nTeclado en pantalla\nHoy en día existen también los teclados en pantalla, también llamados teclados virtuales, que son (como su mismo nombre indica) teclados representados en la pantalla, que se utilizan con el ratón o con un dispositivo especial (podría ser un joystick). Estos teclados se utilizan mayoritariamente en dispositivos móviles como teléfonos, tabletas y PDA, así como consolas de videojuegos y televisores inteligentes.\nTeclados de proyección\nExisten teclados de proyección, de igual tamaño que un teclado estándar.\nTeclados de membrana\nLos teclados de membrana están construidos con dos láminas (membranas) plásticas y delgadas, con pistas conductoras grabadas en la cara interior, y una tercera membrana de separación, agujereada en las zonas en las que va una tecla. Cuando se hace presión sobre ellas, se tocan, pasando la electricidad de una a otra, con lo cual se puede saber que tecla está pulsada.\nLos teclados de membrana sufren bastante con el uso; por ello, los ordenadores actuales ya no los incorporan. Fueron muy usados en el pasado, aunque la membrana ha sido utilizada para la aislación de lluvias también es utilizada para la aislación térmica que atrae.\nSu tecnología se basa en membranas delgadas que conducen la señal al presionar una tecla.\nEste teclado sirve en parte para que los restos que se cuelan entre las rendijas sean más fáciles de sacar y así el teclado no se contamine.\nTeclados capacitivos\nSon los que emplean sensores capacitivos para detectar la interacción del usuario.\nTeclados de contacto metálico\nLos teclados de contacto metálico son como una mezcla entre los teclados de membrana y los teclados mecánicos, y consisten en un circuito que se cierra por la interacción entre dos placas metálicas.\nEn común estos teclados tienen una sensación e interacción muy buena pero su durabilidad es bastante corta dado que los circuitos del teclado carecen de algún tipo de protección como sí la tienen los teclados de membrana: aunque hay algunos modelos que insertan un material esponjoso entre las dos placas, esto no garantiza tanta protección como una membrana de goma.\nTeclados mecánicos\nLos teclados mecánicos están constituidos principalmente por interruptores que actúan de manera independiente, aunque su definición no es rigurosa y hay casos donde no es posible determinar si lo son.[2]​ La gran mayoría de interruptores usa un muelle o resorte para que la tecla pulsada vuelva hacia arriba, a diferencia de los teclados de membrana que usan cúpulas de goma para volver hacia arriba y accionar la tecla al mismo tiempo, aunque los interruptores Topre utilizan una cúpula de goma sobre un muelle capacitivo[3]​. En los teclados mecánicos los interruptores pueden ser de tres tipos, lineares, táctiles y clicky."}, {"name": "Según el puerto de conexión", "text": "Puede ser:\nteclado inalámbrico de appleTeclado con conector Paralelo: Obsoleto.\nTeclado con conector DIN o PS/2: El conector DIN fue usado por pocas computadoras, y fue remplazada rápidamente, más que nada por su tamaño. El PS/2, que también se le denomina «Mini DIN», es parecido al conector DIN, pero con un tamaño más reducido, y se sigue utilizando hoy en día pero cada vez en menor medida (siendo remplazado por el USB en gran parte). Se caracterizan por ser redondos y contener varios pines en su interior que se transmiten por la interfaz. Del 0 al 3 son códigos de error del protocolo, llamados NoEvent, ErrorRollOver, POSTFail, ErrorUndefined, respectivamente. Del 224 al 231 se reservan para las teclas modificadoras (LCtrl, LShift, LAlt, LGUI, RCtrl, RShift, RAlt, RGUI).-->\nTeclado inalámbrico: Suelen ser teclados comunes donde la comunicación entre el computador y el periférico se realiza a través de rayos infrarrojos, ondas de radio o mediante Bluetooth."}]}, {"name": "Estructura", "text": "Un teclado realiza sus funciones mediante un micro controlador. Estos micro controladores tienen un programa instalado para su funcionamiento, estos mismos programas son ejecutados y realizan la exploración matricial de las teclas cuando se presiona alguna, y así determinar cuales están pulsadas.\nPara lograr un sistema flexible los microcontroladores no identifican cada tecla con su carácter serigrafiado en la misma sino que se adjudica un valor numérico a cada una de ellas que solo tiene que ver con su posición física. El teclado latinoamericano solo da soporte con teclas directas a los caracteres específicos del castellano, que incluyen dos tipos de acento, la letra eñe y los signos de exclamación e interrogación. El resto de combinaciones de acentos se obtienen usando una tecla de extensión de grafismos. Por lo demás el teclado latinoamericano está orientado hacia la programación, con fácil acceso al juego de símbolos de la norma ASCII.\nPor cada pulsación o liberación de una tecla el micro controlador envía un código identificativo que se llama Scan Code. Para permitir que varias teclas sean pulsadas simultáneamente, el teclado genera un código diferente cuando una tecla se pulsa y cuando dicha tecla se libera. Si el micro controlador nota que ha cesado la pulsación de la tecla, el nuevo código generado (Break Code) tendrá un valor de pulsación incrementado en 128. Estos códigos son enviados al circuito micro controlador donde serán tratados gracias al administrador de teclado, que no es más que un programa de la BIOS y que determina qué carácter le corresponde a la tecla pulsada comparándolo con una tabla de caracteres que hay en el kernel, generando una interrupción por hardware y enviando los datos al procesador.\nEl micro controlador también posee cierto espacio de memoria RAM que hace que sea capaz de almacenar las últimas pulsaciones en caso de que no se puedan leer a causa de la velocidad de tecleo del usuario. Hay que tener en cuenta, que cuando realizamos una pulsación se pueden producir rebotes que duplican la señal. Con el fin de eliminarlos, el teclado también dispone de un circuito que limpia la señal.\nEn los teclados AT los códigos generados son diferentes, por lo que por razones de compatibilidad es necesario traducirlos. De esta función se encarga el controlador de teclado que es otro microcontrolador (normalmente el 8042), este ya situado en el PC. Este controlador recibe el Código de Búsqueda del Teclado (Kscan Code) y genera el propiamente dicho Código de Búsqueda. La comunicación del teclado es vía serie. El protocolo de comunicación es bidireccional, por lo que el servidor puede enviarle comandos al teclado para configurarlo, reiniciarlo, diagnósticos, etc.", "subsections": []}, {"name": "Distribución del teclado", "text": "La disposición del teclado es la distribución de las teclas del teclado de una computadora, una máquina de escribir u otro dispositivo similar. Existen distintas disposiciones de teclado, para que se puedan utilizar en diversos lenguajes.\nLa disposición de las teclas se remonta a las primeras máquinas de escribir, que eran completamente mecánicas. Al pulsar una tecla, se movía un pequeño martillo mecánico, que golpeaba el papel a través de una cinta impregnada en tinta.\nEn los teclados de informática encontramos las principales distribuciones son ANSI(American National Standards Institute) usada más en America e ISO(International Organization for Standardization) parece estar más dirigido a Europa. también encontramos JIS(Japanese Industrial Standard) en Japón. \nLa principal característica para reconocer los teclados ANSI e ISO es en la teclas ↵ Entrar, ⇧ Mayús Izquierda y la posición de @ . En los teclados ISO la tecla ↵ Entrar tien forma de L o de L de cabeza y en los teclado ANSI la tecla enter un poco más ancha que una tecla normal, Por lo general la posición de @ en los teclados ANSI se encuentra en la tecla 2 y en los teclados ISO se encuentra en Q", "subsections": [{"name": "QWERTY", "text": "El tipo estándar de teclado inglés se conoce como QWERTY. Denominación de los teclados de computadora y máquinas de escribir que se utilizan habitualmente en los países occidentales, con alfabeto latino. Las siglas corresponden a las primeras letras del teclado, comenzando por la izquierda en la fila superior.\nVariantes de QWERTY\nQWERTY se pensó para el inglés estadounidense. Con el tiempo se han creado múltiples variantes para adaptarlo a las particularidades de otros idiomas y/o países.\nPara el idioma español las principales variantes son:\nEl teclado QWERTY para España y Guinea Ecuatorial.\nSu versión hispanoamericana.\nAmbas se basaban en cambios en la disposición según las teclas más frecuentemente usadas en cada idioma. A los teclados en versión para español además de la Ñ, se les añadieron los caracteres de acento agudo (´), grave (`), la diéresis (¨) y circunflejo (^), y exclusivamente en la distribución española la ce cedilla (Ç) debido a que es utilizada por algunos idiomas como el Idioma francés y el idioma catalán, el cual es cooficial en una parte de España."}, {"name": "Distribuciones alternativas", "text": "La distribución de teclado QWERTY ha recibido muchas críticas por su escasa ergonomía. Se han sugerido distintas alternativas como: Colemak, Carpalx, o Workman, indicando ventajas tales como mayores velocidades de tecleado o disminución de esfuerzo. La alternativa más famosa es el Teclado Simplificado Dvorak.\nLas computadoras modernas permiten utilizar las distribuciones de teclado de varios idiomas distintos en un teclado que físicamente corresponde a un solo idioma. En sistemas operativos Windows, como también en Mac OS o en Linux por ejemplo, pueden instalarse distribuciones adicionales desde el Panel de Control o de Herramientas de configuración o Personalización."}, {"name": "Distribuciones personalizadas", "text": "Existen programas como Microsoft Keyboard Layout Creator[4]​ y KbdEdit,[5]​ que hacen muy fácil la tarea de crear nuevas distribuciones, ya para satisfacer las necesidades particulares de un usuario, ya para resolver problemas que afectan a todo un grupo lingüístico. Estas distribuciones pueden ser modificaciones a otras previamente existentes (como el teclado latinoamericano extendido[6]​ o el gaélico[7]​), o pueden ser enteramente nuevas (como la distribución para el Alfabeto Fonético Internacional,[8]​ o el panibérico[9]​).\nTeclado IBM PC/Compatible IBM PC/Microsoft Windows (distribución latinoamericana).\n←\n↲\n≣\n↑\n↓\n→\nTeclado IBM PC/Compatible IBM PC/Microsoft Windows (distribución española)."}]}, {"name": "Teclas inertes", "text": "Algunas lenguas incluyen caracteres adicionales al teclado inglés, como los caracteres acentuados. Teclear los caracteres acentuados resulta más sencillo usando las teclas inertes. Cuando se utiliza una de estas teclas, si se presiona la tecla correspondiente al acento deseado nada ocurre en la pantalla, por lo que, a continuación se debe presionar la tecla del carácter que se quiere acentuar. Esta combinación de teclas requiere que se teclee una secuencia aceptable. Por ejemplo, si se presiona la tecla inerte del acento (ej. ´) seguido de la letra A, obtendrá una «a» acentuada (á). Sin embargo, si se presiona una tecla inerte y a continuación la tecla T, no aparecerá nada en la pantalla o aparecerán los dos caracteres por separado (´t), a menos que la fuente particular para su idioma incluya la «t» acentuada.\nPara teclear una marca de acento diacrítico, simplemente se presiona la tecla inerte del acento, seguida de la barra de espacio.", "subsections": []}, {"name": "Accesos directos en el teclado", "text": "", "subsections": []}, {"name": "Véase también", "text": "Captura de pantalla\nPC 99\nPS/2 (puerto)\nTeclado AZERTY\nTeclado Braille\nTeclado Colemak\nTeclado Dvorak\nEscape (tecla)\nTeclado QWERTY\nTeclado QWERTZ\nTeclado tipo chiclet\nUniversal Serial Bus\nHalf-keyboard", "subsections": []}, {"name": "Notas y referencias", "text": "↑ «Teclado flexible, lavable y a prueba de todo.» Consultado el 15 de diciembre de 2009.\n↑ When is a keyboard \"mechanical\"? (en inglés), archivado desde el original el 23 de octubre de 2021, consultado el 23 de octubre de 2021 .\n↑ Admin (18 de julio de 2022). «The Difference Between Mechanical and Membrane Keyboards». Okeyboard (en inglés estadounidense). Consultado el 8 de septiembre de 2022. \n↑ «Microsoft Keyboard Layout Creator». Consultado el 26 de julio de 2007. \n↑ «KbdEdit». Consultado el 4 de octubre de 2007. \n↑ «Distribuciones de Teclado para Windows: latinoamericano extendido.». Consultado el 26 de marzo de 2009. \n↑ «Gaelic Keyboards for MS Windows». Consultado el 26 de marzo de 2009. \n↑ «IPA Keyboard Layout for Windows». Archivado desde el original el 7 de abril de 2009. Consultado el 26 de marzo de 2009. \n↑ «Distribuciones de Teclado para Windows: panibérico.». Consultado el 26 de marzo de 2009. ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Teclado_tipo_chiclet", "title": "Teclado tipo chiclet", "summary": "[1]​ Un teclado de chicle (también conocido como teclado de goma) es un argot para un teclado de computadora construido con una matriz de teclas pequeñas, rectangulares y planas hechas de goma o plástico, que parecen borradores o chicle de mascar. El término viene de \"Chiclets\", la marca de una variedad de chicle (Chiclets Adams).\nLos vendedores unánimemente querían el teclado de chicle porque era barato de producir. En los inicios, muchos computadores caseros, (notablemente ZX Spectrum) y computadores portátiles fueron lanzados con él. Sin embargo, los consumidores lo rechazaron con casi igual unanimidad, aunque no era en absoluto tan desagradable de trabajar como el teclado de membrana. Después de 1985, los teclados de chicle no fueron vistos a menudo, con excepción de algunos relojes digitales con calculadora, pequeñas calculadoras de mano, y baratos PDAs no expandibles.\nLa expresión \"teclado de chicle\" no es común para cada país. Por ejemplo, en el Reino Unido, donde la goma de mascar Chicles no se vende, es referido más a menudo como el teclado de carne muerta (por la sensación de las teclas) o simplemente el teclado teclas de goma. En Noruega, el término teclado de borrador fue comúnmente usado, por la semejanza de las teclas con los borradores de lápiz.", "sections": [{"name": "Cómo funciona", "text": "En algunas, pero no todas las versiones del teclado de chicle, las tres capas inferiores son esencialmente iguales que las del teclado de membrana. En ambos casos, la presión de una tecla es registrada cuando la capa superior es forzada a través de un agujero a tocar la capa inferior. Para cada tecla, los trazos conductores en la capa inferior son separados normalmente por un espacio no conductivo. La corriente eléctrica no puede fluir entre ellos, el interruptor está abierto. Sin embargo, cuando está empujado hacia abajo, el material conductor en la parte inferior de la capa superior tiende un puente sobre el espacio entre los trazos, el interruptor está cerrado, la corriente puede fluir, y la presión de la tecla es registrada.\nA diferencia del teclado de membrana, donde el usuario presiona directamente sobre la capa de la membrana superior, esta forma de teclado de chicle pone un conjunto de teclas de goma moldeada sobre esta. El usuario empuja la tecla, y bajo suficiente presión el caucho se deforma lo suficiente como para forzar la capa de la membrana superior contra la capa inferior. Esto proporciona una mejor sensación de movimiento que un teclado de membrana simple.\nEl siguiente diagrama ilustra esta versión del teclado de chicle:\nOtras versiones del teclado tipo chicle omiten la membrana superior y capas de hueco/espaciador. En su lugar, la superficie inferior de las teclas de goma tenían ellas mismas un recubrimiento conductor. Cuando la tecla es presionada, la superficie conductora inferior de la tecla hace contacto con las trazas en la capa inferior y completa el circuito.\nLos teclados de interruptor de domo usados en una gran proporción de los PC modernos son técnicamente similares a los teclados de chicle. Sin embargo, las teclas de goma son reemplazadas por domos de goma, y las partes superiores de las teclas, hechas de plástico duro, descansan sobre estos.", "subsections": []}, {"name": "Lista de computadoras con teclados tipo chicle", "text": "La mayoría de las computadoras listados vienen de los principios de la era del ordenador doméstico.\nCambridge Z88 (discutible como una mezcla entre un teclado de membrana y un teclado de chiclet)\nCommodore PET 2001 (el PET original de 1977)\nCommodore 116 (versión del C16 solamente vendido en Europa)\nIBM PCjr\nJupiter Ace\nMattel Aquarius\nMultitech Microprofessor I (MPF 1) y MPF II (el último uno de los primeros compatibles del Apple II)\nOric 1\nPanasonic Toughbook eLite\nZX Spectrum 16/48K (modelos más recientes habían mejorado levemente los teclados)\nTandy TRS-80 Color Computer I ('CoCos' más recientes tenían teclados full-travel)\nTandy TRS-80 MC-10 y su contraparte francesa, el Matra Alice\nTexas Instruments TI-99/4 (el precursor del TI-99/4A, que tenía teclado full-travel)\nTimex Sinclair 1500 (derivación para Estados Unidos del ZX81)\nTimex Sinclair 2068 (derivación para Estados Unidos del ZX Spectrum)\nVTech Laser 200\nAsus Eee 1000HA 2009 (Es tan solo una versión del modelo EPC1000HA-BLK001X con teclado chiclet)\nAsus Republic Of Gamers (todos sus modelos desde el 2009)\nHp Mini 210 Y 210HD\nMac Pro\nMSI (En sus modelos de la serie A6000)\nHuawei (En sus modelos D13, D14, D15 y MateBook E)", "subsections": []}, {"name": "Referencias", "text": "↑ «Strategy Implementation and Alignment: Global Leader - BTS». www.bts.com. Consultado el 26 de noviembre de 2020. ", "subsections": []}, {"name": "Enlaces externos", "text": "Google Image Search for Chiclet Keyboard\nEste artículo estuvo basado originalmente en material extraído del Diccionario Libre de Informática En Línea (Free On-Line Dictionary of Computing), el cual está licenciado bajo los términos de la GFDL.", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/UHF", "title": "UHF", "summary": "Véase también:\nUHF (siglas del inglés: Ultra High Frequency) o frecuencia ultraalta es una banda del espectro electromagnético que ocupa el rango de frecuencias de 300 megahercios a 3 gigahercios. En esta banda se produce la propagación por onda espacial troposférica, con una atenuación adicional máxima de 1 decibelio si existe despejamiento de la primera zona de Fresnel.\nDebido a la tecnología utilizada, el nombre se usó en España también para referirse al canal La 2 de TVE hasta 1990, habiendo caído esta nomenclatura progresivamente en desuso en los últimos años.", "sections": [{"name": "Sistemas", "text": "160m\n80m\n40m\n30m\n20m\n17m\n15m\n12m\n10m\n6m\n2m\n70cm\n23cm", "subsections": [{"name": "Televisión", "text": "Uno de los servicios UHF más conocidos por el público son los canales de televisión tanto locales como nacionales. Según los países, algunos canales ocupan las frecuencias entre algo menos de 470 MHz y unos 790 MHz (en España, desde la disposición 4845 del BOE para dejar libre el rango de 790-862 MHz a la tecnología 4G y 5G). Actualmente se usa la banda UHF para emitir la Televisión Digital Terrestre (TDT)."}, {"name": "Radios para uso no profesional", "text": "En Estados Unidos y otros países americanos, existe el servicio FRS, que permite a particulares utilizar transmisores portátiles de baja potencia para uso no profesional. Sus equivalentes en Europa son los radiotransmisores de uso personal PMR446.\nLos radioaficionados también cuentan con dos bandas UHF:\nLa banda de 70cm entre los 430 y 440 MHz, y con carácter secundario; es decir, deben compartir las frecuencias con otros servicios y no son prioritarios.\nEsos otros servicios pueden ser por ejemplo transmisores de baja potencia para apertura de garajes, repetidoras hogareñas de televisión y dispositivos de comunicación de baja potencia.\nLa banda de 23cm en 1200 MHz"}, {"name": "Telefonía móvil", "text": "Históricamente, las primeras frecuencias UHF utilizadas en telefonía móvil en Europa lo fueron alrededor de los 400MHz (sistema Radiocom 2000 en Francia, sistema NMT en Escandinavia).\nCon la llegada de la norma internacional GSM, las frecuencias afectadas en UHF se sitúan alrededor de los 900 MHz.\nLa norma DCS18010 de telefonía móvil es similar a la GSM, sólo que la frecuencia es doble (1800 MHz). Por esa misma razón el alcance es algo inferior, pero también existe más espectro para los clientes y la denegación de conexión por falta de canales en zonas altamente pobladas es menos frecuente.\nEn las regiones 2 (América) y 3 (Asia y el Pacífico Sur) de la UIT, la norma GSM se llama PCS1900 y la frecuencia afectada es la de 1900 MHz."}, {"name": "Identificación por RFID entre 860 y 960 megahercios", "text": "La identificación de productos utilizando la banda de frecuencia UHF entre 860 y 960 MHz no deja de ser el \"bonsái\" de las comunicaciones de radio porque se utilizan antenas de un grosor de micras y porque las potencias de emisión de los tags RFID no superan los 200μW. A continuación se muestra una tabla de referencia de las potencias de emisión para diversos dispositivos emisores de ondas electromagnéticas:\nEn Europa la entidad reguladora de las frecuencias utilizadas por la tecnología RFID es el Instituto Europeo de Normas de Telecomunicaciones[1]​ y la normativa oficial normalizada está descrita en la norma EN 302 208. En Europa hay dos bandas autorizadas, la banda Baja 865,6 a 867,6 MHz, con una potencia de emisión permitida de 2 vatios PRA, que es equivalente a 3,2 vatios PIRE y la banda Alta del 915 al 921 MHz con una potencia de emisión permitida de 4 vatios PRA.\nEn América, hay varias entidades que regulan las características de esta señal, entre ellas se encuentra la Comisión Federal de Comunicaciones de EE. UU., la CRTTC (Canadian Radio-television and Telecommunications Commission) de Canadá, la ANATEL (Agência Nacional de Telecomunicações) de Brasil, entre otras, las cuales tienen una normativa local, en la que se indica las bandas de uso en cada espacio en las que regulan, en donde la frecuencia más usada va del 902 al 928 MHz con una potencia de emisión permitida de 4 vatios PIRE. En algunos países esta banda se encuentra parcialmente autorizada para operar, siendo frecuentemente el uso del 915 - 928 MHz, dependiendo de las regulaciones, como en el caso del Perú."}]}, {"name": "Características y ventajas", "text": "La transmisión punto a punto de ondas de radio se ve afectada por múltiples variables, como la humedad atmosférica, la corriente de partículas del Sol llamada viento solar, y la hora del día en que se lleve a efecto la transmisión de la señal. La energía de la onda de radio es parcialmente absorbida por la humedad atmosférica (moléculas de agua). La absorción atmosférica reduce o atenúa la intensidad de las señales de radio para grandes distancias. Los efectos de la atenuación aumentan de acuerdo a la frecuencia. Usualmente, las bandas de señales de UHF se degradan más por la humedad que bandas de menor frecuencia como la VHF. La capa de la atmósfera denominada ionosfera puede ser útil en las transmisiones a distancias largas de señales de radio con frecuencias más bajas (VHF, etc.).\nLa UHF puede ser de más provecho por el ducto troposférico donde la atmósfera se calienta y enfría durante el día. La principal ventaja de la transmisión UHF es la longitud de onda corta que es debido a la alta frecuencia. El tamaño del equipo de transmisión y recepción (particularmente antenas), está relacionado con el tamaño de la onda. En este caso microondas. Los equipos más pequeños, y menos aparatosos, se pueden usar con las bandas de alta frecuencia. La UHF es ampliamente usada en sistemas de transmisión y recepción para teléfonos inalámbricos. Las señales UHF viajan a través de trayectorias que son las líneas de vista. Las transmisiones generadas por radios de transmisión y recepción (transceptores) y teléfonos inalámbricos no viajan muy lejos como para interferir con otras transmisiones locales. Algunas comunicaciones públicas seguras y de negocios son tomadas en UHF. Las aplicaciones civiles como GMRS, PMR446, UHF CB, y los estándares WiFi 802.11b , 802.11g y 802.11n (los más habituales en Europa) son usos populares de frecuencias UHF.\nPara propagar señales UHF a una distancia más allá de la línea de vista se usa un repetidor.", "subsections": []}, {"name": "Véase también", "text": "VHF\nRFID\nEtiquetas RFID", "subsections": []}, {"name": "Referencias", "text": "↑ ETSI [1]", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/VRAM", "title": "Memoria gráfica de acceso aleatorio", "summary": "Busca fuentes: «Memoria gráfica de acceso aleatorio» – noticias · libros · académico · imágenes\nMemoria gráfica de acceso aleatorio (Video Random Access Memory) es un tipo de memoria RAM que utiliza el controlador gráfico para poder manejar toda la información visual que le envía la CPU del sistema. La principal característica de esta clase de memoria es que es accesible de forma simultánea por dos dispositivos. De esta manera, es posible que la CPU grabe información en ella, mientras se leen los datos que serán visualizados en el monitor en cada momento. Por esta razón también se clasifica como Dual-Ported.\nEn un principio (procesadores de 8 bits) se llamaba así a la memoria solo accesible directamente por el procesador gráfico, debiendo la CPU cargar los datos a través de él. Podía darse el caso de equipos con más memoria VRAM que RAM (como algunos modelos japoneses de MSX2, que contaban con 64 KiB de RAM y 128 KiB de VRAM).", "sections": [{"name": "Tipos", "text": "SONIC (serial s memory): el módulo SAM (usualmente en la forma de un registro linear) no es cambiado por los cálculos y contiene los datos que van a ser utilizados por el RAMDAC. Esto lo convierte en memoria secuencial, que al contrario de la RAM de datos solo puede ser evaluada sucesivamente (de un modo similar a una casete). La SAM puede seleccionarse mucho más rápidamente que la RAM, pues en principio no necesita cálculos de direccionamiento.\nWRAM (Window RAM): es un tipo de VRAM equipada con líneas separadas de lectura y escritura, que ofrece sin embargo tiempos rápidos de acceso y es barata de producir. Por ejemplo, las tarjetas gráficas Matrox MGA Millennium y la Number Nine Revólution 3D \"Ticket to Ride\" usan WRAM.\nSGRAM (Synchronous Graphics RAM): es una tecnología relacionada con la SDRAM single-ported. Accesos simultáneos de lectura y escritura no son posibles. Ofrece extensas funciones gráficas (por ejemplo lecturas y escrituras bloque a bloque) y altas frecuencias de reloj.\nMDRAM (Multi-bank DRAM): está desarrollado como bancos de memoria independientes, que están conectados a un bus común. Con esa estructura es posible un alto grado de paralelismo. La tarjeta gráfica Hércules Dynamite 128 (GPU: TSENG ET6000) tiene 4 MB MDRAM.\nCDRAM (Cache DRAM): es una mezcla de memoria estática (SRAM) y memoria dinámica (DRAM). Similar a la caché de los modernos procesadores, en la CDRAM los datos frecuentemente usados se almacenan en la rápida SRAM, lo que incrementa el rendimiento.\n3D RAM: es un desarrollo de Mitsubishi consistente en módulos de memoria que además integran una Unidad aritmético lógica. Esto permite que algunas operaciones gráficas (por ejemplo test de Z-Buffer) pueden ejecutarse directamente en la memoria gráfica. Se puede encontrar este tipo de memoria en los UltraSparc de Sun Microsystems.\nGDDR-SDRAM (Graphics Double Data Rate SDRAM): es una memoria gráfica basada en DDR SDRAM, que se caracteriza por sus tiempos optimizados de acceso y las altas frecuencias de reloj, es el tipo más común de memoria gráfica a día de hoy.\nRAM extendida: En la actualidad, es frecuente ver equipos PC con la tarjeta gráfica incorporada en placa base o en el propio procesador, que en lugar de disponer de un banco propio de memoria, se les asigna parte de los bancos de memoria de la RAM de procesador. Suelen ser equipos orientados a tareas ofimáticas o servidores, donde la rapidez de los gráficos no es algo crucial, como en las estaciones CAD o los equipos para videojuegos. No obstante, pueden presentar velocidades mayores que las de la anterior generación de tarjetas gráficas", "subsections": []}, {"name": "Véase también", "text": "Memoria RAM\nTarjeta gráfica\nZ-Buffer", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Videotex", "title": "Videotex", "summary": "Este aviso fue puesto el 25 de noviembre de 2016.\nEl videotex, en España comercializado por Telefónica como Ibertex, se define como una aplicación interactiva que permite difundir, a través de una red de telecomunicación, información de forma paginada suministrada por un sistema informático y visualizada sobre un terminal y una línea telefónica.\nEl decodificador, que es el software característico de las aplicaciones de videotex, tiende a presentar la información en páginas también denominadas pantallas, las cuales se transmiten o reciben en bloque. Cada pantalla suele contener un menú de opciones cuya selección controla las siguientes operaciones a realizar. Una limitación importante de la actual generación de terminales es la baja velocidad de la conexión de éstos a la línea telefónica, de aproximadamente 1200 bits por segundo.\nEn España fue sustituido por InfoVía.", "sections": [{"name": "Antecedentes y expectativas", "text": "Haciendo un poco de historia, el videotex nació en los años 70 en el Reino Unido, con el objetivo inicial de suministrar información general, concebida para el ocio o de utilidad para la vida diaria, convirtiendo en medios informáticos equipos totalmente integrados en la vida familiar, como son el teléfono y el televisor.\nEstados Unidos también quiso participar de esta experiencia. A principios de los años 80, difundió el videotex por varias de sus tiendas. No obstante, no cumplió las expectativas esperadas. Apenas generó ventas.\nEn Francia, el videotex comenzó a utilizarse en 1983 y se ofrecía a través del sistema telefónico France Télécom. Los usuarios lo utilizaban para acceder a las informaciones de los directorios públicos y para establecer comunicaciones interpersonales. En 1980, en la localidad bretona de Saint-Malo, se regalaron 55 videotex a modo de experimento. En \n1983, el Minitel (denominación que recibió en este país) se extendía a lo largo de todo el territorio. Se calcula que en 1993 había más de seis millones de terminales en Francia.\nAlgunos de los periódicos franceses que utilizaron este aparato electrónico fueron el diario Dernières Nouvelles d'Alsace y el periódico Libération. En 1989 Libération ofertaba 27 servicios a través del Minitel. Esos servicios se distribuían en varios mercados: servicio de noticias, juegos, educación, astrología y anuncios.\nEn la actualidad, los contenidos informativos iniciales del videotex se han ampliado considerablemente, orientándose a sectores profesionales y abarcando poco a poco áreas que eran patrimonio de las bases de datos tradicionales.", "subsections": [{"name": "En España", "text": "Las primeras pruebas realizadas en España con este sistema fueron un tanto dudosas.\nVideotex se usó con norma Prestel en los mundiales de 1982 y en las elecciones autonómicas de 1983, lo que desencadenó una transformación para adoptar la norma más avanzada de las promovidas por la Comunidad Europea: la CEPT1, derivada de la\nBTX alemana. Otro de los cambios introducidos fue la adaptación para su uso con redes de conmutación de paquetes Iberpac como vehículo de transporte de los datos.[1]​\nVideotex tiene una orientación económica característica en la cual el usuario se conecta sin ningún requerimiento, facturando los servicios que dependen entre otros factores del tiempo mediante el teléfono.\nEn España, el servicio telemático videotex, prestado por Telefónica a partir del año 1990, recibe el nombre comercial de Ibertex, al que se puede acceder a través de una línea telefónica mediante un terminal específico o un ordenador personal con el módem adecuado. La red de telecomunicación empleada para la transmisión de información desde los centros servidores hasta el terminal del usuario es la Red Ibertex, que al combinar la Red Telefónica Básica (RTB) y la Red Iberpac (red pública de transmisión de datos), ofrece la cobertura nacional de la primera y las más avanzadas prestaciones en transmisión de datos y tarificación independiente de la distancia, características de la segunda.\nEstas redes son los dos soportes de telecomunicación del servicio Ibertex. La Red Telefónica Básica (RTB), mediante la cual los terminales acceden a la Red Iberpac por medio del Centro de Acceso Ibertex (CAI), y esta Red Iberpac, que proporciona los medios necesarios para la comunicación entre el CAI y los centros servidores, a través de la red de conmutación de paquetes Iberpac X-25.\nEl servicio Ibertex permite el acceso a un gran número de bases de datos ubicadas en los centros servidores y consultar información sobre temas diversos, efectuar operaciones transaccionales como compras y pedidos, reservas de viajes y plazas hoteleras, operaciones bancarias, etc., mediante una simple llamada telefónica, conectando el ordenador o terminal a la línea telefónica de igual forma a como se conecta el teléfono convencional.\nVideotex es un servicio que se prevé llegará a tener un uso muy extendido con la RDSI\nya que es como un acceso interactivo a bases de datos remotas para una persona con un terminal. En Francia, donde ha dependido de Minitel de France Telecom, han empezado a ser suprimidos tanto los directorios telefónicos como la información facilitada por operadora (dicha operación ha dado lugar a una gran reducción de costes) mediante el suministro de pequeños terminales a cada uno de los abonados para acceder al directorio telefónico. El directorio telefónico es sólo una pequeña muestra de la aplicación del videotex. Entre otras posibles aplicaciones ofrecidas\npor el sistema de videotex básico se podrían mencionar: las reservas en líneas aéreas, hoteles, teatros y restaurantes, así como la realización de operaciones bancarias."}]}, {"name": "Componentes del sistema videotex", "text": "El funcionamiento del sistema videotex precisa de cuatro elementos. En ocasiones cuando el acceso al servicio se realiza mediante PC estas partes son emuladas con software específico consiguiendo de este modo dichos componentes esenciales: \nTerminal videotex\nMódem-decodificador\nRed de transmisión de datos\nCentro servidor", "subsections": []}, {"name": "Formas básicas de acceder a un terminal videotex", "text": "En primer lugar debe ser mencionado que el uso estándar en España de un terminal\nespecífico videotex mediante la red perteneciente a Telefónica, Ibertex, posibilita la\nutilización del servicio conocido como 031 y la posterior marcación del *27102511840#.\nOtro de los métodos posteriormente desarrollados es el acceso a través de un PC provisto\nde un software para la emulación de un terminal junto con un módem que cumpla la\nnormativa dispuesta por el estándar de Telefónica CCITT V23 (1200/75). Estos servicios\nestarán a disposición y serán permanentemente actualizados por CODEFOC con el fin de\nque el usuario pueda disponer de ellos las 24 horas del día.", "subsections": []}, {"name": "Características", "text": "El videotex presenta unas características básicas: el ser accesible desde cualquier terminal conectado a la RTB, el ser un servicio abierto de carácter permanente e interactivo, cuya utilización no precisa de una contratación previa con Telefónica (tan sólo cuando se quiera acceder a servicios internacionales remunerados, para lo que se requiere un IUI -Identificativo de Usuario Ibertex-), la facilidad de utilización mediante búsqueda interactiva guiada por menús, la presentación de la información en forma gráfica, visualmente atractiva y estructurada en páginas, la tarificación reducida e independiente de la distancia, estableciéndose el coste de la llamada en función de su duración y dependiendo del nivel por el que se accede a la información, y la normalización de la interfaz del usuario.", "subsections": []}, {"name": "Problemas existentes", "text": "Videotex es un sistema lento. La información obtenida es estática, y ha quedado obsoleto con relación a los avances que se dan en la tecnología informática, manifestados sobre todo en los ordenadores personales. Asimismo, la carencia de capacidad y fiabilidad de la red de centros de acceso así como la falta de interés de los posibles usuarios,\nproveedores de información y fabricantes de terminales si se comparan con los franceses\no los de los principales países representantes de estas tecnologías es otro inconveniente\na señalar.\nLa tecnología de ordenadores personales no es tomada en cuenta por la normativa\nvideotex. El principal motivo radica en el elevado precio que presentaban los\ncomponentes (memorias y procesadores) en la época en la que se desarrolló y no se\npreveía la enorme difusión que podría llegar a tener en un futuro no muy lejano. Para\nsolucionar el problema se tomó la decisión de dotar al ordenador de un pequeño\ndispositivo y un programa que le permitiera comunicarse con el mundo videotex.\nPor lo que respecta a la actitud que debe presentar un usuario a la hora de usar este\nservicio, el sistema videotex impone una actitud activa en cuanto a que es el propio\nusuario quien debe servirse de la información que desea.\nFinalmente es necesaria una normalización de teclados y funciones que hagan\ntransparente los comandos normalizados al usuario. Asimismo también es necesaria una\nguía de servicios de videotex, actualizada y fácil de usar, y con sistemas de consulta en caso\nde duda a disposición de los usuarios, muchos de los cuales desconocerán las\ntecnologías que se supone han de manejar.", "subsections": []}, {"name": "Ventajas del sistema videotex", "text": "Respecto a la simplificación del uso. Los sistemas quiosco, que no precisan de un abono\nespecial ni de la identificación del usuario, y que pueden facturarse con el teléfono, son\nuna solución ideal ya adoptada en España. Todos estos puntos son básicos para que el\nsistema videotex se perciba como un servicio integrado, y no como una serie de\naportaciones individuales.\nEl videotex tiene una serie de ventajas que se resumen en su inmediatez, rapidez y comodidad en la consulta. Además, el videotex tiene la ventaja de ser bidireccional, es decir, no es un medio de comunicación exclusivamente unidireccional como la televisión o la radio, sino que el usuario puede decir lo que quiere, puede opinar.\nLa disponibilidad y estabilidad de la red que pretenden cumplir las expectativas de los\nusuarios con una fiabilidad elevada constituye un medio barato de comunicaciones para\nsocializar la informática, por ello es una necesidad inherente de interconexión\ninternacional entre las distintas redes.", "subsections": []}, {"name": "El videotex y los usuarios", "text": "Los usuarios que tuvieron sus primeros contactos con el videotex sintieron que el sistema estaba destinado a una información seleccionada más que como medio de comunicación. Esto se produce porque en el videotex es el propio usuario quien tiene que buscar la información, en contraposición con la radio o la televisión, en que simplemente consume la información que se le transmite. \nAunque tiene un manejo sencillo, la desventaja es que implica la compresión de un lenguaje teleinformático y esto puede producir un rechazo por parte de los usuarios que no tengan estos conocimientos. Otra desventaja es que para poder utilizarlo había que tener un aparato específico para ello en casa. Por tanto en España sufrió un gran fracaso.", "subsections": []}, {"name": "Referencias", "text": "[2]​\n[3]​\n[4]​\n[5]​\n[6]​\n↑ REDES DE SERVICIOS TELEMATICOS: En Ibertex se reciben páginas de información bajo la norma CEPT-1, el estándar más avanzado que existe en videotex, que permite gráficos pero no sonido.\n↑ «Situación actual de Ibertex». El Profesional de la Información. mayo de 1993. ISSN 1386-6710. Consultado el 24 de mayo de 2017. \n↑ Eugènia Salvador (2002). Planificación y evaluación de políticas de información. Fundació per a la Universitat Oberta de Catalunya. pp. 5-32. ISBN 84-8429-439-0. Consultado el 24 de mayo de 2017. \n↑ Julia Cela (1990). «El sistema Videotex». Consultado el 24 de mayo de 2017. \n↑ «Ibertex será la denominación del servicio español de videotex». El País. EDICIONES EL PAÍS S.L. 8 de febrero de 1983. Consultado el 24 de mayo de 2017. \n↑ «Ibertext conecta a 400.000 españoles con la red mundial de Internet». El País. EDICIONES EL PAÍS S.L. 4 de julio de 1994. Consultado el 24 de mayo de 2017. ", "subsections": []}]}
