{"url": "https://es.wikipedia.org/wiki/ROM", "title": "Memoria de solo lectura", "summary": "Busca fuentes: «Memoria de solo lectura» – noticias · libros · académico · imágenes\nLa memoria de solo lectura, conocida también como ROM (acrónimo en inglés de Read Only Memory), es un medio de almacenamiento utilizado en ordenadores y dispositivos electrónicos, que permite solo la lectura de la información y no su escritura,[1]​ independientemente de la presencia o no de una fuente de energía. \nLos datos almacenados en la ROM no se pueden modificar, o al menos no de manera rápida o fácil. Se utiliza principalmente para contener el firmware[2]​ (programa que está estrechamente ligado a hardware específico, y es poco probable que requiera actualizaciones frecuentes) u otro contenido vital para el funcionamiento del dispositivo, como los programas que ponen en marcha el ordenador y realizan los diagnósticos.\nEn su sentido más estricto, se refiere solo a la ROM de máscara -en inglés, mask ROM o MROM- (el más antiguo tipo de ROM de estado sólido), que se fabrica con los datos almacenados de forma permanente, y por lo tanto, su contenido no puede ser modificado de ninguna forma. Sin embargo, las ROM más modernas, como EPROM y Flash EEPROM, efectivamente se pueden borrar y volver a programar varias veces, aun siendo descritos como \"memoria de solo lectura\" (ROM). La razón de que se las continúe llamando así es que el proceso de reprogramación en general es poco frecuente, relativamente lento y, a menudo, no se permite la escritura en lugares aleatorios de la memoria. A pesar de la simplicidad de la ROM, los dispositivos reprogramables son más flexibles y económicos, por lo cual las antiguas ROM con máscara no se suelen encontrar en hardware producido a partir de 2007.", "sections": [{"name": "Historia", "text": "El tipo más simple de ROM en estado sólido es de la misma antigüedad que la propia tecnología semiconductora. Las puertas lógicas combinacionales pueden usarse en conjunto para indexar una dirección de memoria de n bits en valores de m bits de tamaño (una tabla de consultas). Con la invención de los circuitos integrados se desarrolló la ROM de máscara. La ROM con máscara consistía en una cuadrícula de líneas formadas por una palabra y líneas formadas por un bit seleccionadas respectivamente a partir de cambios en el transistor. De esta manera podían representar una tabla de consultas arbitraria y un retardo de propagación deductible.\nEn las ROM con máscara los datos están físicamente codificados en el mismo circuito, así que solo se pueden programar durante la fabricación. Esto acarrea serias desventajas:\nSolo es económico comprarlas en grandes cantidades, ya que el usuario contrata fundiciones para producirlas según sus necesidades.\nEl tiempo transcurrido entre completar el diseño de la máscara y recibir el resultado final es muy largo.\nNo son prácticas para I+D por el hecho de que los desarrolladores necesitan cambiar el contenido de la memoria mientras refinan un diseño.\nSi un producto tiene un error en la máscara, la única manera de arreglarlo es reemplazando físicamente la ROM por otra.\nLos desarrollos posteriores tomaron en cuenta estas deficiencias, así pues se creó la memoria de solo lectura programable (PROM). Inventada en 1956, permitía a los usuarios modificarla solo una vez, alterando físicamente su estructura con la aplicación de pulsos de alto voltaje. Esto eliminó los problemas 1 y 2 antes mencionados, ya que una compañía podía pedir un gran lote de PROMs vacías y programarlas con el contenido necesario elegido por los diseñadores. En 1971 se desarrolló la memoria de solo lectura programable y borrable (EPROM) que permitía reiniciar su contenido exponiendo el dispositivo a fuertes rayos ultravioleta. De esta manera erradicaba el punto 3 de la anterior lista. Más tarde, en 1983, se inventó la EEPROM,[3]​ resolviendo el conflicto número 4 de la lista ya que se podía reprogramar el contenido mientras proveyese un mecanismo para recibir contenido externo (por ejemplo, a través de un cable serial). En medio de la década de 1980 Toshiba inventó la memoria flash, una forma de EEPROM que permitía eliminar y reprogramar contenido en una misma operación mediante pulsos eléctricos miles de veces sin sufrir ningún daño.\nTodas estas tecnologías mejoraron la versatilidad y flexibilidad de la ROM, pero lo hicieron a expensas de un alto incremento del costo por chip. Por eso las ROM de máscara se mantuvieron como la solución económica durante bastante tiempo. Esto fue así aproximadamente hasta el año 2000, cuando el precio de las memorias reprogramables hubo descendido lo suficiente como para comenzar a desplazar a las ROM no reprogramables del mercado.\nEl producto más reciente es la memoria NAND, otra vez desarrollada por Toshiba.[4]​ Los diseñadores rompieron explícitamente con las prácticas del pasado, afirmando que enfocaba \"ser un reemplazo de los discos duros\", más que tener el tradicional uso de la ROM como una forma de almacenamiento primario no volátil. En 2007, NAND ha avanzado bastante en su meta, ofreciendo un rendimiento comparable al de los discos duros, una mejor tolerancia a los shocks físicos, una miniaturización extrema (como por ejemplo memorias USB y tarjetas de memoria MicroSD), y un consumo de potencia mucho más bajo.", "subsections": [{"name": "Uso para almacenamiento de software", "text": "Los ordenadores domésticos a comienzos de los años 1980 venían con todo su sistema operativo en ROM.[5]​ No había otra alternativa razonable ya que las unidades de disco eran generalmente opcionales. La actualización a una nueva versión significa usar un soldador o un grupo de interruptores DIP y reemplazar el viejo chip de ROM por uno nuevo. Actualmente los sistemas operativos en general ya no van en ROM. Todavía los ordenadores pueden dejar algunos de sus programas en memoria ROM, pero incluso en este caso, es más frecuente que vaya en memoria flash. Los teléfonos móviles y los asistentes personales digitales (PDA) suelen tener programas en memoria ROM (o por lo menos en memoria flash).\nAlgunas de las videoconsolas que usan programas basados en la memoria ROM son la Super Nintendo, la Nintendo 64, la Sega Mega Drive o la Game Boy. Estas memorias ROM, pegadas a cajas de plástico aptas para ser utilizadas e introducidas repetidas veces, son conocidas como cartuchos. Por extensión la palabra ROM puede referirse también a un archivo de datos que contenga una imagen del programa que se distribuye normalmente en memoria ROM, como una copia de un cartucho de videojuego."}, {"name": "Uso para almacenamiento de datos", "text": "Como la ROM no puede ser modificada (al menos en la antigua versión con máscara), solo resulta apropiada para almacenar datos que no necesiten ser modificados durante la vida de este dispositivo. Con este fin, la ROM se ha utilizado en muchos ordenadores para guardar tablas de consulta, utilizadas para la evaluación de funciones matemáticas y lógicas. Esto era especialmente eficiente cuando la unidad central de procesamiento era lenta y la ROM era barata en comparación con la RAM. De hecho, una razón de que todavía se utilice la memoria ROM para almacenar datos es la velocidad, ya que los discos siguen siendo más lentos. Y lo que es aún más importante                                          \n, no se puede leer un programa que es necesario para ejecutar un disco desde el propio disco. Por lo tanto, la BIOS, o el sistema de arranque oportuno del PC normalmente se encuentran en una memoria ROM.[6]​\nNo obstante, el uso de la ROM para almacenar grandes cantidades de datos ha ido desapareciendo casi completamente en los ordenadores de propósito general, mientras que la memoria Flash ha ido ocupando este puesto."}]}, {"name": "Tipos", "text": "", "subsections": [{"name": "Basado en semiconductores", "text": "Los chips de ROM programable por máscara clásicos son circuitos integrados que codifican físicamente los datos a almacenar, y por lo tanto es imposible cambiar su contenido después de la fabricación. Otros tipos de memoria de estado sólido no volátil permiten algún grado de modificación:\nLa memoria de solo lectura programable (PROM), o la ROM programable una sola vez (OTP), pueden ser escritas o programadas a través de un dispositivo especial llamado un programador PROM. Normalmente, este dispositivo utiliza alto voltaje para destruir o crear permanentemente enlaces internos (fusibles o antifusibles) dentro del chip. En consecuencia, una PROM solo puede programarse una vez.\nLa memoria de solo lectura programable y borrable  (EPROM) puede ser borrada por la exposición a una fuerte luz ultravioleta (en general durante 10 minutos o más), a continuación, se reescribe otra vez con un proceso que necesita un voltaje más alto que el habitual aplicado. La exposición repetida a la luz UV desgastará eventualmente una EPROM, pero la resistencia de la mayoría de los chips EPROM excede 1000 ciclos de borrado y reprogramación. Después de la programación, la ventana se cubre normalmente con una etiqueta para evitar el borrado accidental. Algunos chips EPROM son borrados de fábrica antes de ser empaquetados, y no incluyen ninguna ventana; estos son efectivamente PROM.\nLa memoria de solo lectura eléctricamente programable y borrable (EEPROM) se basa en una estructura de semiconductor similar a la EPROM, pero permite que todo su contenido (o bancos seleccionados) sea borrado eléctricamente, a continuación, reescrito eléctricamente, por lo que no deben ser retirados del ordenador (o una cámara, reproductor MP3, etc.). Escribir o flashear una EEPROM es mucho más lento (milisegundos por bit) que leer de una ROM o escribir a una RAM (nanosegundos en ambos casos). Existen diferentes tipos de EEPROM:\nLa memoria de solo lectura eléctricamente alterable (EAROM) es un tipo de EEPROM que se puede modificar un bit cada vez. La escritura es un proceso muy lento y necesita de nuevo un voltaje más alto (generalmente alrededor de 12 V) del que se utiliza para el acceso de lectura. EAROMs están destinados para aplicaciones que requieren reescritura poco frecuente y solo parcial. EAROM puede ser utilizado como almacenamiento no volátil para obtener información de configuración del sistema crítico; en muchas aplicaciones, EAROM ha sido suplantada por la RAM CMOS suministrada por la red eléctrica y apoyada con una batería de litio.\nLa memoria flash (o simplemente flash) es un tipo moderno de EEPROM inventado en 1984. La memoria flash se puede borrar y volver a escribir más rápidamente que la EEPROM ordinaria, y los nuevos diseños cuentan con muy alta resistencia (superior a 1.000.000 de ciclos). La Flash NAND moderna hace uso eficiente de área de chip de silicio, lo que resulta en circuitos integrados individuales con una capacidad de hasta 32 GB a partir de 2007; esta característica, junto con su resistencia y durabilidad física, ha permitido la flash NAND reemplazar magnético en algunas aplicaciones (como las unidades flash USB). La memoria flash es a veces llamado flash ROM o Flash EEPROM cuando se usa como un reemplazo para los tipos de ROM viejos, pero no en aplicaciones que aprovechan su capacidad de ser modificado rápidamente y con frecuencia."}]}, {"name": "Velocidad", "text": "", "subsections": [{"name": "Velocidad de lectura", "text": "Aunque la relación relativa entre las velocidades de las memorias RAM y ROM ha ido variando con el tiempo, desde el año 2007 la RAM es más rápida para la lectura que la mayoría de las ROM, razón por la cual el contenido ROM se suele traspasar normalmente a la memoria RAM, desde donde es leída cuando se utiliza."}, {"name": "Velocidad de escritura", "text": "Para los tipos de ROM que puedan ser modificados eléctricamente, la velocidad de escritura siempre es mucho más lenta que la velocidad de lectura, pudiendo requerir voltaje excepcionalmente alto, movimiento de jumpers para habilitar el modo de escritura, y comandos especiales de desbloqueo. Las memorias Flash NAND logran la más alta velocidad de escritura entre todos los tipos de memoria ROM reprogramable, escribiendo grandes bloques de celdas de memoria simultáneamente, y llegando a 15 MB/s."}]}, {"name": "Resistencia y retención de datos", "text": "A causa del hecho de que se escriben electrones a través de una capa de aislamiento eléctrico sobre una puerta de transistor flotante, las ROMs regrabables pueden soportar solo un número limitado de ciclos de escritura y borrado hasta que el aislante queda permanentemente dañado. En las primeras EAROMs, esto podía ocurrir después de tan solo 1.000 ciclos de escritura, mientras que en las EEPROMs modernas la resistencia puede superar el 1.000.000 de ciclos, pero de ninguna manera es infinita. Esta resistencia limitada, así como el coste más grande por bit, hace que el almacenamiento basado en flash sea poco probable que sustituya completamente a las unidades de disco magnético en el futuro próximo.\nEl intervalo de tiempo durante el cual una ROM sigue siendo legible con precisión no está limitado por los ciclos de escritura. La retención de datos de EPROM, EAROM, EEPROM, y flash y puede estar limitada por las pérdidas de carga de los puertos flotantes de los transistores de celda de memoria. Las fugas se aceleran por las altas temperaturas o la radiación. La ROM enmascarada y la PROM fusible/antifusible no sufren de este efecto, ya que su retención de datos depende de la permanencia física en el lugar de la electricidad del circuito integrado (hasta el punto de que el reacondicionamiento del fusible fue un problema en algunos sistemas).", "subsections": []}, {"name": "Imagen ROM", "text": "Artículo principal:\nEl contenido de los chips ROM puede extraerse con dispositivos de hardware especiales y el correspondiente software de control. Esta práctica es habitual para, como ejemplo principal, leer el contenido de cartuchos de videoconsolas antiguas. Otro ejemplo es la realización de copias de seguridad de firmware/OS ROM de ordenadores antiguos u otros dispositivos, con fines de archivo, ya que, en muchos casos, los chips originales son PROM y, por tanto, corren el riesgo de superar su vida útil de datos.\nLos archivos de volcado de memoria resultantes se conocen como imágenes ROM o ROM abreviadas, y se pueden utilizar para producir ROM duplicadas, por ejemplo para producir nuevos cartuchos o como archivos digitales para reproducir en emuladores de consola. El término imagen ROM se originó cuando la mayoría de los juegos de consola se distribuían en cartuchos que contenían chips ROM, pero alcanzó un uso tan extendido que aún se aplica a las imágenes de juegos más recientes distribuidas en CD-ROM u otros soportes ópticos.\nLas imágenes ROM de juegos comerciales, firmware, etc. suelen contener software protegido por derechos de autor. La copia y distribución no autorizada de software protegido por derechos de autor es una violación de las leyes de derechos de autor en muchas jurisdicciones, aunque la duplicación con fines de copia de seguridad puede considerarse uso legítimo dependiendo de la ubicación. En cualquier caso, existe una próspera comunidad dedicada a la distribución y comercio de este tipo de software y abandonware con fines de preservación/compartición.", "subsections": []}, {"name": "Véase también", "text": "Memoria de acceso aleatorio (RAM)\nLógica combinatoria\nSistema secuencial\nMemoria PROM\nMemoria EPROM\nMemoria EEPROM\nMemoria flash\nEmulador\nExtensible Firmware Interface (EFI)\nUnidad de estado sólido", "subsections": []}, {"name": "Enlaces externos", "text": "Read Only Memory, en Enciclopedia Britannica (en inglés)", "subsections": []}, {"name": "Referencias", "text": "↑ Eggeling, T.; Frater, Harald (2003). Ampliar, reparar y configurar su PC. Marcombo. ISBN 8426713351. Consultado el 15 de febrero de 2018. \n↑ Schinkel, Mike; Kaster, J. (1994). Programación en Clipper 5: incluida versión 5.2. Ediciones Díaz de Santos. ISBN 9780201601213. Consultado el 15 de febrero de 2018. \n↑  Suzuki, E.; Hiraishi, H.; Ishii, K.; Hayashi, Y. (1983). A low-voltage alterable EEPROM with metal—oxide-nitride—oxide—semiconductor (MONOS) structures 30 (2). IEEE Transactions on Electron Devices. pp. 122-128. ISSN 0018-9383. doi:10.1109/T-ED.1983.21085.  |fechaacceso= requiere |url= (ayuda) \n↑ Centros Hospitalarios de Alta Resolucion de Andalucia (chares). Temario Especifico de Auxiliares Administrativos.e-book.. MAD-Eduforma. ISBN 9788466558228. Consultado el 15 de febrero de 2018. \n↑ McHoes, Ann McIver; Flynn, Ida M. (27 de diciembre de 2010). Sistemas Operativos. Cengage Learning Editores. ISBN 9786074814859. Consultado el 15 de febrero de 2018. \n↑ Tecnicos de Soporte Informatico de la Comunidad de Castilla Y Leon. Temario Volumen Ii Ebook. MAD-Eduforma. ISBN 9788466551045. Consultado el 15 de febrero de 2018. ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Rockwell_Semiconductor", "title": "Conexant", "summary": "Conexant Systems Inc. (NASDAQ: CNXT) fue una empresa estadounidense de semiconductores, que anteriormente era conocida como Rockwell Semiconductor al ser la división de semiconductores de Rockwell International.", "sections": [{"name": "Historia", "text": "En 1971 Rockwell International crea su Microelectronics Division (División de Microelectrónica) para entrar en el negocio de los microprocesadores y la microelectrónica en general. En 1977 pasa a llamarse Electronic Devices Division y con su R6502 se convierte en el mayor fabricante de microprocesadores MOS 6502. Mucha gente por entonces atribuye equivocadamente a Rockwell la autoría del 6502\nEn 1982 vuelve a cambiar de nombre a Semiconductor Products Division. 1990 trae un nuevo cambio de nombre (Digital Communications Division) y el traslado de sus oficinas centrales a Newport Beach, California. En 1995 pasa a denominarse Rockwell Semiconductor Systems y se centra en los sistemas multimedia y de comunicaciones inalámbricas.\nEn 1996 su casa matriz Rockwell International vende sus negocios militares y aeroespaciales, mientras que Rockwell Semiconductor adquiere en septiembre la Brooktree Corporation (famosa por sus chipsets para tarjeta sintonizadora de televisión como los Bt848 y Bt878). En mayo de 1997 adquiere el negocio de chipsets de banda ancha Hi-Media de ComStream corporation.\nEn 1998 se anuncia que Rockwell Semiconductor va a pasar a ser una compañía independiente : Conexant Systems, Inc que integrará el negocio nativo de Rockwell Semiconductor (fabrica chips para módem, fax módem, DSL, GSM y CDMA) y las dos últimas adquisiciones. Será la última separación de Rockwell International. En enero de 1999 Conexant Systems comienza a cotizar como compañía independiente.\nEl 29 de abril de 2008 Conexant vende su unidad de procesadores para medios de comunicación de banda ancha (Broadband Media Processing unit), que suministra componentes al mercado de los decodificadores de televisión a NXP Semiconductors.", "subsections": []}, {"name": "Líneas de Productos", "text": "Conexant es uno de los principales proveedores del mundo de procesadores para módems y sistemas de llamada, presentes en modems, dispositivos de Fax, ATMs, lectoras de tarjetas de crédito, etc. Incluso hoy Conexant mantiene la mayoría del mercado de módems pues casi todos llevan sus soluciones Softmodem sobre los estándares HCF y HSF.[1]​\nTras la compra de Brooktree,  entró en el segmento de los decodificadores de televisión y conversión de vídeo y ahora proporciona la mayoría de DSPs para sintonizadoras de TV tanto para ordenadores como para grabadores de vídeo personales\nEn 2003 se fusionó con GlobespanVirata, un proveedor líder de Digital Subscriber Line (DSL), redes inalámbricas (Wi-Fi), y otras soluciones de banda ancha. GlobespanVirata trajo tecnologías que han dado a la compañía la posibilidad de una mayor integración de acceso de banda ancha con dispositivos de medios digitales para que sirviera de puerta de enlace para la información y el entretenimiento en el hogar.\nEn 2004 compra Amphion Semiconductor (una empresa con sede en Belfast, Reino Unido) por sus tecnologías H.264 y VC1. Broadcom, su principal rival, había comprado tácticamente Sandvideo que se convirtió en la principal fuente de Conexant de tecnologías H.264 para el emergente mercado HDTV. Su compra de Amphion Semiconductor le ha permitido asegurar su futuro en el mercado de Alta Definición y más allá.\nConexant es ahora fabless desde que transfirió  sus fabs a Jazz Semiconductor al crearla como compañía independiente en 2002. Utiliza fundiciones de terceros para fabricar sus productos.", "subsections": []}, {"name": "Oficinas", "text": "La sede central de Conexant está situada en Newport Beach, California, y tiene centros de investigación y desarrollo en San Diego (California);  Red Bank, Nueva Jersey; Austin, Texas; Bristol, Reino Unido; Sophia Antípolis, Francia; India (Pune, Hyderabad y NOIDA), China (Shanghái, Chengdu, Pekín, Shenzhen), Taiwán (Taipéi) y varias oficinas de ventas por todo el mundo.", "subsections": []}, {"name": "Competidores", "text": "TI\nBroadcom\nSTM\nInfineon\nFreescale", "subsections": []}, {"name": "Referencias", "text": "↑ Conexant — innovation that makes old technology new again - Biomedical Innovation with Colin Stewart - OCRegister.com\nhttp://www.broadcom.com/company/keyexec_marotta.php\nhttp://www.rfmagic.com/companymanagement.asp\nhttp://www.entropic.com/pages/team.html\nhttp://www.path1.net/company/directors.cfm\nhttp://www.twst.com/pdf/cnxt.pdf", "subsections": []}, {"name": "Enlaces externos", "text": "Uso incorrecto de la plantilla enlace roto (enlace roto disponible en Internet Archive; véase el historial, la primera versión y la última).\nRockwell en chipdb.org", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Sinclair_ZX_Spectrum", "title": "Sinclair ZX Spectrum", "summary": "El Sinclair ZX Spectrum es un ordenador de 8 bits basado en el microprocesador Zilog Z80A, fabricado por la compañía británica Sinclair Research y lanzado al mercado el 23 de abril de 1982.\nEn Europa, el Sinclair ZX Spectrum fue uno de los microordenadores domésticos más populares de los años 1980. Aún hoy perduran miles de aficionados del Spectrum que siguen jugando a sus juegos (con emuladores que cargan sus ficheros volcados de cintas). Además hay un mercado de coleccionismo tanto de cintas de juegos originales como de los propios Spectrum.", "sections": [{"name": "Sinclair ZX Spectrum", "text": "", "subsections": [{"name": "Características", "text": "Las características del ZX Spectrum original incluían:\nMicroprocesador Zilog Z80A a 3,5 MHz (bus de datos de 8 bits y bus de direcciones de 16 bits). Acompañando al procesador principal estaba la ULA (Uncommitted Logic Array), encargada de realizar funciones auxiliares.\nDos configuraciones de RAM con 16 kB o 48 kB. El límite del direccionamiento de 16 bits es de 64 kB.\nEstos 16 kB de ROM incluían un intérprete del lenguaje BASIC SINCLAIR desarrollado por la compañía Nine Tiles Ltd. para Sinclair y que era una evolución del que ya desarrollaran para dos anteriores máquinas comerciales de la marca, el ZX80 y el ZX81, y de las que el Spectrum es continuador. En la misma zona de memoria también estaba el juego de caracteres ASCII que utilizaba la máquina por defecto (aunque se podía apuntar a otras zonas de memoria y definir caracteres alternativos) y una zona reservada justo antes de la memoria de pantalla, ideal para EPROMs que se podían conectar en el slot trasero.\nTeclado de caucho integrado en el ordenador en el modelo de 16 kB y en la primera versión de 48 kB. El teclado de caucho original oprimía dos membranas con pistas conductoras que servían para detectar la presión. La membrana del ZX Spectrum Plus tenía 3, esta tercera capa amplia las teclas utilizando la presión de 2 contactos al mismo tiempo, para generar por ejemplo las comillas, estas en el Spectrum 48K se realiza pulsando SYMBOL SHIFT y P (en el Plus también se podía realizar de la misma forma). Dicha membrana solía ser la parte más frágil del ordenador y era habitual que a lo largo de los años fuera necesario cambiarla hasta varias veces.\nSistema de almacenamiento en cinta casete de audio común. Se accedía a los datos a una velocidad de 1500 bit/s de media. Un juego de 48 kB tardaba como media algo menos de 4 minutos en cargar. Había juegos que usaban su propio sistema de carga, denominado \"turbo\", a mayor velocidad que la estándar del sistema operativo en ROM, aunque ligeramente más propensos a producir errores de carga. Como periférico adicional, a partir del año 1983 Sinclair puso a la venta el ZX Interface 1 al que se le podían conectar hasta ocho unidades de cinta rápida llamadas microdrive de uso frecuente entre desarrolladores de software, que accedía a los datos a una velocidad de 120.000 bit/s (15 kB/s).\nPosteriormente se desarrolló una nueva carcasa, que consistía en un teclado mejorado con teclas duras y 4 capas de membrana, para permitir la pulsación de dos teclas de función en una sola, y la carcasa más profesional, con bordes cuadrados en lugar de redondeados, que llevó el nombre de ZX Spectrum + (ZX Spectrum Plus). Este desarrollo también se vendió como actualización y solía incluirse junto con una ampliación de memoria para los Spectrum de 16 kB, que añadía un botón de reset y una mejor ventilación.\nEn definitiva, el diseño del ordenador estaba increíblemente optimizado y exprimía sus aparentemente pequeñas posibilidades al máximo. Todas estas características convertían al ZX Spectrum en un equipo muy asequible y versátil, consiguiendo acercar la microinformática a un elevado número de personas."}, {"name": "Sistema gráfico", "text": "Artículo principal:\nUna de las peculiaridades del ZX Spectrum es su sistema de vídeo, al ser capaz de mostrar una matriz de 256x192 pixeles, pero la resolución de color era únicamente de 32x24, por lo que grupos de 8x8 píxeles compartían información de color.\nDicha información de color o atributos consistían en: Color de fondo o paper, color de tinta o ink, atributo de brillo, y un atributo flash.\nEl color de fondo se aplica a los pixels 0, y el color de tinta que se aplica a los pixels 1, pudiendo seleccionarse cada uno entre siete colores.\nEl atributo brillo aumentaba el brillo de los colores (excepto el negro, que no variaba), por lo que en pantalla podían mostrarse en total hasta 15 colores (siete por dos niveles de brillo, más el negro)\nEl atributo flash hacía que los dos atributos de color fondo/tinta se intercambiasen varias veces por segundo, dando un efecto de parpadeo.\nAsí, tenemos 256x192 = 49152 bits = 6144 bytes destinados al bitmap (2048 bytes para cada tercio de pantalla) y 32x24 = 768 bytes dedicados al color, brillo, y flash, totalizando un total de 6912 bytes.\nEl problema de tener distintas resoluciones para el bitmap y el color obligaba a los programadores de juegos, especialmente durante las últimas etapas de vigencia del ordenador, a adoptar soluciones ingeniosas para minimizar las colisiones entre colores, fenómeno conocido como \"attribute clash\" en el mundo anglosajón. Esto era debido a que el ZX-Spectrum no fue concebido en origen como una máquina de videojuegos. Si bien el \"attribute clash\" permitía reducir el tamaño necesario para vídeo a 6,75 kB, esto hacía que algunos de los gráficos mostrados tuvieran una apariencia de poca calidad si el diseño no era minucioso."}, {"name": "Historia y evolución", "text": "El hardware fue diseñado por Richard Altwasser y la carcasa y apariencia es un diseño de Rick Dickinson. El software (firmware de la ROM), así como el profuso manual de instrucciones fue obra de Steve Vickers. Todos ellos habían participado en el diseño de los modelos anteriores de Sinclair, el ZX80 y el ZX81.\nEn abril de 1982 aparecieron dos modelos: uno con 16 Kb a un precio de 125 libras (ampliable a 48 Kb por 60 libras) y otro con 48 Kb de fábrica por 175 libras. Con la salida de imagen en color y con un sonido muy aceptable, destacaba su pequeño tamaño y su teclado con teclas de goma dura que mantenía la tradicional forma de los modelos anteriores de presentar palabras completas con pulsaciones.\nCon un precio tan ajustado, sobre todo comparado con los modelos de la competencia en el momento, los pedidos se dispararon y Sinclair y la empresa ensambladora de la máquina, Timex, no daban abasto. En julio de 1982 ya había 30.000 pedidos pendientes de atender y a finales de agosto (debido a las vacaciones de verano de la plantilla que fueron escrupulosamente respetadas) ya eran 40.000 pedidos retrasados con la consiguiente molestia de muchos compradores. El propio Clive Sinclair hizo una disculpa pública en los medios de comunicación y se comprometió a tener los pedidos entregados en septiembre de ese mismo año, cosa que cumplió.[1]​\nEn marzo de 1983 ya se habían vendido más de 200.000 unidades del ZX-Spectrum,[2]​ y el mercado de los videojuegos domésticos se había convertido en un rentable fenómeno a nivel mundial. Sinclair Research Ltd. se convirtió en apenas unos meses en una de las compañías del sector más sólidas y con más valor del momento. El precio de sus máquinas descendió hasta 99,95 libras para el ZX-Spectrum de 16 Kb, 129,95 libras para el ZX-Spectrum 48 Kb y 39,95 libras para el anterior modelo, el ZX81. \nEn 1981, Altwasser y Vickers se desvincularon de Sinclair para formar su propia compañía, a la cual llamarían Jupiter Cantab (una abreviatura de Cantabridgian). Allí lanzaron al mercado una máquina de idéntica arquitectura a la empleada en la compañía de la que salían, el Jupiter Ace, que sin embargo no tuvo prácticamente repercusión (apenas se comercializaron unas 5000 unidades[3]​)."}, {"name": "Periféricos", "text": "Con el paso de los años fueron apareciendo diversos periféricos, como por ejemplo dispositivos de almacenamiento propios (ZX Microdrive), interfaces de disco (OPUS Discovery, DISCiPLE, Beta Disk), lápices ópticos, ratones (AMX Mouse, Kempston Mouse, Star Mouse), impresoras (la ZX Printer apareció durante 1983 a un precio inicial de 39,95 libras), o mandos de juego (joysticks) que podían ser conectados directamente, por medio de la ZX Interface 2 o a través de otras interfaces que salieron posteriormente al mercado, como las de Kempston Micro Electronics."}, {"name": "Software", "text": "Véase también:\nEl software del ZX Spectrum se compone actualmente de más de 20 000 títulos.[4]​ A pesar de que el hardware del ZX Spectrum imponía unos límites y restricciones notables, su software era muy diverso, incluyendo implementaciones de muchos lenguajes de programación, entre ellos C,[5]​[6]​ Pascal,[7]​[8]​ Prolog (ej: micro-PROLOG),[9]​ Modula-2,[10]​ LISP,[11]​ o Forth,[12]​[13]​ diversos ensambladores/desensambladores de Z80 (ej: OCP Editor/Assembler, HiSoft Devpac, ZEUS Assembler, Artic Assembler), compiladores de Sinclair BASIC (ej: MCoder, COLT, HiSoft BASIC), extensiones del Sinclair BASIC (ej: Beta BASIC, Mega Basic), programas de bases de datos (ej: VU-File[14]​), procesadores de texto (ej: Tasword II[15]​), hojas de cálculo (ej: VU-Calc[14]​), programas de diseño gráfico (ej: OCP Art Studio,[16]​ The Artist, Paintbox, Melbourne Draw), y de modelado 3D (VU-3D[17]​[18]​), aparte de, principalmente, videojuegos."}]}, {"name": "Otros modelos", "text": "", "subsections": [{"name": "Sinclair ZX Spectrum +128", "text": "El Spectrum +128 fue fabricado en España por Investrónica,[19]​ la filial de El Corte Inglés de distribución y fabricación de ordenadores, y distribuidora oficial de Sinclair Research. Investrónica también había distribuido bajo marca propia (InvesDisk) una interfaz de disco junto con el sistema TOS para el ZX Spectrum, desarrollado y comercializado por Timex Computer, la filial de Timex en Portugal. El desarrollo conjunto se realiza en la sede española y es por ello que en 1985 aparece primero en España.\nEl modelo de 128K podía funcionar en modo 48 KB o 128 KB. La mayoría de los programas comerciales se ejecutaban en el modo 48K, pero en los últimos tiempos aparecieron programas comerciales que eran compatibles con las dos versiones. Incorporaba un chip de sonido AY-3-8912 (el mismo que Timex incluiría en sus modelos de Spectrum unos años antes), además de un pequeño teclado numérico anexo pero independiente, y un editor de textos integrado en el sistema operativo firmware. Sin embargo, en la versión inglesa fueron eliminados dicho teclado numérico y el editor de texto, introduciendo en el manejo del sistema operativo un conjunto de menús que mantendrían posteriormente los modelos de Amstrad. Otra característica exclusiva para el mercado español fue el soporte de caracteres españoles, pudiendo mostrar tanto la letra eñe como la apertura de interrogación y exclamación. El principal motivo para este cambio fue una ley que obligaba a que todos los ordenadores que se comercializasen en España pudiesen mostrar dichos caracteres.\nInternamente, los 128 KB se dividían en ocho páginas de 16 KB cada una, numeradas de 0 a 7. Los 64 KB de espacio de direccionamiento del procesador Z80 también se dividían en cuatro bloques de 16 KB cada uno. Finalmente, los 32 KB de ROM se dividían en dos páginas de 16 KB cada una, numeradas de 0 a 1. En el primer bloque del espacio de direcciones (direcciones 0 a 16383) podía seleccionarse cualquiera de las dos páginas de la ROM; en el segundo bloque (direcciones 16384 a 32767) estaba la página 5 de RAM; en el tercer bloque (direcciones 32768 a 49151) la página 2 de RAM; por último, en el cuarto bloque (direcciones 49152 a 65535) podía estar cualquiera de las ocho páginas. Cuando se ejecutaba un programa en BASIC y en el modo 48K, la página activa era la 0, y la 7 se utilizaba como memoria temporal para el editor de textos y de BASIC. La única manera de acceder a la memoria RAM por encima de los 64 KB era mediante un \"Disco RAM\": un disco simulado sobre la memoria RAM extra que permitía grabar y cargar datos instantáneamente.\nA mayores, las versiones  +2A/B y +3 incorporaban modos extra que permitían mapear páginas de RAM en los 64 kB direccionables, pudiendo así sustituir la memoria ROM por RAM y disponer de la totalidad del espacio de direcciones. Cuatro modos estaban disponibles: páginas 0, 1, 2 y 3, páginas 4, 5, 6 y 7, páginas 4, 5, 6 y 3, y páginas 4, 7, 6 y 3. Además, estos modelos tenían 64 KB de ROM para poder incluir el sistema de disco (+3DOS).\nPese a los cambios, mantenía bastante compatibilidad con los hardware periféricos desarrollados para los modelos de 48 KB. \nEn los juegos, especialmente cuando se ejecutaban en el modo 128, se podía disponer de las mejoras del modelo, como la carga de varias fases en RAM. En el modo de 48 kB únicamente, el mapeado de memoria estaba inhabilitado, por lo que el chip AY-3-8912 se podía seguir utilizando, no así la memoria adicional.\nEl sistema de gráficos incluía un sistema de doble buffer que permitía seleccionar la memoria de representación entre la página 5 y la 7, lo que posibilitaba cambiar instantáneamente de pantalla permitiendo algunos trucos gráficos, como poder dibujar en la pantalla shadow y mostrarla justo al terminar de dibujarse, sin que se apreciara como se dibujaba progresivamente. Esta característica se podía utilizar para mostrar gráficos con mayor riqueza visual (aumentando la resolución vertical o emulando una mayor paleta gráfica). El empleo de esta característica requería el uso de 13,5 kB de memoria."}, {"name": "Amstrad Sinclair ZX Spectrum", "text": "En 1986, la compañía Sinclair Research vendió a Amstrad, por 5 millones de libras, la marca comercial Sinclair y su línea de productos informáticos. A partir de ese momento Amstrad procedió a sacar al mercado los siguientes modelos:\nZX Spectrum 128 +2 (1986), que incorporaba en la misma carcasa del ordenador la unidad de casete. Era de color gris oscuro y las ROM eran las mismas que las del modelo Sinclair ZX Spectrum 128, con algunos retoques. Fue más compatible con el software previo que los modelos posteriores.\nZX Spectrum 128 +3 (1987) con unidad de disco de 3\" incorporada en la misma carcasa del ordenador. Este modelo recuperaba el tradicional color negro. Incorporaba en 64Kb de ROM un sistema operativo de disco, el +3DOS. Incluía también una mejora del Sinclair BASIC, el +3BASIC. La compañía Locomotive Software desarrolló y comercializó una versión del sistema operativo CP/M para el +3.\nZX Spectrum 128 +2A/B que incorporaban la carcasa del +2 y características del +3; aunque no llevaban la interfaz de disco, sí incluían el +3DOS y el +3BASIC.\nEn 1992 Amstrad decidió retirar los modelos de Spectrum del mercado,[20]​ ante la popularización de las máquinas de 16 y 32 bits."}, {"name": "Serie Timex Sinclair", "text": "A mediados de 1982, Timex obtuvo la licencia para vender todos los productos Sinclair en Estados Unidos cediéndoles el derecho de usar su nombre por una comisión del 5% sobre las ventas y comenzando a vender productos bajo la marca Timex Sinclair que finalmente llegarían a comercializarse a través de varias filiales también en Argentina, Polonia y Portugal. La filial estadounidense lanzó el Timex Sinclair 1000 y el Timex Sinclair 1500 (ambos basados en el Sinclair ZX81) y el Timex Sinclair 2068 (basado en el ZX Spectrum). Por su parte la filial portuguesa lanzó el Timex Computer 2048 (basado también en el ZX Spectrum) y el Timex Computer 2068 (basado en el Timex Sinclair 2068). A partir de esta última máquina, y producto de un acuerdo entre Polish Unimor y Timex Computer fue desarrollado solo para el mercado polaco también el Unipolbrit Komputer 2086.\nA modo de ejemplo de las diferencias entre los modelos Sinclair y Timex, el TS2068 fue lanzado a fines de 1983 (antes del cierre de la filial estadounidense, a mediados de 1984), está dotada de un puerto para poner cartuchos con software, dos entradas para joysticks, un chip de sonido AY-3-8912 (el mismo que posteriormente se adoptaría para los modelos de 128Kb de Sinclair y Amstrad), una extensión de ROM de 8 KB que incluía nuevos comandos para el Sinclair BASIC y dos modos de vídeo: un modo extendido en color de 32x192 (contra los 32x24 originales del Spectrum) y un modo monocromático de 512x192 píxeles. Dentro de esta línea de mejoras al modelo original de Sinclair, se llegó en 1987 a desarrollar prototipos de una versión mejorada, el Timex Computer 3256, que finalmente no llegaría a ser lanzado al mercado.[21]​\nLa comercialización de los ordenadores de la serie Timex Sinclair se prologaría hasta 1989, cuando Timex Computer de Portugal decidió salir del mercado informático.[22]​"}, {"name": "Clónicos y derivados", "text": "En Europa, Asia y también América se fabricaron diversos clones basados en la exitosa máquina de Sinclair Research, como la serie TK (el TK 90X fue su principal representante) fabricado por la empresa brasileña Microdigital o el Inves Spectrum de la española Investrónica. En Argentina lo fabricó y comercializó[23]​ la empresa Czerweny bajo el nombre de CZ Spectrum.\nAlgunos ordenadores lanzados por otras compañías y basados también en el microprocesador Z80 (como el Enterprise 128 o Tatung Einstein) dispusieron también de periféricos que permitían ejecutar el software del Spectrum en ellos.\nAdicionalmente, Amstrad trabajó en el sucesor del ZX Spectrum +3, denominado proyecto \"Loki\". Se trataba de un ordenador de 8 bits llevado al límite, con soporte de modos de vídeo más avanzados y memoria comparable a la de un ordenador de 16 bits. Dicho proyecto nunca llegó a finalizarse, debido al declive de los ordenadores de 8 bits.\nParalelamente la compañía Miles Gordon Technology desarrolló su propia propuesta como sucesor, el SAM Coupé. Con un procesador Z80 a 6 MHz y 256 KB de RAM, incluía una disquetera de 3,5\" como dispositivo de almacenamiento.\nEn los países occidentales, tras su retirada del mercado en 1992, la plataforma Spectrum persistirá principalmente a través de programas emuladores, aunque surgirán iniciativas menores, como interfaces para disco duro IDE,[24]​ soporte para CompactFlash,[25]​[26]​[27]​ sistemas operativos alternativos[28]​[29]​[30]​ o expansiones gráficas.[31]​[32]​ A finales de 2014 se anunció la aparición del Sinclair ZX Spectrum Vega, una videoconsola basada en el Spectrum.[33]​[34]​[35]​\nEn los países del este europeo se desarrollarán en la década de 1990 varios ordenadores clónicos del Spectrum, muchas veces con ampliaciones diversas (Scorpion ZS 256, Pentagon 1024-SL, Kay 1024, Sprinter, ATM Turbo, Dubna 48K, Hobbit, Didaktik M, etc).\nEn abril de 2017 se lanzó mediante una campaña de Kickstarter el ZX Spectrum Next.[36]​ Se trata de una versión actualizada y expandida del ZX Spectrum original, desarrollada mediante tecnología FPGA. El proyecto produjo dos versiones: La primera consistía únicamente en la placa base, basada en el proyecto TBBlue, que podía integrarse en carcasas y teclados originales del ZX Spectrum. La segunda versión incluía una nueva carcasa con teclado incorporado, diseñada expresamente por Rick Dickinson. A finales de 2017 se cumplió con éxito la primera parte del proyecto, cuando las placas base se enviaron a los usuarios.[37]​ Después de varios retrasos y complicaciones en la producción industrial, la entrega definitiva de la versión con teclado se produjo en febrero de 2020.[38]​"}]}, {"name": "Véase también", "text": "Sinclair ZX80\nSinclair ZX81\nSinclair QL\nClive Sinclair (Fundador de la Compañía)\nWorld of Spectrum\nModos gráficos del ZX Spectrum\nUltimate (Compañía de Software)\nGraftgold\nDinamic\nOpera Soft\nTopo Soft\nMade in Spain\nFuller Micro Systems\nRotronics Wafadrive\nZX Microdrive\nListado de emuladores de ZX Spectrum", "subsections": []}, {"name": "Referencias", "text": "↑ «Happy 30th Birthday, Sinclair ZX Spectrum • The Register». www.theregister.co.uk (en inglés). Consultado el 16 de mayo de 2017. \n↑ «nosher.net». \n↑ «Jupiter Ace Resource Site - What is a Jupiter Ace?». www.jupiter-ace.co.uk (en inglés). Archivado desde el original el 17 de junio de 2012. Consultado el 16 de mayo de 2017. \n↑ Heide, Martijn van der. «Archive!». World of Spectrum. Archivado desde el original el 4 de marzo de 2016. Consultado el 24 de octubre de 2009. \n↑ Heide, Martijn van der. «Sinclair Infoseek: HiSoft C». World of Spectrum. Consultado el 24 de agosto de 2006. \n↑ Heide, Martijn van der. «Sinclair Infoseek: Kamasoft C Compiler». World of Spectrum. Consultado el 24 de agosto de 2006. \n↑ Heide, Martijn van der. «Sinclair Infoseek: HiSoft Pascal 4». World of Spectrum. Consultado el 24 de agosto de 2006. \n↑ Heide, Martijn van der. «Sinclair Infoseek: Mira Pascal». World of Spectrum. Consultado el 24 de agosto de 2006. \n↑ Heide, Martijn van der. «Sinclair Infoseek: Micro-Prolog». World of Spectrum. Consultado el 24 de agosto de 2006. \n↑ Heide, Martijn van der. «Sinclair Infoseek: Mira Modula-2». World of Spectrum. Consultado el 24 de agosto de 2006. \n↑ Heide, Martijn van der. «Sinclair Infoseek: SpecLisp». World of Spectrum. Consultado el 24 de agosto de 2006. \n↑ Heide, Martijn van der. «Sinclair Infoseek: T-FORTH». World of Spectrum. Consultado el 24 de agosto de 2006. \n↑ Heide, Martijn van der. «Sinclair Infoseek: fig-FORTH». World of Spectrum. Consultado el 24 de agosto de 2006. \n↑ a b Pearce, Nick (octubre/November  de 1982). «Zap! Pow! Boom!». ZX Computing: 75. \n↑ Wetherill, Steven (junio  de 1984). «Tasword Two: The Word Processor». CRASH! (5): 126. \n↑ Gilbert, John (octubre  de 1985). «Art Studio». Sinclair User (43): 28. Archivado desde el original el 13 de noviembre de 2013. Consultado el 18 de enero de 2007. \n↑ Carter, Alasdair (octubre/November  de 1983). «VU-3D». ZX Computing: 76-77. \n↑ «Psion Vu-3D». Archivado desde el original el 2 de febrero de 2007. Consultado el 18 de enero de 2007. \n↑ Bourne, Chris. «Launch of the Spectrum 128 in Spain». Synclair User 44 - News. Archivado desde el original el 17 de mayo de 2011. Consultado el 15 de agosto de 2011. \n↑ «How the Spectrum began a revolution». BBC. 23 de abril de 2007. Consultado el 5 de junio de 2007. \n↑ http://timex.comboios.info/tsnews.html\n↑ «TS2068». old-computers.com. Archivado desde el original el 5 de julio de 2012. Consultado el 21 de julio de 2012. \n↑ https://homecomputer.com.ar/2020/10/11/chaos-manor-sinclair-1/\n↑ ZX Spectrum Hardware DIY Site-ZXATASP, información sobre el interface ZXATASP para disco duro y CompactFlash.\n↑ Papaya Labs, distribuidores del interface divIDE para Spectrum.\n↑ divIDE - ZX Spectrum ATA interface, información sobre el interface divIDE.\n↑ ZX Spectrum Hardware DIY Site, información sobre el interface ZXCF para CompactFlash.\n↑ The ZX Spectrum +3e Homepage, versión ampliada del +3DOS.\n↑ ZXVGS Operating System, página oficial del sistema operativo alternativo ZXVGS.\n↑ The ResiDOS Homepage Archivado el 29 de junio de 2007 en Wayback Machine., página oficial del sistema operativo alternativo ResiDOS.\n↑ SPECTRA Interface\n↑ «ULAplus». Archivado desde el original el 25 de mayo de 2013. Consultado el 5 de junio de 2015. \n↑ The Guardian: ZX Spectrum gets new lease of life as Vega games console\n↑ The Telegraph: 8 reasons you should be excited about the return of the ZX Spectrum\n↑ Vuelve ZX Spectrum, una joya para los nostálgicos de la tecnología y los videojuegos\n↑ «ZX Spectrum Next». Sinclair ZX Spectrum Next. \n↑ «Update 24: What's next for the Next (including full computers shipping estimate) · ZX Spectrum Next». Kickstarter (en inglés). Consultado el 13 de agosto de 2019. \n↑ «First ZX Spectrum Next delivered». Sinclair ZX Spectrum Next. Consultado el 13 de febrero de 2020. ", "subsections": []}, {"name": "Enlaces externos", "text": " Wikimedia Commons alberga una galería multimedia sobre Sinclair ZX Spectrum.\nCómo usar un Sinclair ZX Spectrum\nManual completo de la Sinclair ZX Spectrum (en español)\nAgregador de noticias sobre Sinclair ZX Spectrum (en español)\nXZSpectrum.net Emulador en línea, con instrucciones de uso.\nZEsarUX - ZX Second-Emulator And Released for UniX (GPL)\nEl Mundo del Spectrum - Información actualizada sobre el ZX Spectrum", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/Synertek", "title": "Synertek", "summary": "[\n]\nSynertek, Inc. fue un fabricante estadounidense de semiconductores fundado en 1973. El grupo fundador consistía en Bob Schreiner (de Fairchild Semiconductor), Dan Floyd, Zvi Grinfas, Jack Baletto, y Gunnar Wetlesen. La tecnología de fabricación era MOS/LSI (Metal-Oxide-Semiconductor Large-Scale-Integration). Los productos iniciales incluían custom chips y una línea de productos estándar (RAM estática, ROMs, registros electrónicos dinámicos y estáticos) y desde 1979, versiones licenciadas de microprocesadores y microcontroladores: Synertek SY6502, Synertek 6504A y Synertek P6502B (MOS Technology 6502)[2]​[3]​ Synertek 2650 (2650)[4]​ y del Zilog Z8.\nSus mayores clientes fueron Atari (para su líneas de videoconsolas y videojuegos)[5]​ y Apple Computer (para sus ordenadores Apple II y Apple III).[6]​\nSynertek compra Microcomputer Associates, formado por los ingenieros Manny Lemas y Ray Holt, tras lo cual pasó a denominarse Synertek Systems, Inc. y la establece como una filial. En 1978, Synertek Systems lanza un Computador en una tarjeta basado en 6502 llamado el SYM-1, un derivado del MOS Technology/Commodore Semiconductor Group KIM-1. \nEn 1979, Synertek fue adquirida por Honeywell y se establece como una filial.\nSynertek tuvo tres plantas de fabricación de circuitos integrados; una en Singapur, la principal de Santa Clara (California) (opera de 1974 a 1985) y alrededor de 1983, se inició la construcción de una tercera en Santa Cruz (California).\nLa agencia Federal de Medio Ambiente de Estados Unidos presta atención a la contaminación generada por la planta de Santa Clara, lo que acaba en que Honeywell tenga que realizar costosas obras de descontaminación.[7]​[8]​\nCuando las condiciones del mercado se deterioraron, debido principalmente a los problemas de Atari, el trabajo se detuvo en la instalación de Santa Cruz y posteriormente se vendió. Esto trajo que Honeywell no viera rentabilidad en una empresa cuyo principal mercado, el de los chips ROM para consolas, estaba en caída libre y en 1984 comienza a planear su cierre. Finalmente en 1985 Honeywell cerró las operaciones de Synertek y se vendieron sus activos.[1]​", "sections": [{"name": "Referencias", "text": "↑ a b Olmos, David (10 de diciembre de 1984). «Honeywell plans layoff of 1,000 workers at Synertek». Computerworld (IDG) XVIII (50): 132. Consultado el 9 de septiembre de 2015. \n↑ Synertek SY6502 ceramic\n↑ Synertek, Inc - 6500\n↑ Synertek 2650-P-02\n↑ Goldberg, Marty; Vendel, Curt. Atari Inc. Business Is Fun (en inglés). p. 154.  |fechaacceso= requiere |url= (ayuda)\n↑ «The Amp Hour Podcast#241 – An Interview With Chuck Peddle» (en inglés). 19 de marzo de 2015. Consultado el 9 de septiembre de 2015. \n↑ «Public Health Assessment, Synertek (Building 1)» (en inglés). 29 de abril de 1999. Consultado el 1 de marzo de 2009. \n↑ «NPL Site Narrative for Synertek, Inc. (Building 1)» (en inglés). 4 de octubre de 1989. Consultado el 1 de marzo de 2009. ", "subsections": []}, {"name": "Enlaces externos", "text": "Synertek en chipdb.org ", "subsections": []}]}
{"url": "https://es.wikipedia.org/wiki/TV", "title": "Televisión", "summary": "La televisión es un sistema para la transmisión y recepción de imágenes y sonidos a distancia que simulan movimientos, que emplea un mecanismo de difusión. La transmisión puede ser efectuada por medio de ondas de radio, por redes de televisión por cable, televisión por satélite o por IPTV, que son las que existen en modalidades de señal abierta y televisión restringida (televisión por suscripción). El receptor de las señales es el televisor, aunque también recibe el nombre de \"televisión\", y se suele abreviar como \"tele\". La abreviatura común de televisión es \"TV\".\nLa palabra «televisión» es un híbrido de la voz griega τῆλε (tēle, «lejos») y la latina visiōnem (acusativo de visiō «visión»). El término televisión se refiere a todos los aspectos de transmisión y programación de televisión. A veces se abrevia como TV. Este término fue utilizado por primera vez en 1900 por el físico ruso Constantine Perskyi en el Congreso Internacional de Electricidad de París (CIEP).\nLa televisión es el medio de comunicación de masas por excelencia. Como se ve en los datos que demuestran que una persona promedio ve más de cuatro horas de televisión al día.[1]​ También se estima que los niños pasan más tiempo viendo televisión (1023 horas anuales) que estudiando en la escuela (900 horas anuales).[2]​ Esto causa un alto impacto a nivel social y pedagógico, por lo que es un objeto de estudio bastante común de la Filosofía y las Ciencias Sociales.\nEl Día mundial de la Televisión se celebra el 21 de noviembre en conmemoración de la fecha en la que tuvo lugar el primer Foro Mundial de Televisión en las Naciones Unidas en 1996.\nLos servicios de provisión de contenidos en la modalidad de vídeo bajo demanda y/o internet streaming pueden ser también ofrecidos como servicios de televisión.[3]​ La aparición de televisores que pueden conectarse a Internet en los últimos años de la primera década del siglo XXI abre la posibilidad de la denominada televisión inteligente en donde se mezclan y conjugan contenidos de la transmisión convencional (broadcast) con otros que llegan vía Internet.[4]​", "sections": [{"name": "Historia", "text": "Artículo principal:\nEl concepto de televisión (visión a distancia) se puede rastrear hasta Galileo Galilei y su telescopio. Sin embargo no es hasta 1884, con la invención del Disco de Nipkow de Paul Nipkow cuando se hiciera un avance relevante para crear un medio. El cambio que traería la televisión tal y como hoy la conocemos fue la invención del iconoscopio de Vladímir Zvorykin y Philo Farnsworth. Esto daría paso a la televisión completamente electrónica, que disponía de una mayor definición de imagen y de iluminación propia.", "subsections": [{"name": "Primeros desarrollos", "text": "En 1922 el inventor escocés John Logie Baird efectúa la primera experiencia real utilizando dos discos, uno en el emisor y otro en el receptor, que estaban unidos al mismo eje para que su giro fuera síncrono y separados por 2 mm.\nEn 1922, investigó la posibilidad de transmitir imágenes a distancia, y en 1924 consiguió transmitir la imagen parpadeante de una cruz de Malta.[cita requerida]\nEl 26 de enero de 1926, realizó en su laboratorio del número 22 de Frith Street, en el Distrito de Soho,[5]​ Londres la primera demostración pública de un sistema real de televisión ante un grupo de científicos:[6]​ Su muñeco, la vieja marioneta Bill, fue el primer ser en aparecer en una pantalla de televisión. La imagen tenía una resolución de apenas 25 líneas y era diminuta, pero el rostro era perfectamente reconocible.[7]​\nEn 1926 logró, por medio de un cable telefónico, transmitir una señal de televisión entre Glasgow y Londres fundando, en ese mismo año, la Baird Television Development Company, Ltd, con la idea de comercializar el invento. Por ese tiempo, mejoró la velocidad de barrido a 12,5 imágenes por segundo. Fue la primera demostración de un sistema de televisión que podría transmitir imágenes en movimiento en directo con la graduación de tono.[8]​ Y en ese mismo año, en abril, los Laboratorios Bell de Estados Unidos exhiben una pantalla de televisión (o receptor) gigante de 2500 elementos de imagen: formado por una trama de 50 columnas de 50 lámparas de neón cada una, permite mostrar imágenes en movimiento de gran formato. Pese a que las lamparillas se fundían con frecuencia y debían ser repuestas, fue capaz de demostrar la viabilidad del invento en un formato grande.[cita requerida]\nEl 3 de julio de 1928, mostró la primera transmisión a color,[8]​ usando discos de escaneo en los extremos de la transmisión y recepción con tres espirales de aperturas, cada espiral con un filtro de color primario diferente, y tres fuentes de luz en el extremo receptor, con un conmutador para alternar su iluminación.[9]​ Ese mismo año, también demostró la televisión estereoscópica.[10]​\nEn 1927, transmitió señales a una distancia de 705 km por una línea telefónica, entre Londres y Glasgow; Baird transmitió las primeras imágenes a larga distancia de televisión al Hotel Central, en la Estación Central de Glasgow.[11]​ Esa transmisión fue la respuesta de Baird, a una transmisión de larga distancia de 330 km, entre las estaciones de AT&T Bell Labs. Las estaciones de Bell estaban en Nueva York y en Washington D. C. La transmisión anterior se llevó a cabo en abril de 1927, un mes antes de la manifestación de Baird.[12]​\nEn 1928, consiguió transmitir imágenes de Londres a Nueva York por medio de señales de radio y también desde mitad del Atlántico, a bordo de un trasatlántico: para ello, instaló una pequeña emisora de televisión a bordo, donde tenía pensado inventar algo que se viera movido es decir como un canal.[cita requerida]\nEn 1929, su sistema de barrido mecánico de 240 líneas fue adoptado de manera experimental por la British Broadcasting Corporation (BBC). Hacia 1930 se comercializó, ante el desarrollo espectacular del invento, el modelo de televisor Plessey, con el cual los espectadores británicos (se calcula que eran en torno a 3000) podían seguir las emisiones experimentales de la época; los más aventureros podían montar su propio receptor, adquiriendo un kit de piezas desmontadas.[cita requerida]\nEn esa misma época (hacia 1929-1930), la Oficina de Correos de Alemania estaba trabajando, simultánea e independientemente, en un sistema de emisión de televisión basado en su sistema electromecánico (la televisión fernkino). Fue entonces cuando científicos alemanes requirieron sus servicios para poner a punto la televisión alemana: gracias a su ayuda técnica y logística, Alemania fue la primera nación en disponer de una red de televisión por cable; las Olimpiadas de 1936 fueron las primeras del mundo en ser radiadas por televisión desde la emisora «Paul Nipkow», instalada en Berlín: aunque la potencia de salida no era elevada, los berlineses (y otras ciudades cercanas) pudieron disfrutar del acto de inauguración (y de las demás retransmisiones deportivas) en días sucesivos. La radiotelevisión alemana se mantuvo en funcionamiento hasta 1944: ese año, los bombardeos aliados terminaron con las emisiones regulares realizadas desde Berlín.[cita requerida]\nHacia 1932, Baird y sus técnicos habían instalado emisoras de televisión en París (en la última planta de la Torre Eiffel), Berlín, Roma (las tres eran las mejores de su época: emitían 60 líneas por imagen), Londres y Moscú, así como otras de menor importancia: estas últimas tenían una calidad de entre 30 y 50 líneas de resolución.[13]​\nSin embargo, la apuesta de los británicos (BBC) y estadounidenses por el sistema electrónico de exploración (tubo de imagen, comercializado por Marconi) le hizo perder la delantera: en 1937, la BBC emitía programas en pruebas, alternando las 405 líneas del sistema Marconi y las 240 de Baird; la idea era que los espectadores votaran por el sistema que, a su juicio, era de mejor calidad: Baird perdió.[cita requerida]\nAunque mejoró notablemente su sistema electromecánico de exploración (llegó hasta las 325 líneas y posteriormente a 400), no pudo competir contra la mejor imagen y definición del sistema electrónico, quedando su sistema de emisión relegado al olvido.[cita requerida]"}]}, {"name": "Inicios", "text": "Las primeras emisiones públicas de televisión las efectuó la BBC One de la BBC en Inglaterra el 2 de noviembre de 1936[14]​, la NBC en los Estados Unidos el 30 de abril de 1939 y las olimpiadas de Berlín de 1936.[15]​[16]​ En ambos casos ya se utilizaron sistemas electrónicos, aunque los programas no se emitían con un horario regular.\nLa primera emisora fue creada en agosto de 1927 en su casa por Manfred von Ardenne. En 1928, se hizo cargo de su herencia con control total sobre cómo podría gastarse, y estableció su propio laboratorio de investigación privada Forschungslaboratorium für Elektronenphysik,[17]​ en Berlin-Lichterfelde, para llevar a cabo su propia investigación en tecnología de radio y televisión y microscopía electrónica. Inventó el microscopio electrónico de barrido.[18]​[19]​ En la Muestra de Radio de Berlín en agosto de 1931, Ardenne dio al mundo la primera demostración pública de un sistema de televisión utilizando un tubo de rayos catódicos para transmisión y recepción. (Ardenne nunca desarrolló un tubo de cámara, usó la CRT en su lugar como un escáner de punto volante para escanear diapositivas y película.)[20]​[21]​[22]​ Ardenne logra su primera transmisión de imágenes de televisión el 24 de diciembre de 1933, seguido de pruebas para un servicio público de televisión en 1934. el primer servicio mundial de televisión electrónicamente escaneada comenzó en Berlín en 1935, con el establecimiento de la Fernsehsender «Paul Nipkow», que culminó con la emisión en directo de los Juegos Olímpicos de Berlín 1936 desde Berlín a lugares públicos en toda Alemania.[23]​[24]​\nLas emisiones con programación se iniciaron en Inglaterra en 1936, y en Estados Unidos el 30 de abril de 1939, coincidiendo con la inauguración de la Exposición Universal de Nueva York. Las emisiones programadas se interrumpieron durante la Segunda Guerra Mundial, reanudándose cuando terminó.", "subsections": [{"name": "Televisión electrónica", "text": "En 1937 comenzaron las transmisiones regulares de TV electrónica en Francia y en el Reino Unido. Esto llevó a un rápido desarrollo de la industria televisiva y a un rápido aumento de telespectadores, aunque los televisores eran de pantalla pequeña y muy caros. Estas emisiones fueron posibles por el desarrollo del tubo de rayos catódicos y el iconoscopio.\nCaptación de imagen\nEl iconoscopio está basado en el principio de emisión fotoeléctrica: la imagen se proyecta sobre un mosaico formado por células fotoeléctricas que emiten electrones que originan la señal de imagen. Se usó en Estados Unidos entre 1936 y 1946.\nEl vidicón es un tubo de 2,2 cm de diámetro y 13,3 cm de largo basado en la fotoconductividad de algunas sustancias. La imagen óptica se proyecta sobre una placa conductora que, a su vez, es explorada por el otro lado mediante un rayo de electrones muy fino.\nEl plumbicón está basado en el mismo principio que el vidicón, sin embargo, su placa fotoconductora está formada por tres capas: la primera, en contacto con la placa colectora, y la tercera están formadas por un semiconductor; la segunda, por óxido de plomo. De este modo, se origina un diodo que se halla polarizado inversamente; debido a ello, la corriente a través de cada célula elemental, en ausencia de luz, es extraordinariamente baja y la sensibilidad del plumbicón, bajo estas características, muy elevada.\nEn la actualidad se usan cámaras digitales basadas en la tecnología CCD que consiste en sensores de circuitos integrados que reciben la imagen y la convierten en señales eléctricas digitales que pueden ser tratadas y transmitidas. Esta tecnología tiene las ventajas de un tamaño más compacto y la capacidad de manejar altas resoluciones.\nLa señal de vídeo\nLa señal de vídeo es una señal eléctrica variable (análoga) que contiene diferentes tensiones (voltaje) dependiendo de la luminosidad de la imagen a transmitir, y señales de sincronismo de línea y cuadro. Es una señal transducida de la imagen, contiene la información de ésta de forma analógica, pero es necesario, para su recomposición, que haya un perfecto sincronismo entre la deflexión de exploración y la deflexión en la representación.\nEn los sistemas empleados la tensión varía entre 0 y 1 V (0,7 para la señal de imagen y 0,3 para sincrónicos).\nLa exploración de una imagen se realiza mediante su descomposición, primero en fotogramas a los que se llaman cuadros y luego en líneas, leyendo cada cuadro. Para determinar el número de cuadros necesarios para que se pueda recomponer una imagen en movimiento, así como el número de líneas para obtener una óptima calidad en la reproducción y la óptima percepción del color (en la TV en color), se realizaron numerosos estudios empíricos y científicos del ojo humano y su forma de percibir. Se obtuvo que el número de cuadros debía de ser al menos de 24 al segundo (luego se emplearon por otras razones 25 y 30) y que el número de líneas debía de ser superior a las 300.\nLa señal de vídeo la componen la propia información de la imagen correspondiente a cada línea (en la mayoría de países europeos y africanos 625 líneas y en gran parte de Asia y América 525 por cada cuadro) agrupadas en dos campos, las líneas impares y las pares de cada cuadro. A esta información hay que añadir la de sincronismo, tanto de cuadro como de línea, esto es, tanto vertical como horizontal. Al estar el cuadro dividido en dos campos tenemos por cada cuadro un sincronismo vertical que nos señala el comienzo y el tipo de campo, es decir, cuando empieza el campo impar y cuando empieza el campo par. Al comienzo de cada línea se añade el pulso de sincronismo de línea u horizontal (modernamente con la TV en color también se añade información sobre la dominante del color).\nLa codificación de la imagen se realiza entre 0 V para el negro y 0,7 V para el blanco. Para los sincronismos se incorporan pulsos de -0,3 V, lo que da una amplitud total de la forma de onda de vídeo de 1 V. Los sincronismos verticales están constituidos por una serie de pulsos de -0,3 V que proporcionan información sobre el tipo de campo e igualan los tiempos de cada uno de ellos.\nEl sonido, llamado audio, es tratado por separado en toda la cadena de producción y luego se emite junto al vídeo en una portadora situada al lado de la encargada de transportar la imagen."}, {"name": "El desarrollo de la TV", "text": "Es a finales del siglo XX cuando la televisión se convierte en una verdadera bandera tecnológica de los países y cada uno de ellos va desarrollando sus sistemas de TV nacionales y privados. En 1953 se crea Eurovisión que asocia a muchos países de Europa conectando sus sistemas de TV mediante enlaces de microondas. Unos años más tarde, en 1960, se crea Mundovisión que comienza a realizar enlaces con satélites geoestacionarios cubriendo todo el mundo.\nLa producción de televisión se desarrolló con los avances técnicos que permitieron la grabación de las señales de vídeo y audio. Esto permitió la realización de programas grabados que podrían ser almacenados y emitidos posteriormente. A finales de los años 50 del siglo XX se desarrollaron los primeros magnetoscopios y las cámaras con ópticas intercambiables que giraban en una torreta delante del tubo de imagen. Estos avances, junto con los desarrollos de las máquinas necesarias para la mezcla y generación electrónica de otras fuentes, permitieron un desarrollo muy alto de la producción.\nEn los años 70 se implementaron las ópticas Zoom y se empezaron a desarrollar magnetoscopios más pequeños que permitían la grabación de las noticias en el campo. Nacieron los equipos de periodismo electrónico o [ENG. Poco después se comenzó a desarrollar equipos basados en la digitalización de la señal de vídeo y en la generación digital de señales, nacieron de esos desarrollos los efectos digitales y las paletas gráficas. A la vez que el control de las máquinas permitía el montaje de salas de postproducción que, combinando varios elementos, podían realizar programas complejos.\nEl desarrollo de la televisión no se paró con la transmisión de la imagen y el sonido. Pronto se vio la ventaja de utilizar el canal para dar otros servicios. En esta filosofía se implementó, a finales de los años 80 del siglo XX el teletexto que transmite noticias e información en formato de texto utilizando los espacios libres de información de la señal de vídeo. También se implementaron sistemas de sonido mejorado, naciendo la televisión en estéreo o dual y dotando al sonido de una calidad excepcional, el sistema que logró imponerse en el mercado fue el NICAM.\nLa televisión en color\n     NTSC\n     PAL, o cambiando a PAL\n     SECAM\n     Sin información\nYa en 1928 se desarrollaron experimentos de la transmisión de imágenes en color en los cuales también tomo parte el ingeniero escocés John Logie Baird. En 1940, el ingeniero mexicano del Instituto Politécnico Nacional Guillermo González Camarena desarrolló y patentó, tanto en México como en Estados Unidos, un Sistema Tricromático Secuencial de Campos. En 1948, el inventor estadounidense Peter Goldmark, quien trabajaba para Columbia Broadcasting System, basándose en las ideas de Baird y González Camarena, desarrolló un sistema similar llamado Sistema Secuencial de Campos, que la empresa adquirió para sus transmisiones televisivas.\nEntre los primeros sistemas de televisión en color desarrollados, estuvo un sistema con transmisión simultánea de las imágenes de cada color con receptor basado en un tubo electrónico denominado trinoscope (trinoscopio, en español) desarrollado por la empresa Radio Corporation Of America (RCA).[25]​ Las señales transmitidas por este sistema ocupaban tres veces más espectro radioeléctrico que las emisiones monocromáticas y, además, era incompatible con ellas a la vez que muy costoso. El elevado número de televisores en blanco y negro que ya había en Estados Unidos, exigía que el sistema de color que se desarrollara fuera compatible con los receptores monocromáticos. Esta compatibilidad debía realizarse en ambos sentidos, de modo que las emisiones en color fueran recibidas en receptores para blanco y negro y a la inversa. Este sistema fue abandonado.\nPara el desarrollo de sistemas viables de televisión en color, surgieron los conceptos de luminancia y de crominancia. La primera representa la información del brillo de la imagen, lo que corresponde a la señal básica en blanco y negro, mientras que la segunda es la información del color. Estos conceptos habían sido expuestos anteriormente por el ingeniero francés Georges Valensi en 1938, cuando creó y patentó un sistema de transmisión de televisión en color, compatible con equipos para señales en blanco y negro.\nEn 1950, Radio Corporation of America desarrolló un nuevo tubo de imagen con tres cañones electrónicos, implementados en un solo elemento, que emitían haces que chocaban contra pequeños puntos de fósforo de color, llamados luminóforos, mediante la utilización de una máscara de sombras que permitía prescindir de los voluminosos trinoscopios, anteriormente desarrollados por la empresa. Los electrones de los haces al impactar contra los luminóforos emiten luz del color primario (azul, rojo y verde) correspondiente que mediante la mezcla aditiva genera el color original. En el emisor (la cámara) se mantenían los tubos separados, uno por cada color primario. Para la separación, se hacen pasar los rayos luminosos que conforman la imagen por un prisma dicroico que filtra cada color primario a su correspondiente captador.\nSistemas actuales de televisión en color\nEl primer sistema de televisión en color que respetaba la doble compatibilidad con la televisión monocroma fue desarrollado en 1951 por la empresa estadounidense Hazeltine Corporation, bajo la supervisión de Arthur Loughren, vicepresidente de la empresa y Charles Hirsch, Ingeniero Jefe de la División de Investigación. Este sistema fue adoptado en 1953 por la Federal Communications Commission (Comisión Federal de Comunicaciones de Estados Unidos) y se conoció como NTSC.[26]​ El sistema tuvo éxito y se extendió a buena parte de los países americanos y algunos países asiáticos, como Japón.\nLas señales básicas del sistema NTSC son la luminancia (Y) y las componentes de diferencia de color, R-Y y B-Y (es decir, el rojo menos la luminancia y el azul menos la luminancia). Este par de componentes permite dar un tratamiento diferenciado al color y al brillo. El ojo humano es mucho más sensible a las variaciones y definición del brillo que a las del color y esto hace que los anchos de banda de ambas señales sean diferentes, lo cual facilita su transmisión, ya que ambas señales se deben implementar en la misma banda cuyo ancho es ajustado.\nEl sistema NTSC emplea dos señales portadoras de la misma frecuencia para los componentes de diferencia de color, aunque desfasadas en 90°, moduladas con portadora suprimida por modulación de amplitud en cuadratura. Al ser sumadas, la amplitud de la señal resultante indica la saturación del color y la fase es el tinte o tono del mismo. Esta señal se llama de crominancia. Los ejes de modulación, denominados I (en fase) y Q (en cuadratura) están situados de tal forma que se cuida la circunstancia de que el ojo es más sensible a los colores amarillo, rojo, verde y naranja,[27]​ esto es que el eje I se orienta hacia el naranja y el Q hacia el color magenta. Al ser la modulación con portadora suprimida, es necesario enviar una ráfaga o salva de la misma para que los generadores del receptor puedan sincronizarse con ella. Esta ráfaga suele ir en el pórtico anterior o inicio del pulso de sincronismo de línea. La señal de crominancia se suma a la de luminancia componiendo la señal total de la imagen. Las modificaciones en la fase de la señal de vídeo cuando ésta es transmitida producen errores de tinte.\nEl sistema de televisión cromática NTSC fue la base de la cual partieron otros investigadores, principalmente europeos. En Alemania, un equipo dirigido por el ingeniero Walter Bruch desarrolló un sistema que subsanaba los errores de fase, y que fue denominado PAL (Phase Altenating Line, Línea de Fase Alternada, por sus siglas en inglés). Para lograr este cometido, la fase de la subportadora se alterna en cada línea. La subportadora que modula la componente R-Y, que en el sistema PAL se llama V, tiene una fase de 90° en una línea y de 270° en la siguiente. Esto hace que los errores de fase que se produzcan en la transmisión (y que afectan igual y en el mismo sentido a ambas líneas) se compensen a la representación de la imagen al verse una línea junto a la otra. Si la integración de la imagen para la corrección del color la realiza el propio ojo humano, entonces el sistema se denomina PAL S (PAL Simple) y si se realiza mediante un circuito electrónico, es el PAL D (PAL Delay, retardado).\nEn Francia, el investigador Henri de France desarrolló un sistema diferente, denominado SECAM (siglas de SÉquentiel Couleur À Mémoire, Color secuencial con memoria, por sus siglas en francés) que basa su actuación en la trasmisión secuencial de cada componente de color que modula en FM de tal forma que en una línea aparece una componente de color y en la siguiente la otra. Luego, el receptor las combina para deducir el color de la imagen. El PAL fue propuesto como sistema de color paneuropeo en la Conferencia de Oslo de 1966. Pero no se llegó a un acuerdo y como resultado, los gobiernos de los países de Europa Occidental, con la excepción de Francia, adoptaron el PAL, mientras que los de Europa Oriental y Francia el SECAM.\nTodos los sistemas tienen ventajas e inconvenientes. Mientras que el NTSC y el PAL dificultan la edición de la señal de vídeo por su secuencia de color en cuatro y ocho campos, respectivamente, el sistema SECAM hace imposible el trabajo de mezcla de señales de vídeo.\nEl incidente del episodio animado Dennō Senshi Porygon ocurrido el 16 de diciembre de 1997, marcó un antes y después en la industria televisiva. El mismo mostraba una secuencia de luces parpadeantes rojo/azul que originaron ataques de epilepsia simultáneos en aproximadamente 680 espectadores (casi todos niños) susceptibles, lo que ocasionó una tragedia comentada en los días posteriores por numerosos medios internacionales (aunque la histeria colectiva indujo a que más de 12 000 niños presentaran síndromes similares a la epilepsia).[28]​\nA partir de ese momento, el episodio fue retirado del aire permanentemente y se impusieron ciertas reglas a las cadenas televisivas para la emisión de series, como por ejemplo:[29]​\nLas imágenes parpadeantes no deben brillar más de 3 veces por segundo.\nLas imágenes parpadeantes no deben durar más de 2 segundos en pantalla.\nLos círculos concéntricos y demás juegos visuales no deben ocupar todo el espacio de la pantalla.\nEstas normas siguen vigentes, sin embargo, los nuevos receptores de televisión digital (LCD, plasma, led, OLED, etc.) poseen un riesgo mucho menor de provocar estos problemas.[30]​\nLa alta definición\nEl sistema de televisión de definición estándar, conocido por la sigla \"SD\", tiene en su versión digital, una definición de 720x576 píxeles (720 puntos horizontales en cada línea y 576 puntos verticales que corresponden a las líneas activas de las normas de 625 líneas) con un total de 414 720 píxeles. En las normas de 525 líneas se mantienen los puntos por línea, pero el número de líneas activas es solo de 480, lo que da un total de píxeles de 388 800 siendo los píxeles levemente anchos en PAL y levemente altos en NTSC.\nSe han desarrollado 28 sistemas diferentes de televisión de alta definición. Hay diferencias en cuanto a relación de cuadros, número de líneas y píxeles y forma de barrido. Todos ellos se pueden agrupar en cuatro grandes grupos, de los cuales dos ya han quedado obsoletos (los referentes a las normas de la SMPTE 295M, 240M y 260M) manteniéndose otros dos que difieren, fundamentalmente, en el número de líneas activas, uno de 1080 líneas activas (SMPT 274M) y el otro de 720 líneas activas (SMPT 269M).\nEn el primero de los grupos, con 1080 líneas activas, se dan diferencias de frecuencia de cuadro y de muestras por línea (aunque el número de muestras por tiempo activo de línea se mantiene en 1920) también la forma de barrido cambia, hay barrido progresivo o entrelazado. De la misma forma ocurre en el segundo grupo, donde las líneas activas son 720, teniendo 1280 muestras por tiempo de línea activo. En este caso la forma de barrido es siempre progresiva.\nEn el sistema de HD de 1080 líneas y 1920 muestras por línea tenemos 2 073 600 pixeles en la imagen y en el sistema de HD de 720 líneas y 1280 muestras por líneas tenemos 921 600 píxeles en la pantalla. En relación con los sistemas convencionales, tenemos que la resolución del sistema de 1080 líneas es 5 veces mayor que el del PAL y cinco veces y media que el del NTSC. Con el sistema de HD de 720 líneas es un 50 % mayor que en PAL y un 66 % mayor que en NTSC.[31]​\nLa alta resolución requiere también una redefinición del espacio de color cambiando el espacio de color a Rec.709.\nLa relación de aspecto\nEn la década de 1990 se empezaron a desarrollar los sistemas de televisión de alta definición. Todos estos sistemas, en principio analógicos, aumentaban el número de líneas de la imagen y cambiaban la relación de aspecto (relación entre la anchura y la altura de la imagen) pasando del formato utilizado hasta entonces de 4:3, al de 16:9. Este nuevo formato, más agradable a la vista se estableció como norma, incluso en emisiones de definición estándar. Este cambio fue influido por la emisión y demanda cada vez más común de películas (normalmente proyectadas en pantallas de cine rectangulares) en la televisión.[32]​ La compatibilidad entre ambas relaciones de aspecto se puede realizar de diferentes formas:\nUna imagen de 4:3 que sea observada en una pantalla de 16:9 puede presentarse de tres formas diferentes:\ncon barras negras verticales a cada lado (pillarbox), con lo que se mantiene la relación de 4:3 pero se pierde parte de la zona activa de la pantalla;\nampliando la imagen hasta que ocupe toda la pantalla horizontalmente. Se pierde parte de la imagen por la parte superior e inferior de la misma;\ndeformando la imagen para adaptarla al formato de la pantalla. Se usa toda la pantalla y se ve toda la imagen, pero con la geometría alterada, ya que los círculos se transforman en elipses con su eje mayor orientado horizontalmente.\nUna imagen de 16:9 observada en pantallas de 4:3, de forma similar, puede ser presentada en tres formas:\nCon barras horizontales arriba y abajo de la imagen (letterbox). Se ve toda la imagen pero se pierde tamaño de pantalla. Hay dos formatos de letterbox (13:9 y 14:9) y se usa uno u otro, dependiendo de la parte visible de la imagen observada: cuanto más grande se haga, más se recorta;\nAmpliando la imagen hasta ocupar toda la pantalla verticalmente, perdiéndose las partes laterales de la imagen;\nDeformando la imagen para adaptarla a la relación de aspecto de la pantalla. Como en el caso de la relación de 4:3 la geometría es alterada, ya que los círculos se convierten en elipses con su eje mayor orientado verticalmente.\nLas adaptaciones pueden ser realizadas por el propio receptor, la cadena de TV que emite la señal o la fuente original. Existen casos en los que se usan dos o más de las técnicas anteriores, como recortar un poco y estirar otro más para encajar la imagen en otro formato. Asimismo, la cadena puede usar técnicas para disimular o aprovechar el espacio normalmente desperdiciado al cambiar de formato, como repetir porciones desenfocadas de la imagen donde aparecerían las barras negras, colocar decoraciones o fondos que correspondan al programa, o en casos más especiales usarlos para mostrar información adicional como el tiempo y las últimas noticias.\nEl PALplus\nEn Europa occidental, y demás países donde se utiliza el sistema PAL, se desarrolló, con apoyo de la Unión Europea, un formato intermedio entre la alta definición y la definición estándar denominado PALplus pero no logró ser implantado. El PALplus fue una extensión del estándar PAL para transmitir imágenes con relación de 16:9 sin tener que perder resolución vertical. En un televisor con relación de aspecto 4:3, se recibe una imagen con franjas negras en la parte superior e inferior de la misma con 432 líneas activas. Un emisor PALplus enviaba información adicional para rellenar las franjas negras llegando a 576 líneas de resolución vertical. Mediante señales auxiliares que iban en las líneas del intervalo de sincronismo vertical, se indicaba al receptor PALplus si el barrido de la imagen era progresivo o entrelazado. El sistema se amplió con el llamado \"Colorplus\" que mejoraba la decodificación del color.\nLa digitalización\nA finales de los años 1980 se empezaron a desarrollar sistemas de digitalización. La digitalización en la televisión tiene dos partes bien diferenciadas. Por un lado está la digitalización de la producción y por el otro la de la transmisión.\nEn cuanto a la producción se desarrollaron varios sistemas de digitalización. Los primeros de ellos estaban basados en la digitalización de la señal compuesta de vídeo que no tuvieron éxito. El planteamiento de digitalizar las componentes de la señal de vídeo, es decir, la luminancia y las diferencias de color, fue el que resultó más idóneo. En un principio se desarrollaron los sistemas de señales en paralelo, con gruesos cables que precisaban de un hilo para cada bit, pronto se sustituyó ese cable por la transmisión multiplexada en tiempo de las palabras correspondientes a cada una de las componentes de la señal, además este sistema permitió incluir el audio, embebiéndolo en la información transmitida, y otra serie de utilidades.\nPara el mantenimiento de la calidad necesaria para la producción de TV se desarrolló la norma de Calidad Estudio CCIR-601. Mientras que se permitió el desarrollo de otras normas menos exigentes para el campo de las producciones ligeras (EFP) y el periodismo electrónico (ENG).\nLa diferencia entre ambos campos, el de la producción en calidad de estudio y la de en calidad de ENG estriba en la magnitud el flujo binario generado en la digitalización de las señales.\nLa reducción del flujo binario de la señal de vídeo digital dio lugar a una serie de algoritmos, basados todos ellos en la transformada discreta del coseno tanto en el dominio espacial como en el temporal, que permitieron reducir dicho flujo, posibilitando la construcción de equipos más accesibles. Esto permitió el acceso a los mismos a pequeñas empresas de producción y emisión de TV, dando lugar al auge de las televisiones locales.\nEn cuanto a la transmisión, la digitalización de la misma fue posible gracias a las técnicas de compresión que lograron reducir el flujo a menos de 5 Mbit/s, hay que recordar que el flujo original de una señal de calidad de estudio tiene 270 Mbit/s. Esta compresión es la llamada MPEG-2 que produce flujos de entre 4 y 6 Mbit/s sin pérdidas apreciables de calidad subjetiva.\nLas transmisiones de TV digital tienen tres grandes áreas dependiendo de la forma de la misma, aun cuando son similares en cuanto a tecnología. La transmisión se realiza por satélite, cable y vía radiofrecuencia terrestre, ésta es la conocida como TDT.\nEl avance de la informática, tanto a nivel del hardware como del software, llevaron a sistemas de producción basados en el tratamiento informático de la señal de televisión. Los sistemas de almacenamiento, como los magnetoscopios, pasaron a ser sustituidos por servidores informáticos de vídeo y los archivos pasaron a guardar sus informaciones en discos duros y cintas de datos. Los ficheros de vídeo incluyen los metadatos que son información referente a su contenido. El acceso a la información se realiza desde los propios ordenadores donde corren programas de edición de vídeo, de tal forma que la información residente en el archivo es accesible en tiempo real por el usuario. En realidad, los archivos se estructuran en tres niveles, el on line, para aquella información de uso muy frecuente que reside en servidores de discos duros, el near line, información de uso frecuente que reside en cintas de datos y éstas están en grandes librerías automatizadas, y el archivo profundo donde se encuentra la información que está fuera de línea y precisa de su incorporación manual al sistema. Todo ello está controlado por una base de datos en donde figuran los asientos de la información residente en el sistema.\nLa incorporación de información al sistema se realiza mediante la denominada función de ingesta. Las fuentes pueden ser generadas ya en formatos informáticos o son convertidas mediante conversores de vídeo a ficheros informáticos. Las captaciones realizadas en el campo por equipos de ENG o EFP se graban en formatos compatibles con el del almacenamiento utilizando soportes diferentes a la cinta magnética, las tecnologías existentes son DVD de rayo azul (de Sony), grabación en memorias RAM (de Panasonic) y grabación en disco duro (de Ikegami).\nLa existencia de los servidores de vídeo posibilita la automatización de las emisiones y de los programas de informativos mediante la realización de listas de emisión.\nLa digitalización ha supuesto grandes ventajas para las cadenas y los usuarios. Pues permite disfrutar de una mejor calidad de imagen y sonido y un mayor número de canales producto de la compresión de video y sonido. Asimismo, da a las cadenas y compañías de medios una mayor libertad y poder para producir sus contenidos, como producir y emitir versiones remasterizadas de películas o programas antiguos y una libertad casi absoluta de modificar los contenidos audiovisuales de sus nuevas producciones, desde el clásico croma hasta animaciones digitales o efectos especiales. Sin embargo, esta libertad puede ser problemática para algunos géneros como los programas informativos y documentales, al permitir a los periodistas deshonestos y gobiernos totalitarios alterar los contenidos para adaptarlos a sus intereses. En respuesta, han aparecido en muchos países leyes que regulan la difusión de la información y mecanismos de denuncia ciudadana."}]}, {"name": "Tipos de televisión", "text": "", "subsections": [{"name": "Difusión analógica", "text": "Véase también:\nLa televisión hasta tiempos recientes, principios del siglo XXI, fue analógica totalmente y su modo de llegar a los televidentes era mediante el aire con ondas de radio en las bandas de VHF y UHF. Pronto salieron las redes de cable que distribuían canales por las ciudades. Esta distribución también se realizaba con señal analógica, las redes de cable pueden tener una banda asignada, más que nada, para poder realizar la sintonía de los canales que llegan por el aire junto con los que llegan por cable. Su desarrollo depende de la legislación de cada país, mientras que en algunos de ellos se desarrollaron rápidamente, como en Inglaterra y Estados Unidos, en otros como España no han tenido casi importancia hasta que a finales del siglo XX la legislación permitió su instalación.\nEl satélite, que permite la llegada de la señal a zonas muy remotas y de difícil acceso, su desarrollo, a partir de la tecnología de los lanzamientos espaciales, permitió la explotación comercial para la distribución de las señales de televisión. El satélite realiza dos funciones fundamentales, la de permitir los enlaces de las señales de un punto al otro del orbe, mediante enlaces de microondas, y la distribución de la señal en difusión.\nCada uno de estos tipos de emisión tiene sus ventajas e inconvenientes, mientras que el cable garantiza la llegada en estado óptimo de la señal, sin interferencias de ningún tipo, precisa de una instalación costosa y de un centro que realice la integración de las señales, conocido con el nombre de cabecera. Solo se puede entender un tendido de cable en núcleos urbanos donde la aglomeración de habitantes haga rentable la inversión de la infraestructura necesaria. Otra ventaja del cable es la de disponer de un camino de retorno que permite crear servicios interactivos independientes de otros sistemas (normalmente para otros sistemas de emisión se utiliza la línea telefónica para realizar el retorno). El satélite, de elevado costo en su construcción y puesta en órbita, permite llegar a lugares inaccesibles y remotos. También tiene la ventaja de servicios disponibles para los televidentes, que posibilitan la explotación comercial y la rentabilidad del sistema. La comunicación vía satélite es una de las más importantes en la logística militar y muchos sistemas utilizados en la explotación civil tienen un trasfondo estratégico que justifican la inversión económica realizada. La transmisión vía radio es la más popular y la más extendida. La inversión de la red de distribución de la señal no es muy costosa y permite, mediante la red de reemisores necesaria, llegar a lugares remotos, de índole rural. La señal es mucho menos inmune al ruido y en muchos casos la recepción se resiente. Pero es la forma normal de la difusión de las señales de TV."}, {"name": "Difusión digital", "text": "Estas formas de difusión se han mantenido con el nacimiento de la televisión digital, con la ventaja de que el tipo de señal es muy robusta a las interferencias y la norma de emisión está concebida para una buena recepción. También hay que decir que acompaña a la señal de televisión una serie de servicios extras que dan un valor añadido a la programación y que en la normativa se ha incluido todo un campo para la realización de la televisión de pago en sus diferentes modalidades.\nLa difusión de la televisión digital se basa en el sistema DVB Digital Video Broadcasting y es el sistema utilizado en Europa, la mayor parte de Asia, África, la mayoría de América del Sur, la mayor parte de Oceanía y Groenlandia. Este sistema tiene una parte común para la difusión de satélite, cable y terrestre. Esta parte común corresponde a la ordenación del flujo de la señal y la parte no común es la que lo adapta a cada modo de transmisión. Los canales de transmisión son diferentes, mientras que el ancho de banda del satélite es grande, el cable y la vía terrestre lo tienen moderado. Los ecos son muy altos en la difusión vía terrestre, mientas que en satélite prácticamente no existen y en el cable se pueden controlar. Las potencias de recepción son muy bajas para el satélite (llega una señal muy débil) mientras que en el cable son altas y por vía terrestre son medias, la misma forma tiene la relación señal-ruido.\nLos sistemas utilizados según el tipo de canal son los siguientes, para satélite el DVB-S, para cable el DVB-C y para terrestre (también llamando terrenal) DVB-T. Muchas veces se realizan captaciones de señales de satélite que luego son metidas en cable, para ello es normal que las señales sufran una ligera modificación para su adecuación a la norma del cable.\nEn Estados Unidos se ha desarrollado un sistema diferente de televisión digital, el ATSC Advanced Television System Committee que mientras que en las emisiones por satélite y cable no difiere mucho del europeo, en la TDT es totalmente diferente. Este sistema es usado en Norteamérica, Corea del Sur y las colonias o territorios influidos por Estados Unidos. Las deficiencias del NTSC han hecho que se unifiquen lo que es televisión digital y alta definición. El peso de las compañías audiovisuales y cinematográficas estadounidenses ha llevado a un sistema de TDT característico en el que no se ha prestado atención alguna a la inmunidad contra los ecos.\nTelevisión terrestre\nLa difusión analógica por vía terrestre, por radio, está constituida de la siguiente forma; del centro emisor se hacen llegar las señales de vídeo y audio hasta los transmisores principales situados en lugares estratégicos, normalmente en lo alto de alguna montaña dominante. Estos enlaces se realizan mediante enlaces de microondas punto a punto cuando se trata de una unión local. Si se trata de una cadena nacional, la emisora principal emite su programación hacia un satélite, que luego es devuelta a la tierra para ser recibida por los transmisores, que pueden agregarle contenidos locales como noticias y programas de la región. Los transmisores principales cubren una amplia zona que se va rellenando, en aquellos casos que haya sombras, con reemisores. La transmisión se realiza en las bandas de UHF y VHF, aunque esta última está prácticamente extinguida, ya que en Europa se ha designado a la aeronáutica y a otros servicios como la radio digital. Eso sí, debido a que es señal por el aire, aún hay interferencias y obstáculos.\nLa difusión de la televisión digital vía terrestre, conocida como TDT se realiza en la misma banda de la difusión analógica. Los flujos de transmisión se han reducido hasta menos de 6 Mb/s lo que permite la incorporación de varios canales. Lo normal es realizar una agrupación de cuatro canales en un Mux el cual ocupa un canal de la banda (en analógico un canal es ocupado por un programa). La característica principal es la forma de modulación. La televisión terrestre digital dentro del sistema DVB-T utiliza para su transmisión la modulación OFDM Orthogonal Frecuency Division Multiplex que le confiere una alta inmunidad a los ecos, aun a costa de un complicado sistema técnico. La OFDM utiliza miles de portadoras para repartir la energía de radiación, las portadoras mantienen la ortogonalidad en el dominio de la frecuencia. Se emite durante un tiempo útil al que sigue una interrupción llamada tiempo de guarda. Para ello todos los transmisores deben estar síncronos y emitir en paralelo un bit del flujo de la señal. El receptor recibe la señal y espera el tiempo de guarda para procesarla, en esa espera se desprecian los ecos que se pudieran haber producido. La sincronía en los transmisores se realiza mediante un sistema de GPS.\nLa televisión digital terrestre en los EE. UU., utiliza la norma ATSC Advanced Television System Committee que deja sentir la diferente concepción respecto al servicio que debe tener la televisión y el peso de la industria audiovisual y cinematográfica estadounidense. La televisión norteamericana se ha desarrollado a base de pequeñas emisoras locales que se unían a una retransmisión general para ciertos programas y eventos, al contrario que en Europa, donde han primado las grandes cadenas nacionales. Esto hace que la ventaja del sistema europeo que puede crear redes de frecuencia única para cubrir un territorio con un solo canal no sea apreciada por los norteamericanos. El sistema americano no ha prestado atención a la eliminación del eco. La deficiencia del NTSC es una de las causas de las ansias para el desarrollo de un sistema de TV digital que ha sido asociado con el de alta definición.\nEL ATSC estaba integrado por empresas privadas, asociaciones e instituciones educativas. La FCC Federal Communication Commission aprobó la norma resultante de este comité como estándar de TDT en EE. UU. el 24 de diciembre de 1996. Plantea una convergencia con los ordenadores poniendo énfasis en el barrido progresivo y en el píxel cuadrado. Han desarrollado dos jerarquías de calidad, la estándar (se han definido dos formatos, uno entrelazado y otro progresivo, para el entrelazado usan 480 líneas activas a 720 píxeles por línea y el progresivo 480 líneas con 640 píxeles por línea, la frecuencia de cuadro es la de 59,94 y 60 Hz y el formato es de 16/9 y 3/4) y la de alta definición (en AD tienen dos tipos diferentes uno progresivo y otro entrelazado, para el primero se usan 720 líneas de 1280 píxeles, para el segundo 1080 líneas y 1920 píxeles por línea a 59,94 y 60 cuadros segundo y un formato de 16/9 para ambos). Han desarrollado dos jerarquías de calidad, la estándar y la de alta definición. Utiliza el ancho de banda de un canal de NTSC para la emisión de televisión de alta definición o cuatro en calidad estándar.\nLos sistemas de difusión digitales están llamados a sustituir a los analógicos, se prevé que se dejen de realizar emisiones en analógico, en Europa estaba previsto el apagón analógico para el 2012 y en EE. UU. se ha decretado el 17 de febrero de 2009 como la fecha límite en la que todas las estaciones de televisión dejen de transmitir en sistema analógico y pasen a transmitir exclusivamente en sistema digital. El 8 de septiembre de 2008 al mediodía se realizó la primera transición entre sistemas en el poblado de Wilmington, Carolina del Norte."}, {"name": "Televisión por cable", "text": "La televisión por cable surge por la necesidad de llevar señales de televisión y radio, de índole diversa, hasta el domicilio de los abonados, sin necesidad de que estos deban disponer de diferentes equipos receptores, reproductores y sobre todo de antenas.\nPrecisa de una red de cable que parte de una «cabecera» en donde se van embebiendo, en multiplicación de frecuencias, los diferentes canales que tienen orígenes diversos. Muchos de ellos provienen de satélites y otros son creados ex profeso para la emisión por cable.\nLa ventaja del cable es la de disponer de un canal de retorno, que lo forma el propio cable, que permite el poder realizar una serie de servicios sin tener que utilizar otra infraestructura. Otra ventaja es la facilidad y el bajo costo de distribuir la señal hacia más de un televisor para que varias personas consuman contenidos distintos a la vez. Esto lo hace atractivo para los hogares con dos o más televisores.\nLa dificultad de tender la red de cable en lugares de poca población hace que solamente los núcleos urbanos y semiurbanos tengan acceso a estos servicios.\nLa transmisión digital por cable está basada en la norma DVB-C, muy similar a la de satélite, y utiliza la modulación QAM."}, {"name": "Televisión por satélite", "text": "La difusión vía satélite se inició con el desarrollo de la industria espacial, que permitió poner en órbita geoestacionaria satélites con transductores que emiten señales de televisión que son recogidas por antenas parabólicas.\nEl alto coste de la construcción y puesta en órbita de los satélites, así como la vida limitada de los mismos, se ve aliviado por la posibilidad de la explotación de otra serie de servicios, como son los enlaces punto a punto para cualquier tipo de comunicación de datos. No es desdeñable el uso militar de los mismos, aunque parte de ellos sean de aplicaciones civiles, ya que buena parte de la inversión está realizada con presupuesto militar.\nLa ventaja de llegar a toda la superficie de un territorio concreto, facilita el acceso a zonas muy remotas y aisladas. Asimismo, hace la instalación del servicio más barata y sencilla que la del cable. Esto hace que los programas de televisión lleguen a todas partes. La relativa facilidad de instalación también ha permitido a los proveedores ofrecer su servicio bajo el esquema de prepago sin necesidad de que los suscriptores se comprometan en contratos con plazos obligatorios.\nLa transmisión vía satélite digital se realiza bajo la norma DVB-S, la energía de las señales que llegan a las antenas es muy pequeña, aunque el ancho de banda suele ser muy grande."}, {"name": "Televisión IP (IPTV)", "text": "El desarrollo de redes IP administradas, basadas en accesos de los clientes a las mismas mediante XDSL o fibra óptica, que proporcionan gran ancho de banda, así como el aumento de las capacidades de compresión de datos de los algoritmos tipo MPEG, ha hecho posible la distribución de la señal de televisión de forma digital encapsulada en mediante tecnología IP.\nHan surgido así, a partir del año 2003, plataformas de distribución de televisión IP (IPTV) soportadas tanto en redes del tipo XDSL, o de fibra óptica para visualización en televisor, como para visualización en computadoras y teléfonos móviles.\nEs frecuente emplear de forma equivocada el término IPTV para con cualquier servicio de vídeo que utiliza el Protocolo de Internet IP. En términos formales debe utilizarse únicamente para redes gestionadas de IP. No es el caso de una red de tipo \"best-effort\" como Internet."}, {"name": "La televisión de 3D", "text": "La visión estereoscópica o estereovisión es una técnica ya conocida y utilizada en la fotografía de principios del siglo XX. A finales de ese mismo siglo el cine en 3D, en tres dimensiones, era ya habitual y estaba comercializado y se llegaron a hacer pruebas de TV estereoscópica en la década de 1920.[33]​\nA finales de la primera década del siglo XXI comienzan a verse los primeros sistemas comerciales de televisión en 3D basados en la captación, transmisión y representación de dos imágenes similares desplazadas la una respecto a la otra y polarizadas. Aunque se experimentó algún sistema sin que se necesitaran gafas con filtros polarizados para ver estas imágenes en tres dimensiones, como el de la casa Philips, los sistemas existentes, basados en el mismo principio que el cine en 3D, precisan de la utilización de filtros de color, color rojo para el ojo derecho y cian para el ojo izquierdo.[34]​\nEl sistema de captación está compuesto por dos cámaras convencionales o de alta resolución debidamente adaptadas y sincronizadas, controlando los parámetros de convergencia y separación, así como el monitoreado de las imágenes captadas para poder corregir en tiempo real los defectos propios del sistema. Normalmente, se realiza una grabación y una posterior postproducción en donde se corrigen los defectos inherentes a este tipo de producciones (aberraciones, diferencias de colorimetría, problemas de convergencia, etc.).\nCámara de TV en 3D. Disposición vertical.\nVista frontal de una cámara de TV en 3D.\nVista trasera de una cámara de TV en 3D.\nImagen de TV en 3D en una pantalla de TV."}, {"name": "Ultra alta definición 4K, 8K y 16K", "text": "Es el sucesor de la alta definición, que permite una mayor definición al permitir, al menos, el doble de líneas comparada con su predecesor, logrando una imagen más detallada. Fue propuesta por la televisora japonesa NHK.\nLa tecnología UHDV proporciona una imagen cuya resolución es 16 veces superior a la alta definición (1920x1080), y hasta 75 veces superior al sistema PAL (720x576).\nLa tecnología UHDTV básica cuenta con 7680 píxeles por línea horizontal y 4320 píxeles por columna vertical (resolución de 7680x4320), es decir, más de 33 millones de píxeles. Comparada con los 1080 píxeles por columna vertical del HDTV y sus poco más de dos millones de píxeles, mejora en dieciséis veces la nitidez de la imagen y también la experiencia con los nuevos sistemas digitales de entretenimiento, como las consolas de videojuegos. Actualmente, compañías como Samsung fabrican teléfonos que pueden grabar en este formato, la mayoría de los grandes fabricantes de televisores ya venden modelos con esta tecnología, YouTube ya lo admite para sus videos y las películas se distribuyen en discos Blu-Ray Ultra HD."}]}, {"name": "Tipos de televisores", "text": "Se conoce como televisor al aparato electrodoméstico destinado a la recepción de la señal de televisión. Suele constar de un sintonizador y de los mandos y circuitos necesarios para la conversión de las señales eléctricas, bien sean analógicas o digitales, en representación de las imágenes en movimiento en la pantalla y el sonido por los altavoces. Muchas veces hay servicios asociados a la señal de televisión que el televisor debe procesar, como el teletexto o el sistema NICAM de audio.\nDesde los receptores mecánicos hasta los modernos televisores planos ha habido todo un mundo de diferentes tecnologías. Hasta hace poco, el Tubo de rayos catódicos fue la tecnología dominante al proporcionar una alta calidad de imagen a un precio reducido. Sin embargo, actualmente está siendo desplazada por tecnologías más modernas como LCD, plasma, o led y otras que ofrecen una mayor definición, diseños más delgados y modernos y un menor consumo energético.\nA medida que el apagón analógico va transcurriendo en el mundo, comienzan a proliferar los televisores, decodificadores, antenas y otras tecnologías diseñadas para la nueva señal digital.\nTelevisor blanco y negro: la pantalla solo muestra imágenes en blanco y negro.\nTelevisor en color: la pantalla es apta para mostrar imágenes en color. (Puede ser CRT o cualquier otra tecnología).\nTelevisor pantalla LCD: plano, con pantalla de cristal líquido (o LCD).\nTelevisor pantalla de plasma: plano, usualmente se usa esta tecnología para formatos de mayor tamaño.\nTelevisor LCD led: Plano, con una pantalla LCD iluminada por luces led.\nTelevisor OLED: Usa luces led orgánicas para producir la imagen. Sus ventajas son colores más brillantes y un contraste igual o mejor que el proporcionado por el CRT. Su desventaja por ahora (2018) es su alto costo.\nTelevisor: QLED: Desarrollado por Samsung que emplea una nueva clase de luces led, inorgánicas, para lograr mejores colores y contraste, así como lograr un resultado perfecto sin importar el ángulo de visión.\nTelevisor Holográfico: Proyector que proyecta una serie de imágenes en movimiento sobre una pantalla transparente.\nDurante una conferencia de prensa en Berlín, dentro de la feria de muestras industriales y electrónica de consumo IFA 2009, Sony anunció sus planes de presentar avances en la experiencia de visualización 3D para los hogares. Sony se refiere a la tecnología 3D de algunos de sus televisores, como BRAVIA, que además de su pantalla LCD incorporaría un sistema para reproducir contenidos en alta definición, las imágenes 3D se verían mediante unas gafas especiales o sin estas.[cita requerida]\nAsimismo, actualmente otro de los componentes en lo que los fabricantes actualmente ponen especial énfasis son los microprocesadores, que les permite a los televisores nuevos tomar la mejor ventaja posible de las tecnologías anteriormente citadas, consiguiendo colores más realistas, imágenes más uniformes, reducción de ruido automática, escalado y restauración de fuentes de menor definición, reducción de ruido y más prestaciones dependiendo del procesador. Los más conocidos son X1 Extreme de Sony, α9 de LG Electronics, MT5598 de MediaTek y la serie 8000 de Philips.", "subsections": [{"name": "Funcionalidades", "text": "Algunos televisores incluyen funcionalidades como:\nModo hotel:[35]​ bloquea el acceso al menú, para que no se pueda cambiar nada, como descolocar o borrar canales, además de limitar el volumen para que no suba demasiado. También se pueden agregar canales especiales de los hoteles, para ayuda o servicio al cliente.\nTelevisión inteligente: Permite ver contenidos disponibles en Internet como videos y servicios bajo demanda como Netflix y YouTube, así como manejar aplicaciones y juegos. Los modelos más exitosos usan sistemas estandarizados que permiten una mayor variedad y compatibilidad de usos como Android TV.\nGrabador de video digital: Algunos modelos incluyen un grabador y un disco duro o la capacidad de usar memoria flash para registrar la programación, como grabar programas para verlos después, mostrar un programa y grabar otro de forma simultánea o manejar la pausa en vivo que permite pausar un programa para continuarlo después sin interrupciones. Incluso permite saltarse los comerciales u otros fragmentos no deseados.\nControl paterno: Los televisores con esta característica leen la información de clasificación de edad incrustada en la señal de TV para ser configurados para bloquear cualquier contenido que exceda la clasificación máxima designada como límite o coincida con contenidos marcados como inapropiados a menos que un padre o tutor introduzca la contraseña o clave."}]}, {"name": "Presente y futuro", "text": "Actualmente el futuro de la televisión es incierto, la llegada de nuevas plataformas tecnológicas, la atomización del mercado de la pauta publicitaria, la dispersión de las audiencias y los avances tecnológicos que desbordan los límites de los sentidos humanos, representan una amenaza latente sobre el incierto futuro de la industria televisiva, que si bien en la actualidad representa una porción muy importante de la economía global de servicios, su rol al interior de las industrias culturales podría sufrir importantes transformaciones en los próximos años.\nLa consolidación de las denominadas plataformas OTT (Over The Top) para la distribución de contenidos a través de Internet, representó un importante punto de inflexión para la televisión tradicional, ya que introdujo nuevos esquemas de consumo y distribución de los contenidos audiovisuales, ampliando la oferta de plataformas de consumo, creando nuevos modelos comerciales dentro de las denominadas industrias culturales y mejorando exponencialmente la experiencia para los usuarios, especialmente a través del Vídeo bajo demanda, que permite un consumo a la carta mediante catálogos de títulos, de tal forma que el usuario puede disfrutar a voluntad los contenidos audiovisuales, rompiendo así con la hegemonía de la linealidad como única estrategia de distribución.\nLas nuevas ventanas de consumo creadas por las plataformas OTT han desencadenado especulaciones por parte de diversos sectores de la sociedad, que sugieren la posible extinción de la televisión en los próximos años, a medida que las nuevas plataformas crecen en audiencias y se fortalecen económicamente,[36]​ incluso Reed Hastings, CEO de Netflix, asegura que la televisión se acabará antes de 2030.[37]​\nPara el experto Gabriel Levy,[38]​ la evidencia académica recabada hasta el momento, permite observar que el consumo lineal de contenidos, siguen siendo una práctica sociocultural arraigada en públicos adultos, especialmente aquellos que crecieron con la televisión como principal medio de comunicación en sus hogares, por lo que el consumo audiovisual sincrónico, que ocurre cada semana o cada día a la hora pactada por el canal, sigue siendo importante y se conjuga de manera complementaria con el consumo de video bajo demanda, en lo que ha denominado una \"convulsa pero emocionante era de la televisión\".[39]​\n\"No es posible determinar con certeza académica, si la televisión tradicional morirá en los próximos años o décadas, sin embargo en el presente, la evidencia muestra que ´La Televisión Tradicional´ sigue siendo una modalidad de consumo de contenidos audiovisuales arraigada en muchas practicas culturales, lo cual se explica desde múltiples perspectivas: Por un lado existe un fuerte arraigo en los hábitos de consumo de muchas generaciones que crecieron con la televisión y que aún la siguen consumiendo, de otro lado el lento crecimiento de la conectividad en zonas rurales y por último la Televisión evita la carga cognitiva de tomar decisiones sobre el contenido que se consume, dado que alguien tomó esa decisión previamente\".[39]​\nToby Miller coincide con esta mirada, afirmando que el poder institucional de la televisión permanece, aunque muchos lo consideren cosa del pasado. Para Miller, la continuidad de la industria televisiva se percibe en la producción de programas y en la publicidad: destacan que mucha de la producción de contenidos distribuidos por internet sigue siendo básicamente televisión, que las cadenas de TV tradicionales (señal abierta o cable) siguen siendo fundamentales para el mercado del streaming. En resumen, apunta en su libro Television Studies: The Basics (Los fundamentos de los estudios sobre la televisión, 2011), la gente sigue viendo televisión e incluso en cantidades más importantes que en otras décadas, lo único que ha cambiado es cómo se distribuyen los contenidos.[40]​\nMichael Wolff en su libro: Television is the New Television (La televisión es la nueva televisión, 2015), en lugar de potenciar las características interactivas propias de internet, las plataformas de vídeo bajo demanda decidieron favorecer estructuras, narrativas y estéticas ya establecidas por la industria televisiva. De la misma forma, argumenta que las plataformas de streaming trasladaron a las pantallas de computadora y teléfono comportamientos, valores, esquemas y experiencias de la industria televisiva -como la visualización pasiva de contenidos-, haciendo que lo que hasta ese momento se consideraban herramientas interactivas y de flujo bidireccional de información, en algo más parecido a la televisión.[40]​[41]​\nPor ahora, los puntos que ofrece la televisión, además de una mejor calidad de audio y vídeo, frente al vídeo bajo demanda, es la posibilidad de poder consumirla sin necesidad de contratar ninguna conexión ni pagar cuotas periódicas; además de servir (igual que la radio) para la transmisión de noticias urgentes o avisos en casos de emergencia en los que las conexiones de Internet no funcionen correctamente o sean inconvenientes. Además, existen datos que demuestran que todavía es un medio atractivo para las nuevas generaciones de niños y jóvenes,[42]​ y otros que demuestran que las ventas de los televisores HD entran en descenso a medida que se popularizan los nuevos televisores UHD.[43]​\nPerspectivas tecnológica\nLa situación tecnológica es bastante similar a la de las cámaras de teléfonos celulares. Las limitaciones del ojo humano, los problemas económicos heredados de La Gran Recesión y las consecuencias de la crisis provocada por la pandemia de COVID-19 limitan la capacidad de compra de los consumidores. En el caso de las cámaras de los teléfonos, los fabricantes usan la medida de los megapixeles como técnica de mercadotecnia. Sin embargo, en la realidad también importa la calidad del sensor para obtener colores y un contraste aceptables. Además en muchos casos, la diferencia de definición es demasiado sutil para ser captada por el ojo humano. También las limitaciones técnicas y económicas podrían afectar la utilidad de la resolución extra. Por ejemplo, si se sube la foto a un servicio de red social, puede ser escalada y comprimida para ahorrar almacenamiento y ancho de banda pero la mayoría de sus usuarios lo consideran aceptable al usar computadoras y teléfonos de bajo costo para contemplarla.\nEstas consideraciones también aplican a la televisión. Las personas con televisores HD o UHD no siempre consumen contenido de estas resoluciones. Esto se debe a que en muchos casos, el ojo humano no puede distinguir la diferencia entre estas calidades a menos que se contemple el contenido desde una distancia reducida o se compre un televisor de un enorme tamaño. Además la velocidad de las conexiones a Internet y la economía personal también influyen en estas decisiones. Por ejemplo, muchos siguen adquiriendo sus películas en DVD o rentándolas en Internet en versión convencional a pesar de poseer televisores HD o UHD por dos motivos: Sus conexiones a Internet no son lo suficientemente veloces para manejar las grandes cantidades de datos manejadas por los nuevos formatos y el precio de compra o renta suele ser mucho más bajo (usualmente al grado de poder comprar varios DVD por el precio de unos cuantos Blu-Ray y un solo disco Blu-Ray Ultra HD).[32]​ Además el éxito de los servicios y aplicaciones de video como YouTube y TikTok han modificado las expectativas de la audiencia que hoy en día prefiere contenidos más variados y atractivos en lugar de mayores resoluciones.\nMuchos servicios ya ofrecen contenidos en HD y UHD, sin embargo en la práctica su calidad se queda por detrás de lo que ofrecen las transmisiones de televisión digital terrestre, los discos Blu-Ray y Blu-Ray Ultra HD debido a las limitaciones del ancho de banda de las conexiones de muchos usuarios. Por ejemplo, para igualar la calidad de los discos y transmisiones convencionales se debería contar con un mínimo de 20 Mbps en la conexión. Y un mínimo de 50 Mbps para permitir consumir los contenidos y dejar que los demás usen la conexión al mismo tiempo sin retrasos ni saturaciones.\nPerspectivas de consumo\nLa aparición de nuevas plataformas y modelos de distribución de contenidos, apalancados por el fenómeno de la convergencia, han dado lugar a nuevas formas de consumo audiovisuales híbridas, que han propiciado la migración de los modelos y esquemas de distribución y visualización, los cuales parecieran fluir libremente entre tantas combinaciones posibles sea posible imaginar, de tal forma que los servicios de Streaming retoman aspectos de la televisión, mientras los medios tradicionales migran sus contenidos a plataformas en línea y la interactividad se consolida en múltiples universos mediáticos.\nDentro del amplio universo de nuevos modelos narrativos, es posible observar como algunos canales de televisión tradicional crean webisodes en YouTube, breves capítulos de cinco minutos de duración cuya trama está relacionada con la serie original de la cual se derivan, que son distribuidos exclusivamente en Internet. Estos episodios surgieron inicialmente en Estados Unidos como un método alternativo, tras la huelga de guionistas en Hollywood de 2007-2008, para llegar a una audiencia verdaderamente global. Posteriormente medios de todo el mundo incorporaron estos modelos, como por ejemplo \"Qué vida más triste\", que fue transmitido por el canal de España La Sexta.[44]​\nEsta hibridación de plataformas ha demostrado que algunos contenidos que en la pantalla televisiva no han tenido éxito, posteriormente en plataformas OTT pueden convertirse en un referente, tal y como ocurrió recientemente con la serie La Casa de Papel, que en la pantalla de televisión pasó sin mayor gloria, pero que se convirtió en Netflix en la serie de Habla hispana más vista globalmente,[45]​ o el programa \"The Greatest Dancer\" de la cadena británica BBC cuya cuenta de TikTok ha sido más exitosa que en la pantalla de Televisión.[46]​[47]​\nLas cadenas también han empezado a utilizar los teléfonos móviles para impulsar la televisión en vivo a través de la visualización de las aplicaciones móviles, publicidad, televisión social, y televisión móvil.[48]​ Se estima que el 86% de los estadounidenses utilizan sus teléfonos móviles mientras ve la televisión.", "subsections": []}, {"name": "Véase también", "text": " Portal:Televisión. Contenido relacionado con Televisión.\nAnexo:Cronología de la televisión\nTelevisión digital\nTelevisión digital terrestre\nTelevisión inteligente\nGuía electrónica de programas\nTelevisión por suscripción\nAlta definición\nAnálisis de audiencias\nBarras de color\nCadena de televisión\nCanal de televisión\nCarta de ajuste\nCuota de pantalla\nFrecuencias de los canales de televisión\nFree viewpoint television\nModelo de color RGB\nOn Screen Display (OSD)\nPrograma de televisión\nSistemas de difusión de televisión\nTarjeta sintonizadora de televisión\nTeletexto\nAnexo:Comparativa de tecnologías de visualización", "subsections": [{"name": "Emisiones televisivas populares", "text": "Contenedor televisivo\nInformativo televisivo\nComedia\nLate show\nPrograma de concurso\nRevista televisiva\nReality show\nSerie de televisión\nAnimación\nDocumental\nCine\nTelenovela\nDeportes"}, {"name": "Emisoras de televisión destacadas a nivel internacional", "text": "Paramount Global\nBBC\nWarner Bros. Discovery\nThe Walt Disney Company\nComcast\nSony\nFox Corporation\nTV Asahi\nTV Tokyo\nNHK\nRT\nDW"}, {"name": "Emisoras notables de los países de habla hispana", "text": "Telefe\nTelevisión Pública (Argentina)\nCanal 13 (Argentina)\nAtresmedia\nMediaset España\nRTVE\nMediapro\nGrupo Televisa\nTV Azteca\nCaracol Televisión\nCanal RCN\nTelevisión Nacional de Chile\nCanal 13 (Chile)\nChilevisión\nMega (Chile)\nLatina Televisión\nAmérica Televisión (Perú)\nSistema Nacional de Televisión (Paraguay) (SNT)\nTelefuturo\nCanal 10 Uruguay\nCanal 4 Uruguay\nTeleamazonas\nEcuavisa\nTelecorporación Salvadoreña\nVenevisión"}, {"name": "Emisoras notables de Brasil", "text": "Grupo Globo\nSBT\nRecordTV"}, {"name": "Mayores fabricantes de televisores", "text": "Samsung\nSony\nLG Electronics\nPanasonic\nSharp Corporation\nRCA\nPhilips\nHisense\nTCL Electronics\nHaier\nHitachi"}]}, {"name": "Referencias", "text": "↑ «On average how much TV does a person watch». www.qacollections.com (en inglés). Archivado desde el original el 4 de septiembre de 2019. Consultado el 8 de enero de 2020. \n↑ «How does television (TV) work?». Explain that Stuff (en inglés). Consultado el 8 de enero de 2020. \n↑ «Streaming: Qué es, Requisitos Técnicos y Ventajas». Listas Wiseplay 2018 Actualizadas y Gratis. 12 de septiembre de 2019. Consultado el 8 de enero de 2020. \n↑ «Contenido de transmisión por internet». Listas Wiseplay Actualizadas. \n↑ «Historic Figures: John Logie Baird (1888 - 1946)». BBC. Consultado el 28 de abril de 2015. \n↑ Error en la cita: Etiqueta <ref> no válida; no se ha definido el contenido de las referencias llamadas bbcbaird\n↑ Kamm and Baird, John Logie Baird: A Life, p. 69.\n↑ a b «Who invented the mechanical television? (John Logie Baird)». Google. 26 de enero de 2016. \n↑ U.S. Patent 1925554\n↑ Tiltman, R. F. «How \"Stereoscopic\" Television is Shown.» Radio News, nov. 1928.\n↑ Interview with Paul Lyons Archivado el 2 de febrero de 2009 en Wayback Machine., Historian and Control and Information Officer at Glasgow Central Station\n↑ pp. 99–101.\n↑ Udelson, J. H., The Great Television Race: A History of the American Television Industry 1925 – 1941, pp. 42, 73.\n↑ Burns, R.W., (1998). «Television: An international history of the formative years.». IEE History of Technology Series (en inglés). 22. (London: IEE,). p. 576. ISBN 0-85296-914-7. \n↑ \nGittel, Joachim (11 de octubre de 2008). «Spezialröhren». photographic album (en alemán). Jogis Röhrenbude. Consultado el 15 de enero de 2010. \n↑ \nEarly Television Museum. «TV Camera Tubes, German \"Super Iconoscope\" (1936)». photographic album (en inglés). Early Television Foundation and Museum. Archivado desde el original el 17 de junio de 2011. Consultado el 15 de enero de 2010. \n↑ sachen.de - Zur Ehrung von Manfred von Ardenne.\n↑ von Ardenne, Manfred (1938). «Das Elektronen-Rastermikroskop. Theoretische Grundlagen». Zeitschrift für Physik (en alemán) 109 (9–10): 553-572. Bibcode:1938ZPhy..109..553V. ISSN 0044-3328. doi:10.1007/BF01341584. \n↑ von Ardenne, Manfred (1938). «Das Elektronen-Rastermikroskop. Praktische Ausführung». Zeitschrift für technische Physik (en alemán) 19: 407-416. \n↑ Emisor de televisión de radio cátodo que Barón Manfred von Ardenne ha venido experimentando desde 1928 (foto), The New York Times, Agosto 16, 1931, p. XX8.\n↑ \"Television at the Berlin Radio Exhibition\", Television, Octubre 1931, p. 310, 311, 318.\n↑ Albert Abramson, Zworykin: Pioneer of Television, University of Illinois Press, 1995, p. 111.\n↑ Ardenne – Deutsches Historisches Museum.\n↑ Ardenne (enlace roto disponible en Internet Archive; véase el historial, la primera versión y la última). – Journal of Microscopy.\n↑ «RCA Trinoscope» (en inglés). Early Television Museum. Consultado el 26 de octubre de 2012. \n↑ Abramson, Albert; Sterling, Cristopher H. (2008). The History of Television, 1942 To 2000 (en inglés). Mc Farland. p. 44. ISBN 978-0-7864-3243-1. Consultado el 26 de octubre de 2012. \n↑ https://colors.dopely.top/inside-colors/the-most-visible-colors-for-human-eyes/\n↑ Radford B, Bartholomew R (2001). «Pokémon contagion: photosensitive epilepsy or mass psychogenic illness?». South Med J 94 (2): 197-204. PMID 11235034. \n↑ TV Tokyo. «Animated Program Image Effect Production Guidelines». Consultado el 21 de noviembre de 2008. \n↑ «Copia archivada». Archivado desde el original el 17 de agosto de 2016. Consultado el 29 de mayo de 2018. \n↑ Sony Training Services (2008). «High Definition Television». Archivado desde el original el 14 de enero de 2013. Consultado el 26 de octubre de 2012. \n↑ a b «HDTV (High-definition television». Explain that Stuff (en inglés). Consultado el 28 de febrero de 2021. \n↑ Tiltman, R. F. «How \"Stereoscopic\" Television is Shown.» Radio News, nov. 1928.\n↑ Kronomav Grabación en 3D\n↑ «Copia archivada». Archivado desde el original el 19 de diciembre de 2010. Consultado el 7 de junio de 2011. \n↑ Ortiz, Germán. «Internet vs. televisión: la contienda por la audiencia». El Economista. Consultado el 24 de noviembre de 2021. \n↑ «La televisión tradicional morirá en 2030, según vaticina el CEO de Netflix». TecnoXplora. 1 de enero de 2015. Consultado el 24 de noviembre de 2021. \n↑ galevy (23 de noviembre de 2021). «La evolución del audiovisual en el nuevo orden digital: El Caso Chileno». Andina Link. Consultado el 24 de noviembre de 2021. \n↑ a b galevy (16 de noviembre de 2021). «binge-watching y la crisis de la Televisión Tradicional». Andina Link. Consultado el 24 de noviembre de 2021. \n↑ a b Error en la cita: Etiqueta <ref> no válida; no se ha definido el contenido de las referencias llamadas :4\n↑ Wolff, Michael (2015). Television is the New Television. The Unexpected Triumph of Old Media in the Digital Age (en inglés). Nueva York: Penguin. ISBN 978-0-698-40552-3. \n↑ Estudios sobre oferta y consumo de programación para público infantil en radio, televisión radiodifundida y restringida. Abril 2018\n↑ «Full HD TV shipments worldwide 2006-2018». Statista (en inglés). Consultado el 8 de enero de 2020. \n↑ «Confirmado la Sexta emitirá Qué vida más triste». Blog Vayatele. 13 de agosto de 2008. Consultado el 27 de mayo de 2009. \n↑ Cinemanía (28 de septiembre de 2021). «‘La casa de papel’ se cuela entre las 10 series más vistas de Netflix en toda su historia». Cinemanía. Consultado el 24 de noviembre de 2021. \n↑ C. Pérez-Lanzac (10 de octubre de 2007). «¿Le roba YouTube audiencia a La 2?». El País (España). Consultado el 27 de mayo de 2009. \n↑ https://tbivision.com/2019/12/10/the-case-for-tv-and-tiktok/\n↑ «4 Ways Smartphones Can Save Live TV». Tvgenius.net. Archivado desde el original el 14 de mayo de 2012. Consultado el 4 de junio de 2012. ", "subsections": []}, {"name": "Bibliografía", "text": "García-Calderón López, Eugenio. Televisión. Volumen I. Departamento de publicaciones de la E.T.S. Ingenieros de Telecomunicaciones. ISBN 84-7402-099-9. \nMaymo, Fernando. Curso de Radio por correo. Escuela de Radio Maymo. Depósito legal B-19103-1963. \nBethencourt Machado, Tomás. Televisión digital. ISBN 84-607-3527-3. ", "subsections": []}, {"name": "Enlaces externos", "text": " Wikcionario  tiene definiciones y otra información sobre televisión.\n Wikiquote alberga frases célebres sobre Televisión.\n Wikinoticias tiene noticias relacionadas con Televisión.\nAsociación de Televisión Educativa Iberoamericana\nEntrevista a Guillermo González Camarena, hijo del inventor mexicano homónimo que patentó un sistema de Televisión en color Archivado el 20 de diciembre de 2007 en Wayback Machine.\nShot Informativo (Tec de Monterrey) TV & Internet", "subsections": []}]}
